[
  {
    "id": 103000131256,
    "title": "Ticket Statuses Explained and How To Use Them",
    "text": "TABLE OF CONTENTS Introduction Status Meanings Open Waiting on Customer Customer Responded Workaround Provided Waiting on Third Party Pending (Exceptional Use!) Scheduled Waiting on Development Waiting on Solutions Delivery Passed to Customer Success Manager Resolved Closed - DO NOT USE Support on Stop (TAKE NOTE, BUT DO NOT USE!) Introduction The following are the possible ticket statuses that a ticket can have (screenshot from settings June 2023). Note: Some statuses are set automatically, so please read this whole article to see when and why. If the SLA timer toggle is on, then the SLA clock is running while a ticket is in this status (unless it's outside of the customer's supported hours e.g. overnight). To see more on SLAs, refer to SLA Target Times Note that the SLA timer is always running when the ticket is Open status and is within business hours Customers might have a different description than the internal one (e.g. \"Waiting on Development\" is shown to the customer as still In Progress because the SLA timer is still running because it's K3's SLA, not just Support) The greyed out ones above are system statuses which cannot be edited/removed. Status Meanings Open Every new ticket is marked as Open. It means that an agent from your team is yet to resolve the complaint and move it on to other statuses. Note that there is no need for a \"New\" status because this is also shown automatically by the system as a \"State\" Waiting on Customer Whenever you request information from a customer which means you can't meaningfully investigate any further until you receive it, set the ticket to this status. There is an easy way to send the request and set the status at the same time by clicking on the dropdown which is part of the Send button when doing a Reply NOTE While a ticket is Waiting on Customer (i..e the SLA timer is paused), the Resolve By time on a ticket is not shown as it changes for every second we are waiting for a customer. If the customer replies (via email or portal), the ticket status will automatically be set to Open again Customer Responded If a ticket is in any of these statuses and a customer replies/adds a note on the portal, the ticket will be set to Customer Responded status.: Open Waiting on Customer Workaround Provided This allows agents to easily see which tickets need to be looked at because the customer has responded, but is also designed to work around the issue that the system \"State\" indicator stays at \"Customer Responded\" even when you've looked at the response - the only way to clear it is to send a response back which isn't always appropriate Once you've looked at a customer response, you should change the Status to whatever's appropriate - this may be Waiting for Customer if you reply and ask them something, or if you do not want to send a reply, simply set the Status to \"Open\". This will only work if the Requestor (contact) of the ticket replies, not if anyone else who might be copied on the ticket replies There are target Next Response times defined on Keeping Customers Updated and Next Response SLA Workaround Provided If you provide a customer a workaround (i.e. not permanent fix, but something which means they can still use the system, then set the ticket Status to \"Workaround Provided\". This is important because it's one of the SLA measurements and also lets the customer know that we think we've given them something to help, but will still seek a permanent fix Waiting on Third Party Use this status if we are waiting for one of our suppliers (i.e. someone external) to provide us with a solution/deliverable. It will still show as In Progress to customers because we don't necessarily want customers to know that we have a third party doing the work (and it's still our responsibility to make sure the supplier delivers). The customer has an SLA with K3, not a third party, so it’s still our responsibility to chase the supplier etc to try to get things done within SLA, hence the SLA timer will keep running while the ticket is in this status. If the Third Party is not one of our suppliers, but one that is contracted to the customer, then possibly use Pending status (see guidance below) Pending (Exceptional Use!) We are not generally using the Pending status because it's a default one which is intended for when you are waiting for others (customer, development, 3rd party), but we have decided not to use this generic/ambiguous status, instead giving more precise statuses. BUT there is one use for it (which will be used very rarely) which is when we are waiting on an external party which we have no control over, and where we have no contract with the third party. An example for when we should use Pending would be downtime at a payment provider like NETS or Verifone (customers contract with them, not us). The SLA Timer is Paused during this status. In the example of a payment provider having issues, we don't want to set the ticket to \"Waiting on Customer\", but equally, we don't want the ticket set at a status where our SLA timer is running. Scheduled We are using the status when an agent agrees with the customer that the raised request / issue will be looked later. When this status is selected when creating the ticket another field Date Scheduled For is shown with a date picker. Note that the SLA Timer is Paused during this status. The scheduled date field can also be added to the column in tickets views, but will also be visible to customer on the portal. Waiting on Development If you think you have a bug, or a K3 Software change which Development should fix/review, set this status and send the details to the relevant Development team. If the Development team uses Jira, then you can create a Jira automatically, see the status, and exchange comments/notes automatically between the systems. For more information, please see Creating a Jira ticket for QA or Development Waiting on Solutions Delivery Used for if a ticket has been passed to one of our solution delivery consultants. This is usually if we need their help and we are still responsible for resolving the ticket. If a ticket has been identified as chargeable, and a CSM has raised an Order for a consultant to do it, you would normally resolve the ticket as Support are no longer involved (i.e. you wouldn't use this status) Passed to Customer Success Manager If you think the request is chargeable, or have passed to the Customer Success Manager for any other reason, and the ticket can't be resolved yet, then set it to this status while you wait for the CSM to get back to you. Use a ticket note or thread to @mention them and they will be notified that they are required to assist, and they can reply on a note or thread as well. If you pass to a CSM, and they confirm that they have now taken over the request and are in contact with the customer, then you can resolve the ticket. If you just want to consult a CSM on a ticket, you don't have to change the status to Passed to Customer Success Manager if you are still working on the ticket. Resolved When you are reasonably sure that you have provided the customer with a final solution to their problem, set the status to resolved. For more information see Resolve a ticket (don't close it!) Note that customers will still a resolved ticket as closed on the portal (see first screenshot) Closed - DO NOT USE (but customers can and if they do, you still need to update the ticket)! Resolved tickets are automatically closed - see Resolve a ticket (don't close it!) which explains why you should not use the Close button or Closed status. If one of your tickets is closed by a customer, you will need to add a Resolution Category and Resolution Summary (customer is not given the option to add these if they close the ticket, but the category is important and the summary might just be \"Customer closed so assume fix worked\".) Note: If you do click the Close button, there is an automation which will undo this and set the ticket to resolved anyway :-) Customers do have a Close Issue button, and that will set the ticket to Closed (and not automatically set it back to Resolved) If a response is received on a closed ticket, the closed ticket will not be updated, but a new one will be created with subject \"Response received on closed ticket and it will inherit the properties of the closed ticket. Support on Stop (TAKE NOTE, BUT DO NOT USE!) This status is set automatically if the Company record has the checkbox \"Support on Stop\" ticked. This applies to new tickets created if the checkbox is ticked, and to any existing tickets if they're edited. Setting this status automatically is to show you that you should not work on the ticket at all until the CSM or Support Managers confirms (via discussing with Finance) that the customer has paid the invoice (in which case the Company record will be updated, but the tickets will need their status reverting to the previous status by an agent). You can see the previous status by viewing all activities (click the \"Show activities\" button) and search for the last Status Updated tag (which can be seen in the screenshot in the Closed status section above).",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-06-14T17:18:00+01:00",
    "updated_at": "2024-07-17T15:22:06+01:00",
    "status": 2,
    "tags": [],
    "description": "<p><a href=\"#Introduction\" dir=\"ltr\" data-identifyelement=\"522\"></a></p><p class=\"fd-toc\"><strong>TABLE OF CONTENTS</strong></p><ul><li><a href=\"#Introduction\">Introduction</a></li><li><a href=\"#Status-Meanings\">Status Meanings</a><ul><li><a href=\"#Open\">Open</a></li><li><a href=\"#Waiting-on-Customer\">Waiting on Customer</a></li><li><a href=\"#Customer-Responded\">Customer Responded</a></li><li><a href=\"#Workaround-Provided\">Workaround Provided</a></li><li><a href=\"#Waiting-on-Third-Party\">Waiting on Third Party</a></li><li><a href=\"#Pending-(Exceptional-Use!)\">Pending (Exceptional Use!)</a></li><li><a href=\"#Scheduled\">Scheduled</a></li><li><a href=\"#Waiting-on-Development\">Waiting on Development</a></li><li><a href=\"#Waiting-on-Solutions-Delivery\">Waiting on Solutions Delivery</a></li><li><a href=\"#Passed-to-Customer-Success-Manager\">Passed to Customer Success Manager</a></li><li><a href=\"#Resolved\">Resolved</a></li><li><a href=\"#Closed---DO-NOT-USE\">Closed - DO NOT USE</a></li><li><a href=\"#Support-on-Stop-(TAKE-NOTE,-BUT-DO-NOT-USE!)\">Support on Stop (TAKE NOTE, BUT DO NOT USE!)</a></li></ul></li></ul><p data-identifyelement=\"585\"><br data-identifyelement=\"586\"></p><p data-identifyelement=\"553\"><br data-identifyelement=\"554\"></p><h1 data-identifyelement=\"555\" dir=\"ltr\" id=\"Introduction\"><strong data-identifyelement=\"556\">Introduction</strong></h1><p data-identifyelement=\"557\" dir=\"ltr\">The following are the possible ticket statuses that a ticket can have (screenshot from settings June 2023).</p><p data-identifyelement=\"558\" dir=\"ltr\">Note:</p><ul data-identifyelement=\"559\"><li data-identifyelement=\"560\" dir=\"ltr\">Some statuses are set automatically, so please read this whole article to see when and why.</li><li data-identifyelement=\"561\" dir=\"ltr\">If the SLA timer toggle is on, then the SLA clock is running while a ticket is in this status (unless it's outside of the customer's supported hours e.g. overnight). To see more on SLAs, refer to <a data-identifyelement=\"587\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000229406?lang=en\">SLA Target Times</a><ul data-identifyelement=\"588\" style=\"list-style-type: circle;\"><li data-identifyelement=\"561\" dir=\"ltr\">Note that the SLA timer is always running when the ticket is Open status and is within business hours</li></ul></li><li data-identifyelement=\"562\" dir=\"ltr\">Customers might have a different description than the internal one (e.g. \"Waiting on Development\" is shown to the customer as still In Progress because the SLA timer is still running because it's K3's SLA, not just Support)</li></ul><p data-identifyelement=\"563\" dir=\"ltr\"><br data-identifyelement=\"564\"></p><p data-identifyelement=\"565\" dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067198838/original/d5q_ucRZ0oxsi5wCXuh-y0Fs6hjZ7-C31g.png?1700819467\" style=\"width: 342px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103067198838\" data-identifyelement=\"589\"><br data-identifyelement=\"590\"></p><p data-identifyelement=\"565\" dir=\"ltr\"><br data-identifyelement=\"591\"></p><p data-identifyelement=\"567\" dir=\"ltr\">The greyed out ones above are system statuses which cannot be edited/removed.</p><p data-identifyelement=\"568\" dir=\"ltr\"><br data-identifyelement=\"569\"></p><h1 data-identifyelement=\"570\" dir=\"ltr\" id=\"Status-Meanings\"><strong data-identifyelement=\"571\">Status Meanings</strong></h1><h2 data-identifyelement=\"572\" dir=\"ltr\" id=\"Open\"><span data-identifyelement=\"573\" dir=\"ltr\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"574\" style=\"box-sizing: border-box; font-weight: bold;\">Open</strong></span></h2><p data-identifyelement=\"575\" dir=\"ltr\"><span data-identifyelement=\"576\" dir=\"ltr\" style=\"box-sizing: border-box; line-height: 16px;\">Every new ticket is marked as Open. It means that an agent from your team is yet to resolve the complaint and move it on to other statuses.</span></p><p data-identifyelement=\"577\" dir=\"ltr\"><span data-identifyelement=\"578\" dir=\"ltr\" style=\"box-sizing: border-box; line-height: 16px;\">Note that there is no need for a \"New\" status because this is also shown automatically by the system as a \"State\"</span></p><p data-identifyelement=\"579\" dir=\"ltr\"><span data-identifyelement=\"580\" dir=\"ltr\" style=\"box-sizing: border-box; line-height: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103029848114/original/k7d77ExLpzh-ilP8ONqTu5F4E8yATcfjBQ.png?1686757353\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103029848114\" data-identifyelement=\"581\"></span><br data-identifyelement=\"582\"></p><p data-identifyelement=\"583\" dir=\"ltr\"><br data-identifyelement=\"584\"></p><h2 data-identifyelement=\"585\" dir=\"ltr\" id=\"Waiting-on-Customer\"><strong data-identifyelement=\"586\">Waiting on Customer</strong></h2><p data-identifyelement=\"587\" dir=\"ltr\">Whenever you request information from a customer which means you can't meaningfully investigate any further until you receive it, set the ticket to this status. There is an easy way to send the request and set the status at the same time by clicking on the dropdown which is part of the Send button when doing a Reply</p><p data-identifyelement=\"588\" dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103029849777/original/bCNyW91l7RCuxvkgi2yWUg5lOTw60nem9A.png?1686757818\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103029849777\" data-identifyelement=\"589\"></p><p data-identifyelement=\"590\" dir=\"ltr\"><br data-identifyelement=\"591\"></p><p data-identifyelement=\"592\" dir=\"ltr\"><strong data-identifyelement=\"593\"><span data-identifyelement=\"596\" style=\"color: rgb(184, 49, 47); font-size: 16px;\">NOTE</span></strong></p><ul data-identifyelement=\"592\"><li data-identifyelement=\"594\" dir=\"ltr\"><span data-identifyelement=\"597\" dir=\"ltr\" style=\"color: rgb(184, 49, 47); font-size: 16px;\">While a ticket is Waiting on Customer (i..e the SLA timer is paused), the Resolve By time on a ticket is not shown as it changes for every second we are waiting for a customer.</span></li><li data-identifyelement=\"594\" dir=\"ltr\"><span data-identifyelement=\"597\" dir=\"ltr\" style=\"color: rgb(184, 49, 47); font-size: 16px;\">If the customer replies (via email or portal), the ticket status will <u data-identifyelement=\"598\">automatically be set to Open</u> again</span></li></ul><p data-identifyelement=\"595\" dir=\"ltr\"><br data-identifyelement=\"596\"></p><h2 data-identifyelement=\"597\" dir=\"ltr\" id=\"Customer-Responded\"><strong data-identifyelement=\"598\" dir=\"ltr\">Customer Responded</strong></h2><p data-identifyelement=\"593\" dir=\"ltr\">If a ticket is in any of these statuses and a customer replies/adds a note on the portal, the ticket will be set to <em data-identifyelement=\"595\" dir=\"ltr\">Customer Responded</em> status.:</p><ul><li data-identifyelement=\"593\" dir=\"ltr\">Open</li><li data-identifyelement=\"593\" dir=\"ltr\">Waiting on Customer&nbsp;</li><li data-identifyelement=\"593\" dir=\"ltr\">Workaround Provided</li></ul><p data-identifyelement=\"593\" dir=\"ltr\">This allows agents to easily see which tickets need to be looked at because the customer has responded, but is also designed to work around the issue that the system \"State\" indicator stays at \"Customer Responded\" even when you've looked at the response - the only way to clear it is to send a response back which isn't always appropriate</p><p data-identifyelement=\"596\" dir=\"ltr\"><br data-identifyelement=\"597\"></p><p data-identifyelement=\"598\" dir=\"ltr\">Once you've looked at a customer response, you should change the Status to whatever's appropriate - this may be Waiting for Customer if you reply and ask them something, or if you do not want to send a reply, simply set the Status to \"Open\".&nbsp;</p><p data-identifyelement=\"598\" dir=\"ltr\"><br></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\">This will only work if the Requestor (contact) of the ticket replies, not if anyone else who might be copied on the ticket replies</pre><p><br></p><p data-identifyelement=\"599\" dir=\"ltr\"><br></p><p data-identifyelement=\"599\" dir=\"ltr\"><span style=\"color: rgb(184, 49, 47); font-size: 16px;\">There are target Next Response times defined on <a href=\"https://k3support.freshdesk.com/a/solutions/articles/103000251629?lang=en#How-Quickly-Should-We-Respond-to-Customer-Updates?\" rel=\"noopener noreferrer\" style=\"box-sizing: border-box;  color: rgb(44, 92, 197); text-decoration: underline; user-select: auto; outline: 0px; font-family: Calibri, sans-serif; font-size: 15px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;\" target=\"_blank\">Keeping Customers Updated and Next Response SLA</a> </span></p><p data-identifyelement=\"599\" dir=\"ltr\"><br data-identifyelement=\"600\"></p><h2 data-identifyelement=\"597\" dir=\"ltr\" id=\"Workaround-Provided\"><strong data-identifyelement=\"598\">Workaround Provided</strong></h2><p data-identifyelement=\"233\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">If you provide a customer a workaround (i.e. not &nbsp;permanent fix, but something which means they can still use the system, then set the ticket Status to \"Workaround Provided\".</p><p data-identifyelement=\"234\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><br data-identifyelement=\"235\" style=\"box-sizing: border-box;\"></p><p data-identifyelement=\"236\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">This is important because it's one of the SLA measurements and also lets the customer know that we think we've given them something to help, but will still seek a permanent fix</p><p data-identifyelement=\"599\" dir=\"ltr\"><br data-identifyelement=\"600\"></p><h2 data-identifyelement=\"601\" dir=\"ltr\" id=\"Waiting-on-Third-Party\"><strong data-identifyelement=\"602\">Waiting on Third Party</strong></h2><p data-identifyelement=\"603\" dir=\"ltr\">Use this status if we are waiting for one of our suppliers (i.e. someone external) to provide us with a solution/deliverable. It will still show as In Progress to customers because we don't necessarily want customers to know that we have a third party doing the work (and it's still our responsibility to make sure the supplier delivers).</p><p><br></p><p><br></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\">The customer has an SLA with K3, not a third party, so it’s still our responsibility to chase the supplier etc to try to get things done within SLA, hence the SLA timer will keep running while the ticket is in this status.\n\nIf the Third Party is not one of our suppliers, but one that is contracted to the customer, then possibly use Pending status (see guidance below)</pre><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><h2 data-identifyelement=\"679\" id=\"Pending-(Exceptional-Use!)\"><span data-identifyelement=\"680\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"681\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: bold;\">Pending (Exceptional Use!)</strong></span></h2><p data-identifyelement=\"682\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">We are not generally using the Pending status because it's a default one which is intended for when you are waiting for others (customer, development, 3rd party), but we have decided not to use this generic/ambiguous status, instead giving more precise statuses.</span></p><p data-identifyelement=\"682\"><br></p><p data-identifyelement=\"682\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">BUT there is one use for it (which will be used very rarely) which is when we are waiting on an external party which we have no control over, and where we have no contract with the third party. An example for when we should use Pending would be downtime at a payment provider like NETS or Verifone (customers contract with them, not us).</span></p><p data-identifyelement=\"682\"><br></p><p data-identifyelement=\"682\" dir=\"ltr\"><span dir=\"ltr\" style=\"color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 13px; font-weight: 400; text-align: left; text-indent: 0px; display: inline !important;\">The SLA Timer is Paused during this status. In the example of a payment provider having issues, we don't want to set the ticket to \"Waiting on Customer\", but equally, we don't want the ticket set at a status where our SLA timer is running.</span></p><p><br></p><p data-identifyelement=\"684\"><br data-identifyelement=\"605\"></p><h2 data-identifyelement=\"679\" id=\"Scheduled\"><span data-identifyelement=\"680\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"681\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: bold;\">Scheduled</strong></span></h2><p data-identifyelement=\"682\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">We are using the status when an agent <u data-identifyelement=\"601\" dir=\"ltr\">agrees with the customer</u> that the raised request / issue will be looked later.&nbsp;</span><br data-identifyelement=\"606\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">When this status is selected when creating the ticket another field <strong data-identifyelement=\"607\" dir=\"ltr\">Date Scheduled For&nbsp;</strong>is shown with a date picker.</span></p><p data-identifyelement=\"682\"><br data-identifyelement=\"602\"></p><p data-identifyelement=\"682\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">Note that &nbsp;the SLA Timer is Paused during this status.</span></p><p data-identifyelement=\"603\"><br data-identifyelement=\"609\"></p><p data-identifyelement=\"604\"><span data-identifyelement=\"683\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103036459274/original/gdxL5NsM3laPFUig7Dyr-cXlbdnLHKbjag.png?1689345297\" style=\"width: 670px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103036459274\" data-identifyelement=\"610\">&nbsp;The scheduled date field can also be added to the column in tickets views, but will also be visible to customer on the portal.</span></p><p data-identifyelement=\"605\"><br data-identifyelement=\"606\"></p><p data-identifyelement=\"604\" dir=\"ltr\"><br data-identifyelement=\"605\"></p><h2 data-identifyelement=\"606\" dir=\"ltr\" id=\"Waiting-on-Development\"><strong data-identifyelement=\"601\">Waiting on Development</strong></h2><p data-identifyelement=\"607\" dir=\"ltr\">If you think you have a bug, or a K3 Software change which Development should fix/review, set this status and send the details to the relevant Development team.</p><p data-identifyelement=\"608\" dir=\"ltr\"><br data-identifyelement=\"609\"></p><p data-identifyelement=\"610\" dir=\"ltr\">If the Development team uses Jira, then you can create a Jira automatically, see the status, and exchange comments/notes automatically between the systems. For more information, please see <a data-identifyelement=\"611\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000131253\" rel=\"noopener noreferrer\" target=\"_blank\"><strong data-identifyelement=\"612\">Creating a Jira ticket for QA or Development</strong></a></p><p data-identifyelement=\"613\" dir=\"ltr\"><br data-identifyelement=\"614\"></p><h2 data-identifyelement=\"615\" dir=\"ltr\" id=\"Waiting-on-Solutions-Delivery\"><strong data-identifyelement=\"616\" dir=\"ltr\">Waiting on Solutions Delivery</strong></h2><p data-identifyelement=\"617\" dir=\"ltr\">Used for if a ticket has been passed to one of our solution delivery consultants. This is usually if we need their help and we are still responsible for resolving the ticket.</p><p data-identifyelement=\"618\" dir=\"ltr\">If a ticket has been identified as chargeable, and a CSM has raised an Order for a consultant to do it, you would normally resolve the ticket as Support are no longer involved (i.e. you wouldn't use this status)</p><p data-identifyelement=\"619\" dir=\"ltr\"><br data-identifyelement=\"620\"></p><h2 data-identifyelement=\"621\" id=\"Passed-to-Customer-Success-Manager\"><span data-identifyelement=\"622\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"623\">Passed to Customer Success Manager</strong></span></h2><p data-identifyelement=\"624\"><span data-identifyelement=\"625\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If you think the request is chargeable, or have passed to the Customer Success Manager for any other reason, and the ticket can't be resolved yet, then set it to this status while you wait for the CSM to get back to you. Use a ticket note or thread to @mention them and they will be notified that they are required to assist, and they can reply on a note or thread as well.</span></p><p data-identifyelement=\"624\"><br data-identifyelement=\"602\"></p><p data-identifyelement=\"624\"><span data-identifyelement=\"625\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If you pass to a CSM, and they confirm that they have now taken over the request and are in contact with the customer, then you can resolve the ticket.</span></p><p data-identifyelement=\"624\"><br data-identifyelement=\"603\"></p><p data-identifyelement=\"624\"><span data-identifyelement=\"625\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If you just want to consult a CSM on a ticket, you don't have to change the status to Passed to Customer Success Manager if you are still working on the ticket.</span></p><p data-identifyelement=\"626\" dir=\"ltr\"><br data-identifyelement=\"627\"></p><h2 data-identifyelement=\"628\" dir=\"ltr\" id=\"Resolved\"><span data-identifyelement=\"629\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box;\"><strong data-identifyelement=\"630\" style=\"box-sizing: border-box; font-weight: bold;\">Resolved</strong></span></h2><p data-identifyelement=\"631\" dir=\"ltr\"><span data-identifyelement=\"632\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box;\">When you are reasonably sure that you have provided the customer with a final solution to their problem, set the status to resolved. For more information see <a data-identifyelement=\"633\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000120976?lang=en\" rel=\"noreferrer\" target=\"_blank\"><strong data-identifyelement=\"634\">Resolve a ticket (don't close it!)</strong></a></span></p><p data-identifyelement=\"635\" dir=\"ltr\"><br data-identifyelement=\"636\"></p><p data-identifyelement=\"637\" dir=\"ltr\"><span data-identifyelement=\"638\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box;\">Note that customers will still a resolved ticket as closed on the portal (see first screenshot)</span></p><p data-identifyelement=\"639\" dir=\"ltr\"><br data-identifyelement=\"640\"></p><h2 data-identifyelement=\"641\" dir=\"ltr\" id=\"Closed---DO-NOT-USE\"><span data-identifyelement=\"642\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"643\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: bold;\">Closed - DO NOT USE</strong></span></h2><p data-identifyelement=\"641\" dir=\"ltr\"><span data-identifyelement=\"642\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"643\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: bold;\">(but customers can and if they do, you still need to update the ticket)!</strong></span></p><p data-identifyelement=\"644\" dir=\"ltr\"><span data-identifyelement=\"645\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">Resolved tickets are automatically closed - see <strong data-identifyelement=\"646\" style=\"box-sizing: border-box; font-weight: 700; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 13px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><a data-identifyelement=\"647\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000120976?lang=en\" rel=\"noreferrer\" style=\"box-sizing: border-box; background-color: transparent; color: rgb(44, 92, 197); text-decoration: none; user-select: auto;\" target=\"_blank\">Resolve a ticket (don't close it!)</a></strong> which explains why you should not use the Close button or Closed status.</span></p><p data-identifyelement=\"648\" dir=\"ltr\"><br data-identifyelement=\"649\"></p><p data-identifyelement=\"650\" dir=\"ltr\"><span data-identifyelement=\"651\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If one of your tickets is closed by a customer, you will need to add a Resolution Category and Resolution Summary (customer is not given the option to add these if they close the ticket, but the category is important and the summary might just be \"Customer closed so assume fix worked\".)</span></p><p data-identifyelement=\"652\" dir=\"ltr\"><span data-identifyelement=\"653\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103029859137/original/cBLj9im2FYLSGpGDMz97sr2BjVeb8fJadA.png?1686761542\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103029859137\" data-identifyelement=\"654\"></span><br data-identifyelement=\"655\"></p><p data-identifyelement=\"656\" dir=\"ltr\"><span data-identifyelement=\"657\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"658\" dir=\"ltr\">Note:</strong></span></p><ul data-identifyelement=\"659\"><li data-identifyelement=\"660\" dir=\"ltr\"><span data-identifyelement=\"661\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If you do click the Close button, there is an automation which will undo this and set the ticket to resolved anyway :-)</span></li><li data-identifyelement=\"662\" dir=\"ltr\"><span data-identifyelement=\"663\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">Customers do have a Close Issue button, and that will set the ticket to Closed (and not automatically set it back to Resolved)</span></li><li data-identifyelement=\"662\" dir=\"ltr\"><span data-identifyelement=\"663\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">If a response is received on a closed ticket, the closed ticket will not be updated, but a new one will be created with subject \"Response received on closed ticket and it will inherit the properties of the closed ticket.</span></li></ul><p data-identifyelement=\"664\"><br data-identifyelement=\"665\"></p><h2 data-identifyelement=\"666\" id=\"Support-on-Stop-(TAKE-NOTE,-BUT-DO-NOT-USE!)\"><span data-identifyelement=\"667\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><strong data-identifyelement=\"668\" dir=\"ltr\">Support on Stop (TAKE NOTE, BUT DO NOT USE!)</strong></span></h2><p data-identifyelement=\"669\"><span data-identifyelement=\"670\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">This status is set automatically if the Company record has the checkbox \"Support on Stop\" ticked. This applies to new tickets created if the checkbox is ticked, and to any existing tickets if they're edited.</span></p><p data-identifyelement=\"671\"><br data-identifyelement=\"672\"></p><p data-identifyelement=\"673\"><span data-identifyelement=\"674\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\">Setting this status automatically is to show you that you should not work on the ticket at all until the CSM or Support Managers confirms (via discussing with Finance) that the customer has paid the invoice (in which case the Company record will be updated, but the tickets will need their status reverting to the previous status by an agent). You can see the previous status by viewing all activities (click the \"Show activities\" button) and search for the last Status Updated tag (which can be seen in the screenshot in the Closed status section above).</span><span data-identifyelement=\"675\" dir=\"ltr\" rel=\"tempredactor\" style=\"box-sizing: border-box; line-height: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103029859465/original/eVknS_HL4IES-yGFoWKBNZSIXJCxmQ690w.png?1686761733\" style=\"width: 140px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103029859465\" data-identifyelement=\"676\"></span></p><p data-identifyelement=\"684\"><br data-identifyelement=\"604\"></p><p data-identifyelement=\"684\"><br></p><p data-identifyelement=\"682\" dir=\"ltr\"><br data-identifyelement=\"607\"></p>",
    "user_id": 103023352668,
    "thumbs_up": 1,
    "thumbs_down": 0,
    "hits": 11,
    "seo_data": {},
    "modified_at": "2024-07-17T15:22:06+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000162468,
    "title": "Selecting a Site for the ticket",
    "text": "If the Site has not been selected by the customer on the portal, or if they have selected the zz Unlisted... Site, you will need to update the Site on the ticket or create a new Site- see Adding or Editing a Site / Store. Note that customers should have entered the Site name in the description if they selected zz Unlisted Do not log any tickets using the zz Unlisted... site - it is for \"emergency use\" by customers on the portal only,",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-07-17T17:35:05+01:00",
    "updated_at": "2024-02-14T15:41:58+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 16px;\">If the Site has not been selected by the customer on the portal, or if they have selected the zz Unlisted... Site, you will need to update the Site on the ticket or create a new Site- see <a href=\"https://support.k3btg.com/a/solutions/articles/103000130452?lang=en\" rel=\"noopener noreferrer\" target=\"_blank\">Adding or Editing a Site / Store</a>.&nbsp;</span></p><p dir=\"ltr\"><span style=\"font-size: 16px;\"><br></span></p><p dir=\"ltr\" style=\"font-size: 16px;\"><span style=\"font-size: 16px;\">Note that customers should have entered the Site name in the description if they selected zz Unlisted</span></p><p dir=\"ltr\" style=\"font-size: 16px;\"><span style=\"font-size: 16px;\"><br></span></p><p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 16px;\">Do not log any tickets using the zz Unlisted... site - it is for \"emergency use\" by customers on the portal only,</span></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2024-02-14T15:41:58+00:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000120975,
    "title": "How to pass a ticket to another team",
    "text": "If you want to pass a ticket to another team, then simply select the relevant team in the ticket and click Update. Once updated, the relevant people will be listed in the Agents dropdown box, but you do not need to select an agent (unless you've already agreed who you're going to pass it to).",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-05-22T18:22:47+01:00",
    "updated_at": "2023-06-14T17:23:16+01:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\"><span style=\"font-size: 16px;\">If you want to pass a ticket to another team, then simply select the relevant team in the ticket and click Update. Once updated, the relevant people will be listed in the Agents dropdown box, but you do not need to select an agent (unless you've already agreed who you're going to pass it to).</span></p>",
    "user_id": 103023352668,
    "thumbs_up": 1,
    "thumbs_down": 0,
    "hits": 6,
    "seo_data": {},
    "modified_at": "2023-06-15T11:13:20+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000120976,
    "title": "How to resolve a ticket (don't close it!)",
    "text": "When resolving a ticket, you will be asked to enter the Resolution Summary. This will appear on the customer portal and in any customer reports, so please make this just a summary (details can be in a Note entered before resolving the ticket). Because the customer sees this, be polite and use language that the customer can understand and make sure it's meaningful (if you can include the cause of the issue if applicable, even better). Resolution Summary Good Example: \"Logged onto POS, reset the widget, and customer confirmed it's now working\" Bad Example: \"Customer confirmed it's now working\" Amazing Example:\"Issue caused by power-failure mid-transaction, so I logged onto the POS, reset the widget, and customer confirmed it's working\" When a customer/CSM/Support manager sees the Resolution Summary, it has to convey what was done to resolve the ticket (without going into all the details which may be in the ticket unless they want to) You are also asked to select the Resolution Category and Resolution Sub-Category so that we can compare with how the ticket was opened. The ticket will be automatically closed in 5 days unless the customers responds, in which case the ticket will be automatically reopened. If a customer responds to a ticket after it's closed, a new ticket will be created automatically.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-05-22T18:25:03+01:00",
    "updated_at": "2023-09-18T16:54:25+01:00",
    "status": 2,
    "tags": [],
    "description": "<p><br></p><p dir=\"ltr\">When resolving a ticket, you will be asked to enter the Resolution Summary. This will appear on the customer portal and in any customer reports, so please make this just a summary (details can be in a Note entered before resolving the ticket).</p><p dir=\"ltr\">Because the customer sees this, be polite and use language that the customer can understand and make sure it's meaningful (if you can include the cause of the issue if applicable, even better).</p><p dir=\"ltr\"><br></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\"><strong>Resolution Summary</strong>\n<span dir=\"ltr\" style=\"color: rgb(97, 189, 109);\"><strong>Good</strong>&nbsp;</span>Example:&nbsp;&nbsp;&nbsp;\"Logged onto POS, reset the widget, and customer confirmed it's now working\"\n<span style=\"color: rgb(184, 49, 47);\"><strong>Bad</strong>&nbsp;</span>Example:&nbsp;&nbsp;&nbsp;&nbsp;\"Customer confirmed it's now working\"\n<span style=\"color: rgb(0, 168, 133);\"><strong>Amazing Example</strong></span>:\"Issue caused by power-failure mid-transaction, so I logged onto the POS, reset the widget, and customer confirmed it's working\"\n\nWhen a customer/CSM/Support manager sees the Resolution Summary, it has to convey what was done to resolve the ticket (without going into all the details which may be in the ticket unless they want to) </pre><p><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">You are also asked to select the Resolution Category and Resolution Sub-Category so that we can compare with how the ticket was opened.</p><p dir=\"ltr\"><br></p><p dir=\"ltr\">The ticket will be automatically closed in 5 days unless the customers responds, in which case the ticket will be automatically reopened. If a customer responds to a ticket after it's closed, a new ticket will be created automatically.</p>",
    "user_id": 103023352668,
    "thumbs_up": 1,
    "thumbs_down": 0,
    "hits": 10,
    "seo_data": {},
    "modified_at": "2023-09-18T16:43:47+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000122117,
    "title": "How to link / use a Tracker ticket if multiple customers report the same issue",
    "text": "If there was an Imagine platform issue, for example, which affects multiple customers, someone should create a Tracker ticket which is where all the updates are done which can be broadcast to all linked tickets. This will save time! For more details, see Creating a tracker : Freshdesk When creating a tracker it's important to change the contact to \"K3 tracker\". K3 Tracker : K3 Support (k3btg.com) If the contact is not changed then you will not be able to stop the First Response timer yourself by replying/adding a public note which will result in wrong statistics. Some fields are shown in the panel for creating a Tracker that you wouldn't normally use/see. Ignore them. Enter a Site Name in the non-mandatory dropdown Site ID box, and just enter 0 in the mandatory Site name text box To simply link tickets without having a Tracker, just add the same tag to each of them",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-05-24T13:41:36+01:00",
    "updated_at": "2024-05-17T12:39:00+01:00",
    "status": 2,
    "tags": [],
    "description": "<p data-identifyelement=\"524\" dir=\"ltr\"><span data-identifyelement=\"525\" dir=\"ltr\" style=\"font-size: 16px;\">If there was an Imagine platform issue, for example, which affects multiple customers, someone should create a Tracker ticket which is where all the updates are done which can be broadcast to all linked tickets. This will save time!</span></p><p data-identifyelement=\"526\" dir=\"ltr\" style=\"font-size: 16px;\"><span data-identifyelement=\"527\" style=\"font-size: 16px;\"><br data-identifyelement=\"528\"></span></p><p data-identifyelement=\"529\" dir=\"ltr\"><span data-identifyelement=\"530\" style=\"font-size: 16px;\">For more details, see&nbsp;</span><a data-identifyelement=\"531\" href=\"https://support.freshdesk.com/en/support/solutions/articles/224697-creating-and-linking-a-tracker\"><span data-identifyelement=\"532\" style=\"font-size: 16px;\">Creating a tracker : Freshdesk</span></a></p><p data-identifyelement=\"533\" dir=\"ltr\"><br data-identifyelement=\"534\"></p><p data-identifyelement=\"535\" dir=\"ltr\"><span data-identifyelement=\"536\" dir=\"ltr\" style=\"font-size: 16px;\">When creating a tracker it's important to change the contact to \"K3 tracker\".</span><br data-identifyelement=\"537\"><span data-identifyelement=\"538\" dir=\"ltr\" style=\"font-size: 16px;\"><a data-identifyelement=\"539\" href=\"https://support.k3btg.com/a/contacts/103128724999\">K3 Tracker : K3 Support (k3btg.com)</a>&nbsp;</span><br data-identifyelement=\"540\"><span data-identifyelement=\"541\" dir=\"ltr\" style=\"font-size: 16px;\">If the contact is not changed then you will not be able to stop the First Response timer yourself by replying/adding a public note which will result in wrong statistics.&nbsp;</span></p><p data-identifyelement=\"542\" dir=\"ltr\"><br data-identifyelement=\"543\"></p><pre class=\"fd-callout fd-callout--note\" data-identifyelement=\"544\" dir=\"ltr\">Some fields are shown in the panel for creating a Tracker that you wouldn't normally use/see. Ignore them. Enter a Site Name in the non-mandatory dropdown Site ID box, and just enter 0 in the mandatory Site name text box</pre><p data-identifyelement=\"545\"><br data-identifyelement=\"546\"></p><p data-identifyelement=\"547\" dir=\"ltr\"><br data-identifyelement=\"548\"></p><p data-identifyelement=\"549\" dir=\"ltr\"><span data-identifyelement=\"550\" dir=\"ltr\" style=\"font-size: 16px;\">To simply link tickets without having a Tracker, just add the same tag to each of them</span></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 3,
    "seo_data": {},
    "modified_at": "2024-05-17T12:38:59+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000122119,
    "title": "Use Merge tickets if multiple contacts at the same customer report the same issue",
    "text": "There is a Merge button which means that you can close duplicates automatically and when you do the merge, please use the option to add the contacts from the duplicates to the new primary ticket. Always fill in \"Product Name\" and \"Product Component\" on all the secondary tickets. Make sure the priority on the main ticket is correct and lower the other tickets to P5 as they are fillers. For more info, please see Merging two or more tickets together : Freshdesk Be sure to click on the plus button when trying to add a ticket to be merged - if you click on the ticket description, it will just open that ticket and not do a merge. * Related article - \"Use Merge tickets if multiple customers report the same issue\"",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-05-24T13:44:35+01:00",
    "updated_at": "2023-10-02T12:56:00+01:00",
    "status": 2,
    "tags": [],
    "description": "<p data-identifyelement=\"536\" dir=\"ltr\">There is a Merge button which means that you can close duplicates automatically and when you do the merge, please use the option to add the contacts from the duplicates to the new primary ticket.</p><p data-identifyelement=\"536\" dir=\"ltr\"><br></p><p data-identifyelement=\"247\" dir=\"ltr\" style=\"box-sizing: border-box; margin-bottom: 0px; margin-left: 20px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; text-align: start; text-indent: 0px;\"><strong data-identifyelement=\"248\" style=\"box-sizing: border-box; font-weight: 700;\"><u data-identifyelement=\"249\" style=\"box-sizing: border-box;\">Always fill in \"Product Name\" and \"Product Component\" on all the secondary tickets.</u></strong></p><p data-identifyelement=\"250\" dir=\"ltr\" style=\"box-sizing: border-box; margin-bottom: 0px; margin-left: 20px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; text-align: start; text-indent: 0px;\"><br data-identifyelement=\"251\" style=\"box-sizing: border-box;\"></p><p data-identifyelement=\"252\" dir=\"ltr\" style=\"box-sizing: border-box; margin-bottom: 0px; margin-left: 20px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; text-align: start; text-indent: 0px;\">Make sure the priority on the main ticket is correct and lower the other tickets to P5 as they are fillers.</p><p data-identifyelement=\"541\" dir=\"ltr\">&nbsp;</p><p data-identifyelement=\"541\" dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103053233002/original/zB9iTfHgTpu9wM0mlkj2g8qPuyvxqZ6G6Q.png?1696247643\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103053233002\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 13px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; width: auto;\" data-attachment=\"[object Object]\"></p><p data-identifyelement=\"536\" dir=\"ltr\"><br></p><p data-identifyelement=\"537\" dir=\"ltr\">For more info, please see <a data-identifyelement=\"538\" href=\"https://support.freshdesk.com/en/support/solutions/articles/80180-merging-two-or-more-tickets-together\">Merging two or more tickets together : Freshdesk</a>&nbsp;</p><p data-identifyelement=\"539\" dir=\"ltr\"><br data-identifyelement=\"540\"></p><p data-identifyelement=\"541\" dir=\"ltr\">Be sure to click on the plus button when trying to add a ticket to be merged - if you click on the ticket description, it will just open that ticket and not do a merge.</p><p data-identifyelement=\"541\" dir=\"ltr\"></p><p data-identifyelement=\"247\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px 0px 0px 20px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"></p><p data-identifyelement=\"541\" dir=\"ltr\">&nbsp;</p><p data-identifyelement=\"541\" dir=\"ltr\"></p><p data-identifyelement=\"541\" dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049915644/original/qMT3wDKiv3peVpKWd6qV-C6Jo0pq5DqkuA.png?1695054353\" style=\"width: 378px;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103049915644\"></p><p dir=\"ltr\">* Related article - \"Use Merge tickets if multiple customers report the same issue\"</p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 3,
    "seo_data": {},
    "modified_at": "2023-10-02T12:56:00+01:00",
    "modified_by": 103100691279
  },
  {
    "id": 103000158150,
    "title": "How to change the contact on an open ticket",
    "text": "Click the three dots at the top of the ticket, then select Edit Ticket Details. A panel is then shown on the right side of the window where you can change the contact. It's not advised to change the Subject or Description because this might confuse the customer due to changes not matching previous communications. If a CSM or other internal person emails Support asking to raise a ticket on behalf of a customer, the ticket will be raised in the internal persons name, but you can easily change the contact to be the actual customer using Edit Ticket Details BUT THEY WON'T HAVE HAD THE NEW TICKET EMAIL NOTIFICATION AND CHANGING THE CONTACT DOES NOT GENERATE ONE After changing the contact, you will need to do a Reply to send the customer the ticket details (e.g. this ticket has been opened for you by )\" and copy the CSM if relevant to do so. ​",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-07-12T10:52:46+01:00",
    "updated_at": "2023-11-24T16:55:37+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\"><span style=\"font-size: 14px;\">Click the three dots at the top of the ticket, then select Edit Ticket Details. &nbsp;A panel is then shown on the right side of the window where you can change the contact.</span></p><p dir=\"ltr\" style=\"font-size: 14px;\"><span style=\"font-size: 14px;\"><br></span></p><p dir=\"ltr\"><span style=\"font-size: 14px;\">It's not advised to change the Subject or Description because this might confuse the customer due to changes not matching previous communications.&nbsp;</span></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 14px;\"></span></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\">If a CSM or other internal person emails Support asking to raise a ticket on behalf of a customer, the ticket will be raised in the internal persons name, but you can easily change the contact to be the actual customer using Edit Ticket Details\n<strong dir=\"ltr\">BUT THEY WON'T HAVE HAD THE NEW TICKET EMAIL NOTIFICATION AND CHANGING THE CONTACT DOES NOT GENERATE ONE</strong>\nAfter changing the contact, you will need to do a Reply to send the customer the ticket details (e.g. this ticket has been opened for you by &lt;CSM name&gt;)\" and copy the CSM if relevant to do so.</pre>​<br><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103035806281/original/Ag6H9sHttrExgUFR-4ubhBbVX8xwtVXtQQ.png?1689155307\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib fr-bordered\" data-id=\"103035806281\"></p><p><br></p><p><br></p><p><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103035807419/original/A0fgxqu1XQTz-he587Z8Enh5by3fdP8yVA.png?1689155485\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib fr-bordered\" data-attachment=\"[object Object]\" data-id=\"103035807419\"></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2023-11-24T16:55:37+00:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000131253,
    "title": "Guide for Support to create Jiras for Development from Freshdesk and how Support and Dev can collaborate on them",
    "text": "TABLE OF CONTENTS 1. Introduction 2. When to Create a Jira 3. How to Create a Jira from Freshdesk 4. Jira ID and Sidebar Widget 5. Ongoing Ticket Collaboration between Support and Development 6. General Integration Features to be Aware Of 1. Introduction There is an integration between Freshdesk and Jira which allows a Jira to be created automatically from Freshdesk when it meets certain criteria, and for notes to be synchronised between systems so that information can be exchanged easily between the teams. 2. When to Create a Jira Before we can create a Jira ticket (bug or change request), we need to create a ticket in Freshdesk with all relevant information and steps. Data quality is of paramount importance - there's no point creating a Jira that doesn't have everything a developer would need to know to understand, replicate, and fix an issue (or clear requirements for a change request). If you are 100% sure that the issue can only be resolved by a code change, then you can pass to Development. DO NOT MESSAGE DEVELOPMENT DIRECT UNLESS IT'S AS PART OF THE MAJOR INCIDENT PROCESS If you need to ask the Development team some advice on a support ticket (perhaps because you're not sure if it's configuration or code), then: For Imagine, you can pass straight to Development i.e. create a Jira For all other products, initiate a conversation Thread against the ticket with the relevant Development team member. If they confirm that a code change is necessary, then pass to Development (which doesn't guarantee it will be done!). 3. How to Create a Jira from Freshdesk A Jira is created when the following criteria are met: Product name = Any of the products which are managed by Dev teams in Jira, so if the Product Name is not set correctly (e.g. if it's set to \"Other\"), then it will not create a Jira Ticket category = \"Incident\" will be created as a Bug, \"Change request\" will be created as a Story (Service Requests are NOT passed to Jira) Status = Waiting on Development Summary for Jira field is not empty! This field is pre-populated with a template of the information you should include which will go into the Jira Description field. Please include information in each section or type \"N/A\" if the section is not applicable As per the note at the end of the pre-populated text, if you have attachment(s) to send to Jira, you will need to do that after the Jira has been created via a Private Note, but in this summary field, you can say if attachments are to follow or not Before you press update (with the criteria above), please check the title makes sense and rewrite it if needed. A Jira will not be created if you set a new ticket straight to Waiting for Development if you create one from a phone call - it needs to have been saved previously with the normal Open or any other status like Waiting for Customer because Jiras are created only when a ticket transitions from any status to Waiting to Development After the status is set to Waiting on Development and update is pressed, the integration will create an new Jira ticket and link it to the Freshdesk ticket (see below). Only After the status is set to Waiting on Development, will private notes and attachments be updated in the related Jira ticket. All notes that have been created before the status, will not be send to Jira, : It's also possible to manually link a Freshdesk ticket with an existing Jira, or multiple Jiras - see Adding an Existing Jira to a Ticket 4. Jira ID and Sidebar Widget The Jira ID will be updated in the ticket field JIRA ID. You can use this value to search for tickets and also on ticket views. It is also visible in the sidebar widget The Jira number is very important, because in sidebar there is the option to search for Jira ticket and link it manually, but the full ID needs to be entered before it can search. For example IM-1234 and not 1234 or IM-12. It is also possible to see more detail information on the Jira ticket from Freshdesk by clicking on the Jira ID in the sidebar app. Fields shown below are customisable by Support Management 5. Ongoing Ticket Collaboration between Support and Development Jira tickets are initially created with a Status of \"Backlog\", but if the Development team need more information from Support (who may need to get it from the customer), they will of course post a comment in Jira which will be a Private Note in Freshdesk, and they will set the Jira to \"Support Review\" status Only private notes in Freshdesk synced to Jira (not Public ones). Therefore, if a customer updates a ticket with some important information which the Development team would need to know, then post a copy of the information (or the relevant parts of it) as a Private Note The integration still syncs notes (from Freshdesk to Jira and the other way around) after a Freshdesk or Jira ticket is closed. Please check the status of the ticket first before new information is added 6. General Integration Features to be Aware Of Screenshots embedded into text/notes in Freshdesk will not go through to Jira though – they would needed to be added as an attachment to a FD note as the integration of FD Notes Jira Comments is plain text only Also see Freshdesk Guide for Development Teams",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-06-14T16:56:55+01:00",
    "updated_at": "2024-04-23T17:09:39+01:00",
    "status": 2,
    "tags": [],
    "description": "<p class=\"fd-toc\" data-identifyelement=\"519\"><strong data-identifyelement=\"520\"><span data-identifyelement=\"521\" style=\"font-size: 14px;\">TABLE OF CONTENTS</span></strong></p><ul data-identifyelement=\"522\"><li data-identifyelement=\"523\" style=\"font-size: 14px;\"><span data-identifyelement=\"524\" style=\"font-size: 14px;\"><a data-identifyelement=\"525\" href=\"#1.-Introduction\">1. Introduction</a></span></li><li data-identifyelement=\"526\" style=\"font-size: 14px;\"><span data-identifyelement=\"527\" style=\"font-size: 14px;\"><a data-identifyelement=\"528\" href=\"#2.-When-to-Create-a-Jira\">2. When to Create a Jira</a></span></li><li data-identifyelement=\"529\" style=\"font-size: 14px;\"><span data-identifyelement=\"530\" style=\"font-size: 14px;\"><a data-identifyelement=\"531\" href=\"#3.-How-to-Create-a-Jira-from-Freshdesk\">3. How to Create a Jira from Freshdesk</a></span></li><li data-identifyelement=\"532\" style=\"font-size: 14px;\"><span data-identifyelement=\"533\" style=\"font-size: 14px;\"><a data-identifyelement=\"534\" href=\"#4.-Jira-ID-and-Sidebar-Widget\">4. Jira ID and Sidebar Widget</a></span></li><li data-identifyelement=\"535\" style=\"font-size: 14px;\"><span data-identifyelement=\"536\" style=\"font-size: 14px;\"><a data-identifyelement=\"537\" href=\"#5.-Ongoing-Ticket-Collaboration-between-Support-and-Development\">5. Ongoing Ticket Collaboration between Support and Development</a></span></li><li data-identifyelement=\"538\"><span data-identifyelement=\"539\" style=\"font-size: 14px;\"><a data-identifyelement=\"540\" href=\"#6.-General-Integration-Features-to-be-Aware-Of\">6. General Integration Features to be Aware Of</a></span></li></ul><p data-identifyelement=\"536\" dir=\"ltr\" id=\"\"><br data-identifyelement=\"541\"></p><h1 data-identifyelement=\"536\" dir=\"ltr\" id=\"1.-Introduction\"><strong data-identifyelement=\"542\" dir=\"ltr\">1. Introduction</strong></h1><p data-identifyelement=\"536\" dir=\"ltr\"><span data-identifyelement=\"543\" dir=\"ltr\" style=\"font-size: 14px;\">There is an integration between Freshdesk and Jira which allows a Jira to be created automatically from Freshdesk when it meets certain criteria, and for notes to be synchronised between systems so that information can be exchanged easily between the teams.&nbsp;</span></p><p data-identifyelement=\"536\" dir=\"ltr\"><br data-identifyelement=\"544\"></p><h1 data-identifyelement=\"536\" dir=\"ltr\" id=\"2.-When-to-Create-a-Jira\"><strong data-identifyelement=\"545\" dir=\"ltr\">2. When to Create a Jira</strong></h1><p data-identifyelement=\"536\" dir=\"ltr\"><span data-identifyelement=\"546\" style=\"font-size: 14px;\">Before we can create a Jira ticket (bug or change request), we need to create a ticket in Freshdesk with all relevant information and steps. Data quality is of paramount importance - there's no point creating a Jira that doesn't have everything a developer would need to know to understand, replicate, and fix an issue (or clear requirements for a change request).</span></p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"547\" style=\"font-size: 14px;\"><br data-identifyelement=\"538\"></span></p><p data-identifyelement=\"548\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"549\" dir=\"ltr\" style=\"font-size: 14px;\">If you are 100% sure that the issue can only be resolved by a code change, then you can pass to Development. <strong style=\"box-sizing: border-box; font-weight: 700; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span dir=\"ltr\" style=\"box-sizing: border-box; color: rgb(184, 49, 47);\">DO NOT MESSAGE DEVELOPMENT DIRECT UNLESS IT'S AS PART OF THE MAJOR INCIDENT PROCESS</span></strong>&nbsp;</span></p><p data-identifyelement=\"548\" dir=\"ltr\" style=\"font-size: 14px;\"><br></p><p data-identifyelement=\"552\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"553\" dir=\"ltr\" style=\"font-size: 14px;\">If you need to ask the Development team some advice on a support ticket (perhaps because you're not sure if it's configuration or code), then:</span></p><ul data-identifyelement=\"554\"><li data-identifyelement=\"578\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"555\" dir=\"ltr\" style=\"font-size: 14px;\">For <strong data-identifyelement=\"556\">Imagine</strong>, you can pass straight to Development i.e. create a Jira</span></li><li data-identifyelement=\"578\" dir=\"ltr\"><span data-identifyelement=\"557\" dir=\"ltr\" style=\"font-size: 14px;\">For <strong data-identifyelement=\"558\">all other products</strong>, initiate a conversation Thread against the ticket with the relevant Development team member. If they confirm that a code change is necessary, then pass to Development (which doesn't guarantee it will be done!).</span></li></ul><p data-identifyelement=\"580\" dir=\"ltr\"><br data-identifyelement=\"559\"></p><h1 data-identifyelement=\"580\" dir=\"ltr\" id=\"3.-How-to-Create-a-Jira-from-Freshdesk\"><strong data-identifyelement=\"560\" dir=\"ltr\">3. How to Create a Jira from Freshdesk</strong></h1><p data-identifyelement=\"582\" dir=\"ltr\"><span data-identifyelement=\"561\" style=\"font-size: 14px;\">A Jira is created when the following criteria are met:</span></p><p data-identifyelement=\"583\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"562\" style=\"font-size: 14px;\"><br data-identifyelement=\"584\"></span></p><p data-identifyelement=\"585\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"563\" dir=\"ltr\" style=\"font-size: 14px;\"><strong data-identifyelement=\"586\">Product name</strong> = Any of the products which are managed by Dev teams in Jira, so if the Product Name is not set correctly (e.g. if it's set to \"Other\"), then it will not create a Jira<br data-identifyelement=\"587\"><strong data-identifyelement=\"588\" dir=\"ltr\">Ticket category = \"</strong>Incident\" will be created as a <strong data-identifyelement=\"589\" dir=\"ltr\">Bug</strong>, \"Change request\" will be created as a <strong data-identifyelement=\"590\" dir=\"ltr\">Story</strong> <span data-identifyelement=\"564\" style=\"background-color: rgb(247, 218, 100);\">(<strong data-identifyelement=\"565\">Service Requests</strong> are <strong data-identifyelement=\"566\">NOT&nbsp;</strong>passed to Jira)</span></span></p><p data-identifyelement=\"591\" dir=\"ltr\"><span data-identifyelement=\"567\" style=\"font-size: 14px;\"><strong data-identifyelement=\"592\" dir=\"ltr\">Status</strong> =&nbsp;</span><strong data-identifyelement=\"568\"><span data-identifyelement=\"569\" style=\"font-size: 14px;\">Waiting on Development</span></strong></p><p data-identifyelement=\"591\" dir=\"ltr\"><strong data-identifyelement=\"570\"><span data-identifyelement=\"571\" dir=\"ltr\" style=\"font-size: 14px;\">Summary for Jira</span></strong><span data-identifyelement=\"572\" dir=\"ltr\" style=\"font-size: 14px;\">&nbsp;field is not empty!</span></p><ul data-identifyelement=\"573\"><li data-identifyelement=\"591\" dir=\"ltr\"><span data-identifyelement=\"574\" dir=\"ltr\" style=\"font-size: 14px;\">This field is pre-populated with a template of the information you should include which will go into the Jira Description field. Please include information in each section or type \"N/A\" if the section is not applicable</span></li><li data-identifyelement=\"591\" dir=\"ltr\"><span data-identifyelement=\"575\" dir=\"ltr\" style=\"font-size: 14px;\">As per the note at the end of the pre-populated text, if you have attachment(s) to send to Jira, you will need to do that after the Jira has been created via a Private Note, but in this summary field, you can say if attachments are to follow or not</span></li></ul><p><span data-identifyelement=\"575\" dir=\"ltr\" style=\"font-size: 14px;\"><br dir=\"ltr\"></span></p><p data-identifyelement=\"591\" dir=\"ltr\"><strong data-identifyelement=\"595\" dir=\"ltr\"><u data-identifyelement=\"596\"><span data-identifyelement=\"597\" style=\"color: rgb(184, 49, 47); font-size: 14px;\">Before</span></u><span data-identifyelement=\"580\" style=\"font-size: 14px;\">&nbsp;</span></strong><span data-identifyelement=\"581\" dir=\"ltr\" style=\"font-size: 14px;\">you press update (with the criteria above), please check the title makes sense and rewrite it if needed.</span></p><p data-identifyelement=\"591\" dir=\"ltr\"><br data-identifyelement=\"582\"></p><pre class=\"fd-callout fd-callout--note\" data-identifyelement=\"583\" dir=\"ltr\"><span data-identifyelement=\"584\" style=\"font-size: 14px; color: rgb(226, 80, 65);\">A Jira will not be created if you set a new ticket straight to Waiting for Development if you create one from a phone call - it needs to have been saved previously with the normal Open or any other status like Waiting for Customer because Jiras are created only when a ticket transitions from any status to Waiting to Development</span></pre><p data-identifyelement=\"593\" dir=\"ltr\"><br data-identifyelement=\"594\"></p><p data-identifyelement=\"593\" dir=\"ltr\"><span data-identifyelement=\"585\" dir=\"ltr\" style=\"font-size: 14px;\"><br data-identifyelement=\"598\"><strong data-identifyelement=\"599\" dir=\"ltr\"><u data-identifyelement=\"600\" dir=\"ltr\">After</u>&nbsp;</strong>the status is set to <strong data-identifyelement=\"601\" dir=\"ltr\">Waiting on Development&nbsp;</strong>and update is pressed, the integration will create an new Jira ticket and link it to the Freshdesk ticket (see below).&nbsp;</span></p><p data-identifyelement=\"602\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"586\" style=\"font-size: 14px;\"><br data-identifyelement=\"603\"></span></p><p data-identifyelement=\"604\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"587\" dir=\"ltr\" style=\"font-size: 14px;\">Only <strong data-identifyelement=\"605\" dir=\"ltr\">After&nbsp;</strong>the status is set to <strong data-identifyelement=\"606\" dir=\"ltr\">Waiting on Development</strong>, will <strong data-identifyelement=\"588\">private notes</strong> and <strong data-identifyelement=\"607\"><em data-identifyelement=\"608\" dir=\"ltr\">attachments&nbsp;</em></strong>be updated in the related Jira ticket. All notes that have been created <span data-identifyelement=\"609\" dir=\"ltr\" style=\"color: rgb(184, 49, 47);\"><strong data-identifyelement=\"610\"><u data-identifyelement=\"611\">before</u></strong></span> the status, will not be send to Jira, :</span></p><p data-identifyelement=\"612\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"589\" style=\"font-size: 14px;\"><br data-identifyelement=\"613\" dir=\"ltr\"></span></p><p data-identifyelement=\"694\" dir=\"ltr\"><br data-identifyelement=\"590\"></p><pre class=\"fd-callout fd-callout--note\" data-identifyelement=\"591\" dir=\"ltr\"><strong data-identifyelement=\"697\" dir=\"ltr\"><span data-identifyelement=\"592\" dir=\"ltr\">It's also possible to manually link a Freshdesk ticket with an existing Jira, or multiple Jiras - see&nbsp;</span><a data-identifyelement=\"593\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000131325?lang=en\" rel=\"noopener noreferrer\" target=\"_blank\">Adding an Existing Jira to a Ticket</a>&nbsp; </strong></pre><p data-identifyelement=\"719\" dir=\"ltr\"><br data-identifyelement=\"720\"></p><h1 data-identifyelement=\"721\" dir=\"ltr\" id=\"4.-Jira-ID-and-Sidebar-Widget\"><strong data-identifyelement=\"722\" dir=\"ltr\">4. Jira ID and Sidebar Widget</strong></h1><p data-identifyelement=\"723\" dir=\"ltr\"><span data-identifyelement=\"594\" dir=\"ltr\" style=\"font-size: 14px;\">The Jira ID will be updated in the ticket field <strong data-identifyelement=\"726\" dir=\"ltr\">JIRA ID</strong>. You can use this value to search for tickets and also on ticket views.</span></p><p data-identifyelement=\"728\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"595\" style=\"font-size: 14px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103033902311/original/3EprmR_YTKDn1X_WsVaTwGW41wPmPfAcXg.png?1688477099\" style=\"width: 161px;\" class=\"fr-fic fr-fil fr-dib fr-bordered\" data-attachment=\"[object Object]\" data-id=\"103033902311\" data-identifyelement=\"731\">&nbsp;</span></p><p data-identifyelement=\"732\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"596\" dir=\"ltr\" style=\"font-size: 14px;\">It is also visible in the sidebar widget</span></p><p data-identifyelement=\"733\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"597\" style=\"font-size: 14px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103038583482/original/B6XLXFDMYkH9UDbeYmhAAbw18kDXXtciyA.png?1690287769\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103038583482\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; width: 191px;\" data-attachment=\"[object Object]\" data-identifyelement=\"736\"></span></p><p data-identifyelement=\"737\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"598\" style=\"font-size: 14px;\"><br data-identifyelement=\"738\"></span></p><p data-identifyelement=\"739\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"599\" style=\"font-size: 14px;\"><br data-identifyelement=\"740\"></span></p><p data-identifyelement=\"741\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"600\" dir=\"ltr\" style=\"font-size: 14px;\">The Jira number is very important, because in sidebar there is the option to search for Jira ticket and link it manually, but the <strong data-identifyelement=\"742\" dir=\"ltr\">full</strong> ID needs to be entered before it can search. For example <strong data-identifyelement=\"743\" dir=\"ltr\">IM-1234&nbsp;</strong>and not <strong data-identifyelement=\"744\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: 700; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 14px; text-align: left; text-indent: 0px;\">1234&nbsp;</strong>or<strong data-identifyelement=\"745\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: 700; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 14px; text-align: left; text-indent: 0px;\">&nbsp;IM-12.</strong> &nbsp;</span></p><p data-identifyelement=\"746\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"601\" style=\"font-size: 14px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103033899901/original/GicA3X9jyCO6E1trxBNUkfXCO0i8uzIGlQ.png?1688476744\" style=\"width: 152px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103033899901\" data-identifyelement=\"749\"></span></p><p data-identifyelement=\"750\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"602\" style=\"font-size: 14px;\"><br data-identifyelement=\"751\"></span></p><p data-identifyelement=\"752\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"603\" style=\"font-size: 14px;\">It is also possible to see more detail information on the Jira ticket from Freshdesk by clicking on the Jira ID in the sidebar app.</span></p><p data-identifyelement=\"753\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"604\" style=\"font-size: 14px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103033913963/original/KBvR1DUEavxj8hG7qbXV02PBm2rj41VNzg.png?1688479018\" style=\"width: 191px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103033913963\" data-identifyelement=\"756\"></span></p><p data-identifyelement=\"757\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"605\" style=\"font-size: 14px;\"><br data-identifyelement=\"758\">Fields shown below are customisable by Support Management</span></p><p data-identifyelement=\"759\" dir=\"ltr\"><span data-identifyelement=\"606\" style=\"font-size: 14px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055319309/original/BimmAR5SeJNlVyiEPlEHJa8au6-cewB8EA.png?1696870404\" style=\"width: 515px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103055319309\" data-identifyelement=\"607\"></span></p><p data-identifyelement=\"761\" dir=\"ltr\"><br data-identifyelement=\"762\"></p><p data-identifyelement=\"763\" dir=\"ltr\"><br data-identifyelement=\"764\"></p><h1 data-identifyelement=\"765\" dir=\"ltr\" id=\"5.-Ongoing-Ticket-Collaboration-between-Support-and-Development\" style=\"box-sizing: border-box; margin-bottom: 0px; margin-left: 0px; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 43.75px; color: rgb(0, 0, 0); font-size: 2em; text-align: left; text-indent: 0px;\"><strong data-identifyelement=\"608\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: 700;\">5. Ongoing Ticket Collaboration between Support and Development</strong></h1><ul data-identifyelement=\"709\"><li data-identifyelement=\"609\" dir=\"ltr\"><span data-identifyelement=\"610\" dir=\"ltr\" style=\"font-size: 14px;\">Jira tickets are initially created with a Status of \"Backlog\", but if the Development team need more information from Support (who may need to get it from the customer), they will of course post a comment in Jira which will be a Private Note in Freshdesk, and they will set the Jira to \"Support Review\" status&nbsp;</span></li><li data-identifyelement=\"710\" dir=\"ltr\" style=\"font-size: 14px;\"><span data-identifyelement=\"611\" style=\"font-size: 14px;\">Only <strong data-identifyelement=\"713\">private</strong> notes in Freshdesk synced to Jira (not Public ones). Therefore, if a customer updates a ticket with some important information which the Development team would need to know, then post a copy of the information (or the relevant parts of it) as a Private Note</span></li><li data-identifyelement=\"715\" dir=\"ltr\"><span data-identifyelement=\"612\" style=\"font-size: 14px;\">The integration still syncs notes (from Freshdesk to Jira and the other way around) after a Freshdesk or Jira ticket is closed. Please check the status of the ticket <strong data-identifyelement=\"716\" dir=\"ltr\">first&nbsp;</strong>before new information is added</span></li></ul><p data-identifyelement=\"613\"><br data-identifyelement=\"614\"></p><h1 data-identifyelement=\"615\" id=\"6.-General-Integration-Features-to-be-Aware-Of\"><span data-identifyelement=\"616\" dir=\"ltr\" style=\"font-size: 24px;\"><strong data-identifyelement=\"617\">6. General Integration Features to be Aware Of</strong></span></h1><ul data-identifyelement=\"618\"><li data-identifyelement=\"619\"><span data-identifyelement=\"620\" dir=\"ltr\" style=\"font-size: 14px;\">Screenshots embedded into text/notes in Freshdesk will not go through to Jira though – they would needed to be added as an attachment to a FD note as the integration of FD Notes &lt;==&gt; Jira Comments is plain text only<br data-identifyelement=\"621\"></span></li></ul><p data-identifyelement=\"767\" dir=\"ltr\"><br data-identifyelement=\"622\"></p><p data-identifyelement=\"767\" dir=\"ltr\"><span data-identifyelement=\"623\" style=\"font-size: 14px;\">Also see&nbsp;</span><a data-identifyelement=\"624\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000160846?lang=en\"><span data-identifyelement=\"625\" style=\"font-size: 14px;\">Freshdesk Guide for Development Teams</span></a></p><p data-identifyelement=\"769\"><br data-identifyelement=\"770\"></p>",
    "user_id": 103023352668,
    "thumbs_up": 2,
    "thumbs_down": 1,
    "hits": 42,
    "seo_data": {},
    "modified_at": "2024-04-23T17:09:39+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000131325,
    "title": "Adding an Existing Jira to a Ticket",
    "text": "If you want to create a Jira ticket from the Freshdesk ticket, please follow the instructions on Creating and Updating Jira tickets for Development from Freshdesk If you want to manually add a Jira, click the blue Jira Ticket button which will open the search box. Enter in the full Jira number, click the search icon, and you can then click the link button. When there are more than one Jira tickets linked to a Freshdesk ticket, you can click on the pin icon to make that the primary Jira. This will mean that any privates notes added to the Freshdesk ticket will be sent to the primary Jira ticket.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-06-14T18:25:18+01:00",
    "updated_at": "2024-01-15T10:20:02+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">If you want to create a Jira ticket from the Freshdesk ticket, please follow the instructions on <a href=\"https://k3support.freshdesk.com/a/solutions/articles/103000131253?lang=en\" rel=\"noopener noreferrer\" target=\"_blank\">Creating and Updating Jira tickets for Development from Freshdesk</a></p><p><br></p><p dir=\"ltr\">If you want to manually add a Jira, click the blue Jira Ticket button which will open the search box. Enter in the full Jira number, click the search icon, and you can then click the link button.</p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055323348/original/-ud5Ul9gw4ZYoev0lKE8vBILB4OyqQ-tmA.png?1696871774\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103055323348\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">When there are more than one Jira tickets linked to a Freshdesk ticket, you can click on the pin icon to make that the primary Jira. This will mean that any privates notes added to the Freshdesk ticket will be sent to the primary Jira ticket.</p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055323728/original/6JDO1RLrYOy3zjRKqY9P5YiZu0YsVRwXJA.png?1696871928\" style=\"width: 361px;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103055323728\"></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 2,
    "seo_data": {},
    "modified_at": "2024-01-15T10:20:02+00:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000136833,
    "title": "Using the knowledge base from within a ticket to suggest solutions",
    "text": "TABLE OF CONTENTS How do you know if a customer already looked at an article? How do you add a solution article to a ticket response? Content or Link? How do you know if a customer already looked at an article? If a customer has looked at some knowledgebase articles before submitting a ticket, this will be shown on the ticket (see example below) How do you add a solution article to a ticket response? When adding a note or replying to a ticket, you can click on a button at the bottom to have KB articles suggested to you and/or you can search right from that pane which pops up on the right of the ticket. Content or Link? For articles which are available on the portal, you wil be given the option of inserting the Content or Link for an article. The best thing to do is insert a link to an article because this trains customers into using our portal where they might find answers themselves in future. If an article is not available on the portal to the contact of the ticket you're working on, the Insert Link option won't be avail",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-06-23T16:25:08+01:00",
    "updated_at": "2024-01-15T17:20:00+00:00",
    "status": 2,
    "tags": [],
    "description": "<p class=\"fd-toc\"><strong>TABLE OF CONTENTS</strong></p><ul><li><a href=\"#How-do-you-know-if-a-customer-already-looked-at-an-article?\">How do you know if a customer already looked at an article?</a></li><li><a href=\"#How-do-you-add-a-solution-article-to-a-ticket-response?\">How do you add a solution article to a ticket response?</a></li><li><a href=\"#Content-or-Link?\">Content or Link?</a></li></ul><h1 dir=\"ltr\" id=\"How-do-you-know-if-a-customer-already-looked-at-an-article?\"><strong>How do you know if a customer already looked at an article?</strong></h1><p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 16px;\">If a customer has looked at some knowledgebase articles before submitting a ticket, this will be shown on the ticket (see example below)</span></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031913650/original/ly3r_WfFUYDhGS_ZvuViXWNJRzHlCm88ZQ.png?1687532663\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib fr-bordered fr-shadow\" data-id=\"103031913650\"></p><p dir=\"ltr\"><strong><br></strong></p><h1 dir=\"ltr\" id=\"How-do-you-add-a-solution-article-to-a-ticket-response?\"><strong>How do you add a solution article to a ticket response?</strong></h1><p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 16px;\">When adding a note or replying to a ticket, you can click on a button at the bottom to have KB articles suggested to you and/or you can search right from that pane which pops up on the right of the ticket.</span></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031917777/original/6EEp0PtSgH1xYUGY0wTKqqZAT-d349z0vg.png?1687533866\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103031917777\"></p><p dir=\"ltr\"><br></p><h1 dir=\"ltr\" id=\"Content-or-Link?\"><strong>Content or Link?</strong></h1><p dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 14px;\">For articles which are available on the portal, you wil be given the option of inserting the Content or Link for an article. The best thing to do is insert a link to an article because this trains customers into using our portal where they might find answers themselves in future.</span></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103079757474/original/eDKwrn4Dfikzbgu8RNPNz_rSYn8xNVKF6A.png?1705338997\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103079757474\"></p><h1 id=\"\"><br></h1><p></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\">If an article is not available on the portal to the contact of the ticket you're working on, the Insert Link option won't be avail</pre><p><br></p><p></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 7,
    "seo_data": {},
    "modified_at": "2024-01-15T17:20:00+00:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000157013,
    "title": "Internally Raised tickets and K3 Internal Requests contact",
    "text": "If you or anyone else in K3 want to raise an internal ticket i.e. one that is not attached to a specific customer(s), please add the ticket to Company K3 Business Technologies : K3 Support using contact K3 Internal Requests . You might want to do this to add an internal ticket to raise an internal Jira; perhaps you've spotted a bug which needs fixing, but you don't want to alert a customer. When raising an internal ticket, or raising any ticket on behalf of a customer, please use the Source \"Internally Raised\" when doing so. This avoids artificially inflating the stats on how many tickets are raised by phone.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-07-10T17:05:56+01:00",
    "updated_at": "2025-04-03T17:43:53+01:00",
    "status": 2,
    "tags": [],
    "description": "<p data-identifyelement=\"534\" dir=\"ltr\"><span dir=\"ltr\" style=\"font-size: 16px;\">If you or anyone else in K3 want to raise an internal ticket i.e. one that is not attached to a specific customer(s), please add the ticket to Company <a data-identifyelement=\"536\" dir=\"ltr\" href=\"https://k3support.freshdesk.com/a/companies/103001063386\" rel=\"noopener noreferrer\" target=\"_blank\">K3 Business Technologies : K3 Support&nbsp;</a> using contact <u><span style=\"color: rgb(41, 105, 176); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 600; letter-spacing: 0.5px; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; float: none; display: inline !important;\"><a href=\"https://support.k3btg.com/a/contacts/103105949122\">K3 Internal Requests</a></span></u></span><span style=\"color: rgb(41, 105, 176);\"><u><span dir=\"ltr\" style=\"font-size: 16px;\">&nbsp;.</span></u></span></p><p data-identifyelement=\"534\" dir=\"ltr\"><br></p><p data-identifyelement=\"534\" dir=\"ltr\"><span style=\"color: rgb(0, 0, 0);\"><span dir=\"ltr\" style=\"font-size: 16px;\">You might want to do this to add</span><span dir=\"ltr\" style=\"font-size: 16px;\">&nbsp;an internal ticket to raise an internal Jira; perhaps you've spotted a bug which needs fixing, but you don't want to alert a customer.</span></span></p><p data-identifyelement=\"534\" dir=\"ltr\"><br></p><p data-identifyelement=\"534\" dir=\"ltr\"><span style=\"color: rgb(0, 0, 0);\"><span dir=\"ltr\" style=\"font-size: 16px;\">When raising an internal ticket, or raising any ticket on behalf of a customer, please use the Source \"Internally Raised\" when doing so. This avoids artificially inflating the stats on how many tickets are raised by phone.</span></span></p><p data-identifyelement=\"534\" dir=\"ltr\"><br></p><p data-identifyelement=\"534\" dir=\"ltr\"><span style=\"color: rgb(0, 0, 0);\"><span dir=\"ltr\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103204299013/original/QpAMG2yfyKwT2M9o955QzRWYmwfEKkc4Tw.png?1743698580\" style=\"width: auto; max-width: 100%;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103204299013\"></span></span><br></p>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 3,
    "seo_data": {},
    "modified_at": "2025-04-03T17:44:07+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000229406,
    "title": "SLA Target Times",
    "text": "TABLE OF CONTENTS Introduction First Response SLA Recovery SLA Resolution SLA How do I make sure I don't miss any SLAs? Why is the SLA Target Not Showing? Introduction SLA targets are important because it is a commitment we make to customers, and directly affects their satisfaction with our service if the SLAs are met or exceeded. Sometimes customers are not happy because they think we should be solving tickets much faster than the SLA, but they usually realise that they are getting a good service if they can see a report of SLA being met. Every ticket has a target Response, Recovery, and Resolution time which matches up to the Service Level Agreement (SLA). If the Ticket Priority changes, the SLA targets will be changed accordingly (but not retrospectively i.e. if a tickets is raised as a P2 and the First Response is missed, and then the Ticket Priority is changed (e.g. by changing Urgency and/or Impact), the system will not calculate a new Response SLA and recalculate whether the first response would have fallen into it or not. First Response SLA Every ticket when created is given a First Response Due target. This is initially green, then if it's close to being missed, it will turn Amber, and then Red if the SLA was missed. Once the first response has been sent, the target time will disappear We never want to see the below :-0 i.e. the First Response Time was missed. The First Response SLA timer is only stopped when we send the first communication to the customer from a logged ticket. This means sending a Reply or a Public Note. So, even if you've logged a ticket from a phone call, and therefore the customer has had a first response because you picked up their call, you still need to send a short summary of the call or something similar to trigger the First Response timer to stop Recovery SLA The Recovery SLA is for Incidents only. If a workaround is provided in advance of a permanent fix, tickets should be set to Workaround Provided status. The target time for a workaround to be provided is displayed in a sidebar app as shown below. It is possible to notify agents when a recovery time is approaching or has been missed, but many tickets do not have/require a workaround, so this option is disabled. As soon as the status is set to Workaround Provided OR a ticket is resolved, the Recovery SLA timer is stopped. The following fields are set: \"Recovery SLA Violated\" will show \"Yes or \"No\" on all tickets (empty if not an Incident) Recovery Time (how long from ticket creation to recovery timer stopping). This is not shown on the ticket, but can be reported on. Recovery Violation time (how much over were we if the Recovery SLA was missed). This is not shown on the ticket, but can be reported on. The Target Recovery Time is a very useful mechanism when explaining to customers that the Incident Resolution target times may seem a little long, but if we have to fix a software fault, put it through testing cycles, and release, this does take time, and therefore if we can find a workaround, we will do so within the Target Recovery Time if at all possible. Resolution SLA Every ticket which is not resolved has the target resolution time displayed on the top right (as per the screenshot inn the First Response section. In the case of a P5, which our global standard SLA says has no applicable time, it is set to 1 year. Customers can see on the portal if their tickets were resolved within SLA or not How do I make sure I don't miss any SLAs? There are ticket views including ones just showing your own tickets which have a Response or Resolution SLA today or tomorrow, or even overdue ones. Any ticket view can be filtered to find this out e.g. below. Remember it's a team effort, so even if you don't have any overdue, look out for any tickets where the first response hasn't been done or the resolution is due soon or overdue Why is the SLA Target Not Showing? Certain statuses pause the SLA timer as explained in Ticket Statuses Explained and How To Use Them in which case the target Response and Resolution SLA times are not shown (see screenshot below) because the target time is being extended constantly in line with how long the SLA is being paused for.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-09-19T14:55:29+01:00",
    "updated_at": "2023-10-19T09:31:37+01:00",
    "status": 2,
    "tags": [],
    "description": "<p class=\"fd-toc\" data-identifyelement=\"536\"><strong data-identifyelement=\"537\"><span data-identifyelement=\"538\" style=\"font-size: 16px;\">TABLE OF CONTENTS</span></strong></p><ul data-identifyelement=\"539\"><li data-identifyelement=\"540\" style=\"font-size: 16px;\"><span data-identifyelement=\"541\" style=\"font-size: 16px;\"><a data-identifyelement=\"542\" href=\"#Introduction\">Introduction</a></span></li><li data-identifyelement=\"543\" style=\"font-size: 16px;\"><span data-identifyelement=\"544\" style=\"font-size: 16px;\"><a data-identifyelement=\"545\" href=\"#First-Response-SLA\">First Response SLA</a></span></li><li data-identifyelement=\"546\" style=\"font-size: 16px;\"><span data-identifyelement=\"547\" style=\"font-size: 16px;\"><a data-identifyelement=\"548\" href=\"#Recovery-SLA\">Recovery SLA</a></span></li><li data-identifyelement=\"549\" style=\"font-size: 16px;\"><span data-identifyelement=\"550\" style=\"font-size: 16px;\"><a data-identifyelement=\"551\" href=\"#Resolution-SLA\">Resolution SLA</a></span></li><li data-identifyelement=\"552\" style=\"font-size: 16px;\"><span data-identifyelement=\"553\" style=\"font-size: 16px;\"><a data-identifyelement=\"554\" href=\"#How-do-I-make-sure-I-don't-miss-any-SLAs?\">How do I make sure I don't miss any SLAs?</a></span></li><li data-identifyelement=\"555\"><a data-identifyelement=\"556\" href=\"#Why-is-the-SLA-Target-Not-Showing?\"><span data-identifyelement=\"557\" style=\"font-size: 16px;\">Why is the SLA Target Not Showing?</span></a></li></ul><h2 data-identifyelement=\"555\" dir=\"ltr\" id=\"Introduction\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"556\" style=\"font-size: 24px;\"><strong data-identifyelement=\"557\" style=\"box-sizing: border-box; font-weight: 700;\">Introduction</strong></span></h2><p data-identifyelement=\"558\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"559\" style=\"font-size: 16px;\">SLA targets are important because it is a commitment we make to customers, and directly affects their satisfaction with our service if the SLAs are met or exceeded. Sometimes customers are not happy because they think we should be solving tickets much faster than the SLA, but they usually realise that they are getting a good service if they can see a report of SLA being met.</span></p><p data-identifyelement=\"560\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"561\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"562\"></span></p><p data-identifyelement=\"563\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"564\" style=\"font-size: 16px;\">Every ticket has a target Response, Recovery, and Resolution time which matches up to the <a data-identifyelement=\"565\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000022571?lang=en\" rel=\"noopener noreferrer\" style=\"box-sizing: border-box; background-color: transparent; color: rgb(44, 92, 197); text-decoration: none; user-select: auto;\" target=\"_blank\">Service Level Agreement (SLA)</a>. &nbsp;If the Ticket Priority changes, the SLA targets will be changed accordingly (but not retrospectively i.e. if a tickets is raised as a P2 and the First Response is missed, and then the Ticket Priority is changed (e.g. by changing Urgency and/or Impact), the system will not calculate a new Response SLA and recalculate whether the first response would have fallen into it or not.</span></p><p data-identifyelement=\"566\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"567\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"568\"></span></p><h2 data-identifyelement=\"569\" dir=\"ltr\" id=\"First-Response-SLA\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"570\" style=\"font-size: 24px;\"><strong data-identifyelement=\"571\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: 700;\">First Response SLA</strong></span></h2><p data-identifyelement=\"572\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"573\" style=\"font-size: 16px;\">Every ticket when created is given a First Response Due target. This is initially green, then if it's close to being missed, it will turn Amber, and then Red if the SLA was missed. Once the first response has been sent, the target time will disappear&nbsp;</span></p><p data-identifyelement=\"574\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"575\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"576\"></span></p><p data-identifyelement=\"577\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"578\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103050602791/original/c4wtGAek7iY_RNVO_wvnO3lii8Iw_PpvCQ.png?1695226459\" class=\"fr-fic fr-fil fr-dib fr-bordered\" style=\"box-sizing: content-box; border: 1px solid rgb(204, 204, 204); vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; width: auto;\" data-attachment=\"[object Object]\" data-id=\"103050602791\" data-identifyelement=\"579\"></span></p><p data-identifyelement=\"580\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"581\" style=\"font-size: 16px;\">We never want to see the below :-0 i.e. the First Response Time was missed.</span></p><p data-identifyelement=\"582\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"583\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103050602779/original/ap_Af1IA9GYwMvh2EyqWT67hX7MtqTzjiA.png?1695226459\" class=\"fr-fic fr-fil fr-dib fr-bordered\" data-id=\"103050602779\" style=\"box-sizing: content-box; border: 1px solid rgb(204, 204, 204); vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; width: 196px;\" data-attachment=\"[object Object]\" data-identifyelement=\"584\"></span></p><p data-identifyelement=\"582\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><br></p><pre class=\"fd-callout fd-callout--note\" dir=\"ltr\">The First Response SLA timer is only stopped when we send the first communication to the customer from a logged ticket. This means sending a Reply or a Public Note.\n\nSo, even if you've logged a ticket from a phone call, and therefore the customer has had a first response because you picked up their call, you still need to send a short summary of the call or something similar to trigger the First Response timer to stop</pre><p dir=\"ltr\"><br></p><br><p data-identifyelement=\"585\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"586\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"587\"></span></p><h2 data-identifyelement=\"588\" dir=\"ltr\" id=\"Recovery-SLA\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"589\" style=\"font-size: 24px;\"><strong data-identifyelement=\"590\" style=\"box-sizing: border-box; font-weight: 700;\">Recovery SLA</strong></span></h2><p data-identifyelement=\"591\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"592\" dir=\"ltr\" style=\"font-size: 16px;\">The Recovery SLA is for Incidents only. If a workaround is provided in advance of a permanent fix, tickets should be set to Workaround Provided status. The target time for a workaround to be provided is displayed in a sidebar app as shown below. It is possible to notify agents when a recovery time is approaching or has been missed, but many tickets do not have/require a workaround, so this option is disabled.</span></p><p data-identifyelement=\"593\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"594\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"595\"></span></p><p data-identifyelement=\"596\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"597\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103050602786/original/HwCMTyZEj3WVbk92jV5c8WW7tWxPUe5GDg.png?1695226459\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103050602786\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; width: 270px;\" data-attachment=\"[object Object]\" data-identifyelement=\"598\"></span></p><p data-identifyelement=\"599\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"600\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"601\"></span></p><p data-identifyelement=\"602\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"603\" style=\"font-size: 16px;\">As soon as the status is set to Workaround Provided OR a ticket is resolved, the Recovery SLA timer is stopped. The following fields are set:</span></p><ol data-identifyelement=\"604\" style=\"box-sizing: border-box; margin: 8px 0px 4px; padding: 0px 0px 0px 40px; line-height: 17px; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><li data-identifyelement=\"605\" dir=\"ltr\" style=\"box-sizing: border-box; font-size: 16px; line-height: 18px; margin: 0px; word-break: normal; overflow-wrap: break-word;\"><span data-identifyelement=\"606\" style=\"font-size: 16px;\">\"Recovery SLA Violated\" will show \"Yes or \"No\" on all tickets (empty if not an Incident)</span></li><li data-identifyelement=\"607\" dir=\"ltr\" style=\"box-sizing: border-box; font-size: 16px; line-height: 18px; margin: 0px; word-break: normal; overflow-wrap: break-word;\"><span data-identifyelement=\"608\" style=\"font-size: 16px;\">Recovery Time (how long from ticket creation to recovery timer stopping). This is not shown on the ticket, but can be reported on.</span></li><li data-identifyelement=\"609\" dir=\"ltr\" style=\"box-sizing: border-box; font-size: 16px; line-height: 18px; margin: 0px; word-break: normal; overflow-wrap: break-word;\"><span data-identifyelement=\"610\" style=\"font-size: 16px;\">Recovery Violation time (how much over were we if the Recovery SLA was missed). <span data-identifyelement=\"611\" style=\"box-sizing: border-box; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; float: none; display: inline !important;\">This is not shown on the ticket, but can be reported on.</span>&nbsp;</span></li></ol><p><br></p><pre class=\"fd-callout fd-callout--note\"><span dir=\"ltr\">The Target Recovery Time is a very useful mechanism when explaining to customers that the Incident Resolution target times may seem a little long, but if we have to fix a software fault, put it through testing cycles, and release, this does take time, and therefore if we can find a workaround, we will do so within the Target Recovery Time if at all possible.</span></pre><p><br></p><p data-identifyelement=\"612\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"613\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"614\"></span></p><h2 data-identifyelement=\"615\" dir=\"ltr\" id=\"Resolution-SLA\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"616\" style=\"font-size: 24px;\"><strong data-identifyelement=\"617\" style=\"box-sizing: border-box; font-weight: 700;\">Resolution SLA</strong></span></h2><p data-identifyelement=\"618\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"619\" style=\"font-size: 16px;\">Every ticket which is not resolved has the target resolution time displayed on the top right (as per the screenshot inn the First Response section. &nbsp;In the case of a P5, which our global standard SLA says has no applicable time, it is set to 1 year.</span></p><p data-identifyelement=\"620\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"621\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"622\"></span></p><pre class=\"fd-callout fd-callout--info\" data-identifyelement=\"623\" dir=\"ltr\" style=\"box-sizing: border-box; overflow: visible; font-family: monospace, monospace; font-size: 16px; white-space: pre-wrap; overflow-wrap: break-word; padding: 12px 16px; display: block; cursor: pointer; word-break: normal; margin: 0px; border-width: 1px 1px 1px 6px; border-style: solid; border-color: rgb(235, 237, 240) rgb(235, 237, 240) rgb(235, 237, 240) rgb(71, 88, 103); border-image: initial; border-radius: 8px 4px 4px 8px;\"><span data-identifyelement=\"624\" style=\"font-size: 16px;\"><span data-identifyelement=\"625\" dir=\"ltr\" style=\"box-sizing: border-box; color: rgb(184, 49, 47);\">Customers can see on the portal if their tickets were resolved within SLA or not</span></span></pre><p data-identifyelement=\"626\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"627\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"628\"></span></p><h2 data-identifyelement=\"629\" dir=\"ltr\" id=\"How-do-I-make-sure-I-don't-miss-any-SLAs?\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"630\" style=\"font-size: 24px;\"><strong data-identifyelement=\"631\" dir=\"ltr\" style=\"box-sizing: border-box; font-weight: 700;\">How do I make sure I don't miss any SLAs?</strong></span></h2><p data-identifyelement=\"632\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"633\" style=\"font-size: 16px;\">There are ticket views including ones just showing your own tickets which have a Response or Resolution SLA today or tomorrow, or even overdue ones. Any ticket view can be filtered to find this out e.g. below.</span></p><p data-identifyelement=\"634\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"635\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"636\"></span></p><p data-identifyelement=\"637\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"638\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103050602785/original/Jul22hYEvSCwqFJHfEff7Qhdc_5gNlHmcQ.png?1695226459\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103050602785\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; width: 303px;\" data-attachment=\"[object Object]\" data-identifyelement=\"639\"></span></p><p data-identifyelement=\"640\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"641\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"642\"></span></p><pre class=\"fd-callout fd-callout--note\" data-identifyelement=\"643\" dir=\"ltr\" style=\"box-sizing: border-box; overflow: visible; font-family: monospace, monospace; font-size: 16px; white-space: pre-wrap; overflow-wrap: break-word; padding: 12px 16px; display: block; cursor: pointer; word-break: normal; margin: 0px; border-width: 1px 1px 1px 6px; border-style: solid; border-color: rgb(235, 237, 240) rgb(235, 237, 240) rgb(235, 237, 240) rgb(232, 111, 37); border-image: initial; border-radius: 8px 4px 4px 8px; color: rgb(0, 0, 0); font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"644\" style=\"font-size: 16px;\">Remember it's a team effort, so even if you don't have any overdue, look out for any tickets where the first response hasn't been done or the resolution is due soon or overdue</span></pre><p data-identifyelement=\"645\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"646\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"647\"></span></p><h2 data-identifyelement=\"648\" dir=\"ltr\" id=\"Why-is-the-SLA-Target-Not-Showing?\" style=\"box-sizing: border-box; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-weight: 400; line-height: 35px; color: rgb(0, 0, 0); margin: 0px; font-size: 16px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"649\" style=\"font-size: 24px;\"><strong data-identifyelement=\"650\" style=\"box-sizing: border-box; font-weight: 700;\">Why is the SLA Target Not Showing?</strong></span></h2><p data-identifyelement=\"651\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"652\" style=\"font-size: 16px;\">Certain statuses pause the SLA timer as explained in <a href=\"https://k3support.freshdesk.com/a/solutions/articles/103000131256?lang=en\" dir=\"ltr\" style=\"box-sizing: border-box; background-color: transparent; color: rgb(44, 92, 197); text-decoration: none; user-select: auto;\" data-identifyelement=\"653\"></a><a data-identifyelement=\"654\" dir=\"ltr\" href=\"http://ticket%20statuses%20explained%20and%20how%20to%20use%20them/\" style=\"box-sizing: border-box; background-color: transparent; color: rgb(44, 92, 197); text-decoration: none; user-select: auto; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 16px; font-weight: 400; text-align: left; text-indent: 0px;\">Ticket Statuses Explained and How To Use Them</a>&nbsp; in which case the target Response and Resolution SLA times are not shown (see screenshot below) because the target time is being extended constantly in line with how long the SLA is being paused for.</span></p><p data-identifyelement=\"655\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 16px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"656\" style=\"font-size: 16px;\"><br style=\"box-sizing: border-box;\" data-identifyelement=\"657\"></span></p><p data-identifyelement=\"658\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><span data-identifyelement=\"659\" style=\"font-size: 16px;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103050602780/original/ql97ETU1iX_P5ZCv8H5L1p890Slk84SbMA.png?1695226459\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103050602780\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; width: 267px;\" data-attachment=\"[object Object]\" data-identifyelement=\"660\"></span></p><h2 data-identifyelement=\"661\" id=\"\"><br data-identifyelement=\"662\"></h2>",
    "user_id": 103023352668,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 2,
    "seo_data": {},
    "modified_at": "2023-10-19T09:31:37+01:00",
    "modified_by": 103023352668
  },
  {
    "id": 103000240309,
    "title": "Use Merge tickets if multiple customers report the same issue",
    "text": "When receiving multiple tickets about same issue use the Merge function. (See below). The merge action is irreversible, and causes the following things to happen: One of the tickets becomes the primary ticket (you get to choose). The others become secondary. All conversations from the secondary tickets are moved into the primary ticket. You can also choose to keep the requesters and CC emails from the secondary tickets in the loop. Always fill in \"Product Name\" and \"Product Component\" on all the secondary tickets. Make sure the priority on the main ticket is correct and lower the other tickets to P5 as they are fillers. For more info, please see Merging two or more tickets together : Freshdesk Open dropdown box and choose ID Fill in ticket number. Go to the main ticket and press merge at the top. Make sure your main ticket is marked with the primary tag. Press continue and then \"OK\"",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-10-02T12:22:48+01:00",
    "updated_at": "2023-10-02T12:47:48+01:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">When receiving multiple tickets about same issue use the Merge function. (See below).</p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103053220763/original/PPQJ7Z-S4UFdsk-jfsggu0Bj8hwTIj5gvg.png?1696246060\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103053220763\"></p><p dir=\"ltr\"><br></p><p>The merge action is irreversible, and causes the following things to happen:</p><p><br></p><p style=\"margin-left: 20px;\"><span class=\"fr-close-ol\" dir=\"ltr\">One of the tickets becomes the primary ticket (you get to choose). The others become secondary.&nbsp;</span></p><p dir=\"ltr\" style=\"margin-left: 20px;\">All conversations from the secondary tickets are moved into the primary ticket. You can also choose to keep the requesters and CC emails from the secondary tickets in the loop.</p><p dir=\"ltr\" style=\"margin-left: 20px;\"><strong><u>Always fill in \"Product Name\" and \"Product Component\" on all the secondary tickets.</u></strong></p><p dir=\"ltr\" style=\"margin-left: 20px;\"><br></p><p dir=\"ltr\" style=\"margin-left: 20px;\">Make sure the priority on the main ticket is correct and lower the other tickets to P5 as they are fillers.</p><p><br></p><p><span dir=\"ltr\" style=\"color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 13px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; display: inline !important; float: none;\"><br></span></p><p data-identifyelement=\"536\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103053227676/original/jgX7bgtZxoAEMsn6b-2G-aOb04T9Ae1XUw.png?1696246924\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103053227676\" style=\"box-sizing: border-box; border: 0px; vertical-align: top; max-width: 100%; position: relative; cursor: pointer; padding: 0px 1px; margin: 5px auto 5px 0px; display: block; float: none; text-align: left; color: rgb(0, 0, 0); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-size: 13px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; width: auto;\" data-attachment=\"[object Object]\">&nbsp;</p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">For more info, please see <a data-identifyelement=\"538\" href=\"https://support.freshdesk.com/en/support/solutions/articles/80180-merging-two-or-more-tickets-together\" style=\"box-sizing: border-box; background-color: transparent; color: rgb(44, 92, 197); text-decoration: none;\">Merging two or more tickets together : Freshdesk</a>&nbsp;</p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><br></p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">Open dropdown box and choose ID</p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103053223238/original/QhYehxf6SpNSzL5Fj4qTZD03rKrM4vx0hQ.png?1696246374\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103053223238\"></p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">Fill in ticket number.</p><p data-identifyelement=\"537\" dir=\"ltr\" style=\"box-sizing: border-box; margin: 0px; font-size: 13px; line-height: 18px; word-break: normal; overflow-wrap: break-word; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103053219301/original/_5voQiUWsQDPexIbPA7qk-3RJ-ZEqeiccw.png?1696245849\" style=\"width: 348px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103053219301\"></p><p dir=\"ltr\">Go to the main ticket and press merge at the top.</p><p dir=\"ltr\"><br></p><p dir=\"ltr\">Make sure your main ticket is marked with the primary tag.</p><p dir=\"ltr\"><br></p><p dir=\"ltr\">Press continue and then \"OK\"</p><p><br></p>",
    "user_id": 103100691279,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 1,
    "seo_data": {},
    "modified_at": "2023-10-02T12:47:48+01:00",
    "modified_by": 103100691279
  },
  {
    "id": 103000257923,
    "title": "How to split a single ticket into two tickets",
    "text": "Sometime,the customer has one ticket that is active or may be passed to development team and they ask another query in the same ticket. In such case,there is a split button which means that you can split the two queries asked in one ticket into two sepearte tickets. Locate the 2nd query being asked in the active ticket and Click on split option as shown You will notice that a new ticket is generated for the new query being asked by the customer. The old ticket remains with the same ticket number and same information.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-11-23T15:30:33+00:00",
    "updated_at": "2023-11-23T15:30:34+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">Sometime,the customer has one ticket that is active or may be passed to development team and they ask another query in the same ticket.<br><br>In such case,there is a split button which means that you can split the two queries asked in one ticket into two sepearte tickets.<br><br>Locate the 2nd query being asked in the active ticket and Click on split option as shown<br><br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067047401/original/CYpg6XFjKoWj7OJEADpTPxf8xxBwORGeNw.png?1700753265\" style=\"width: 718px;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103067047401\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">You will notice that a new ticket is generated for the new query being asked by the customer.<br><br>The old ticket remains with the same ticket number and same information.</p>",
    "user_id": 103081812637,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2023-11-23T15:30:33+00:00",
    "modified_by": 103081812637
  },
  {
    "id": 103000261380,
    "title": "Bulk updating tickets linked to a Tracker",
    "text": "There are two ways to bulk update tickets - Bulk Update Tickets and the one below which is a quick hack for bulk updating tickets linked to a Tracker. Find your tracker ticket in this list: All tracker tickets : K3 Support (k3btg.com) When you see your tracker in the list then you have to change layout and choose\"card view\" as shown below. Now that the view has changed you can see a new information on the list, showing how many tickets are related to it. Click on that information and a new menu will open on the right. This menu shows all the ticket that are related to this tracker ticket. From here you can press the square to mark all on the page - IMPORTANT - this only marks the current page, and each page is 30 tickets, if there is more than 30 you ahve repeat the next steps for following pages as wel. Then press the \"bulk update\" button In the next windows you get the options to change every parameter of the tickets. It's important to put in the check mark ONLY on parameters you want change. When you are done writing your message, changing priority or status on the tickets press \"update\" and Freshdesk will execute the task",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2023-12-11T09:56:41+00:00",
    "updated_at": "2025-04-02T11:44:20+01:00",
    "status": 2,
    "tags": [],
    "description": "<p data-identifyelement=\"525\" dir=\"ltr\">There are two ways to bulk update tickets - <a data-identifyelement=\"526\" href=\"https://k3support.freshdesk.com/a/solutions/articles/103000244178/edit?lang=en\">Bulk Update Tickets</a> and the one below which is a quick hack for bulk updating tickets linked to a Tracker.</p><p data-identifyelement=\"527\" dir=\"ltr\"><br data-identifyelement=\"528\"></p><p data-identifyelement=\"529\" dir=\"ltr\">Find your tracker ticket in this list: <a data-identifyelement=\"530\" href=\"https://support.k3btg.com/a/tickets/filters/search?orderBy=created_at&amp;orderType=desc&amp;q[]=created%3A%22last_180_days%22&amp;q[]=association_type%3A%5B%223%22%5D&amp;ref=all_tickets\" rel=\"noopener noreferrer\" target=\"_blank\">All tracker tickets : K3 Support (k3btg.com)</a></p><p data-identifyelement=\"531\"><br data-identifyelement=\"532\"></p><p data-identifyelement=\"533\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072014022/original/yjiXII8anzmk3XIaspkWKtTmTr5u25M0sQ.png?1702288594\" style=\"width: auto;\" class=\"fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072014022\" data-identifyelement=\"534\"></p><p data-identifyelement=\"535\"><br data-identifyelement=\"536\"></p><p data-identifyelement=\"537\" dir=\"ltr\"><br data-identifyelement=\"538\">When you see your tracker in the list then you have to change layout and choose\"card view\" as shown below.<br data-identifyelement=\"539\"><br data-identifyelement=\"540\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072102343/original/lEqGE5jYuY6AryotL-k3kpB8yGka_bQJ9w.png?1702298148\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072102343\" data-identifyelement=\"541\"></p><p data-identifyelement=\"542\"><br data-identifyelement=\"543\"></p><p data-identifyelement=\"544\" dir=\"ltr\">Now that the view has changed you can see a new information on the list, showing how many tickets are related to it.<br data-identifyelement=\"545\">Click on that information and a new menu will open on the right.<br data-identifyelement=\"546\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072104305/original/aZ6bL3LGc_QMkO7rrYA5J4uvv0aUAtTgkA.png?1702298394\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072104305\" data-identifyelement=\"547\"></p><p data-identifyelement=\"548\" dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072104430/original/9eMcrk839lwBSQg76RPF0S_d7xgHs46nWQ.png?1702298407\" style=\"width: auto;\" class=\"fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072104430\" data-identifyelement=\"549\"><br data-identifyelement=\"550\">This menu shows all the ticket that are related to this tracker ticket.<br data-identifyelement=\"551\">From here you can press the square to mark all on the page - IMPORTANT - this only marks the current page, and each page is 30 tickets, if there is more than 30 you ahve repeat the next steps for following pages as wel.<br data-identifyelement=\"552\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072106963/original/7M7Ul7jRxTMpvDwIAKpCGfoohBE9Y_I_Ag.png?1702298727\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072106963\" data-identifyelement=\"553\"></p><p data-identifyelement=\"554\" dir=\"ltr\"><br data-identifyelement=\"555\">Then press the \"bulk update\" button<br data-identifyelement=\"556\"><br data-identifyelement=\"557\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072107239/original/ZE7HhuJegoC1LCM7N0u42-0fUB_XsAjXmw.png?1702298765\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072107239\" data-identifyelement=\"558\"></p><p data-identifyelement=\"559\" dir=\"ltr\"><br data-identifyelement=\"560\"></p><p data-identifyelement=\"561\" dir=\"ltr\">In the next windows you get the options to change every parameter of the tickets.<br data-identifyelement=\"562\">It's important to put in the check mark ONLY on parameters you want change.<br data-identifyelement=\"563\">When you are done writing your message, changing priority or status on the tickets press \"update\"<br data-identifyelement=\"564\">and Freshdesk will execute the task<br data-identifyelement=\"565\"><br data-identifyelement=\"566\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072109286/original/PioYHdt124K9l-zgHbDs3-YOdTB2al75cQ.png?1702299009\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103072109286\" data-identifyelement=\"567\"></p><p data-identifyelement=\"568\"><br data-identifyelement=\"569\"></p><p data-identifyelement=\"570\"><br data-identifyelement=\"571\"></p><p data-identifyelement=\"572\" dir=\"ltr\"><br data-identifyelement=\"573\">&nbsp;</p><p data-identifyelement=\"574\"><br data-identifyelement=\"575\"></p><p data-identifyelement=\"576\"><br data-identifyelement=\"577\"></p><p data-identifyelement=\"578\"><br data-identifyelement=\"579\"></p>",
    "user_id": 103089414264,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2025-04-02T11:44:20+01:00",
    "modified_by": 103081812637
  },
  {
    "id": 103000268758,
    "title": "How to create a ticket from a call that is closed",
    "text": "If you by mistake closed a call before making the ticket you can follow this guide to create a ticket that is linked with that specific call. Go to Freshdesk and open Frescaller and press \"view all\" This will now open the the call metrics overview. In this list you can find the call To the right you can see the ticket logo, if the outline is grey no ticket is created. If it's blue then a ticket is associated with this call. If you click the ticket symbol you will be shown this menu. Press on \"create new ticket\" - this windows willshow. Here you can change the subject name and then press create ticket and you now have a ticket associated with this call. a",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2024-01-15T10:54:31+00:00",
    "updated_at": "2024-01-15T10:54:32+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">If you by mistake closed a call before making the ticket you can follow this guide to create a ticket that is linked with that specific call.<br><br>Go to Freshdesk and open Frescaller and press \"view all\"<br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103079561427/original/9h16tZBpRx2aTmSNpPeUKGc5QQlllyl4QA.png?1705315534\" style=\"width: 200px;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103079561427\"></p><p dir=\"ltr\">This will now open the the call metrics overview.</p><p dir=\"ltr\"><br>In this list you can find the call<br>To the right you can see the ticket logo, if the outline is grey no ticket is created. If it's blue then a ticket is associated with this call.<br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103079564940/original/okjLblxRh5-ggW-bDjsDWLbNruYNnlLGvg.png?1705315896\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103079564940\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">If you click the ticket symbol you will be shown this menu.<br><br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103079565313/original/7yPo6YZGIrUG8HLEx0FnlFOGxKf654aN6w.png?1705315941\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103079565313\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">Press on \"create new ticket\" - this windows willshow.<br>Here you can change the subject name and then press create ticket and you now have a ticket associated with this call.<br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103079566243/original/HUYBXpLJTEJhNdpuVgdleYsgEmyvddpDhw.png?1705316025\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103079566243\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">a</p>",
    "user_id": 103089414264,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2024-01-15T10:54:31+00:00",
    "modified_by": 103089414264
  },
  {
    "id": 103000272593,
    "title": "Merge option is not available on a ticket.",
    "text": "One can experience that when the tickets are linked to a tracker,the linked tickets cannot be merged. In such case,One should unlink the required tickets from the tracker and after that it can be merged. As shown in the below screenshot,the feature merge is not available here because it is linked to a tracker. We should track the tracker ticket in this case and should unlink the corresponding tickets. Click on related tickets in pic 1 Then select the unlink option as shown in pic 2 After selecting the unlink option,One can observe that the MERGE feature/option is now available corresponding ticket as shown in pic 3. Pic 1 Pic 2 Pic 3",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2024-01-31T16:54:32+00:00",
    "updated_at": "2024-02-01T11:05:00+00:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">One can experience that when the tickets are linked to a tracker,the linked tickets cannot be merged.<br>In such case,One should unlink the required tickets from the tracker and after that it can be merged.<br><br><br>As shown in the below screenshot,the feature merge is not available here because it is linked to a tracker.<br><br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103084205734/original/BmZgZmQ25frq9ir3YuDnOJYjDfJyoVuXiw.png?1706719795\" style=\"width: 450px;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103084205734\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">We should track the tracker ticket in this case and should unlink the corresponding tickets.<br><br>Click on related tickets in pic 1<br>Then select the unlink option as shown in pic 2<br><br>After selecting the unlink option,One can observe that the MERGE feature/option is now available corresponding ticket as shown in pic 3.<br><br>Pic 1<br><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103084204270/original/t7UzspNpCIORLVQZYSboCUPGRH4bQcTzTQ.png?1706719554\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103084204270\"></p><p dir=\"ltr\">Pic 2</p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103084206709/original/QPzAHuWPMfUTZGzYTYi1q70gMtfL0Jf6eg.png?1706719936\" style=\"width: 570px;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103084206709\"></p><p dir=\"ltr\"><br></p><p dir=\"ltr\">Pic 3</p><p dir=\"ltr\"><br></p><p dir=\"ltr\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103084206822/original/NBYvlr4Q9BsXv2on0xZAVSe5kyDnwK8mng.png?1706719960\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103084206822\"></p>",
    "user_id": 103081812637,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2024-02-01T11:05:00+00:00",
    "modified_by": 103081812637
  },
  {
    "id": 103000291760,
    "title": "How to find a deleted ticket if you have the ticket number",
    "text": "Open any ticket Look at the URL https://support.k3btg.com/a/tickets/51857 Replace the ticket number at the end with the ticket number you are looking for. You will now see the ticket even if it is deleted. Does not work if ticket is Deleted forever",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2024-05-13T15:41:36+01:00",
    "updated_at": "2024-05-13T15:41:36+01:00",
    "status": 2,
    "tags": [],
    "description": "<ol><li dir=\"ltr\">Open any ticket</li><li dir=\"ltr\">Look at the URL<br>https://support.k3btg.com/a/tickets/51857</li><li dir=\"ltr\">Replace the ticket number at the end with the ticket number you are looking for.</li><li dir=\"ltr\">You will now see the ticket even if it is deleted.<br>Does not work if ticket is Deleted forever</li></ol>",
    "user_id": 103089414264,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 0,
    "seo_data": {},
    "modified_at": "2024-05-13T15:41:36+01:00",
    "modified_by": 103089414264
  },
  {
    "id": 103000295912,
    "title": "Registered customers tickets ends up in \"unknown customer\"",
    "text": "If you see a registered customers tickets show up in the unknown customer filter 9i. Global - Unknown customers , then you have to check the company's information in Freshdesk. Example: This customers is registered as a contact, but is still getting the unknown customer tag. To resolve this we have to check the company information. Here is an example, company on the left is missing CRM account number and Regional Product in Details tab, and a Contract is missing in the Related contracts tab. Missing information Correct information If your customer is missing this info, send an email to Odd - odd.rune@k3btg.com containing 1. Link to the customer profile in Freshdesk. 2. The missing ACC number from CRM 3. The product name 4. If the contract is missing in Freshdesk.",
    "category": "INTERNAL Support Articles",
    "folder": "Ticket Management",
    "created_at": "2024-06-07T11:04:01+01:00",
    "updated_at": "2024-06-07T11:04:01+01:00",
    "status": 2,
    "tags": [],
    "description": "<p dir=\"ltr\">If you see a registered customers tickets show up in the unknown customer filter <a href=\"https://support.k3btg.com/a/tickets/filters/408383\" rel=\"noopener noreferrer\" target=\"_blank\">9i. Global - Unknown customers</a> ,&nbsp;</p><p dir=\"ltr\">then you have to check the company's information in Freshdesk.<br><br>Example:<br>This customers is registered as a contact, but is still getting the unknown customer tag.<br><br></p><div class=\"breadcrumb__item\" data-identifyelement=\"109\" style=\"box-sizing: border-box; font-weight: 500; box-shadow: none; border: none; outline: 0px; display: table-cell; vertical-align: middle; padding-right: 6px; font-size: 16px; color: rgb(24, 50, 71); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal;  text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"><div class=\"breadcrumb-title ellipsis \" data-identifyelement=\"110\" data-test-title=\"ticket-filter\" style=\"box-sizing: border-box; text-overflow: ellipsis; white-space: nowrap; overflow: hidden; max-width: 400px;\"><span class=\"cursor-pointer \" data-identifyelement=\"111\" dir=\"ltr\" style=\"box-sizing: border-box; cursor: pointer;\"><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103119913752/original/hlvCrsRL4HGraNzdfC7swOSL_y7zgCbStQ.png?1717753946\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103119913752\"></span></div></div><p dir=\"ltr\"><br></p><p dir=\"ltr\">To resolve this we have to check the company information.<br>Here is an example, company on the left is missing <strong dir=\"ltr\">CRM account number&nbsp;</strong>and <strong dir=\"ltr\">Regional Product</strong> in Details tab, and a <strong dir=\"ltr\">Contract&nbsp;</strong>is missing in the Related contracts tab.</p><p dir=\"ltr\"><br></p><table style=\"width: 100%;\"><tbody><tr><td dir=\"ltr\" style=\"width: 50.0000%;\"><div dir=\"ltr\" style=\"text-align: center;\"><strong>Missing information</strong></div></td><td dir=\"ltr\" style=\"width: 50.0000%;\"><div style=\"text-align: center;\"><strong>Correct information</strong></div></td></tr></tbody></table><table style=\"width: 100%;\"><tbody><tr><td style=\"width: 25%; text-align: left; vertical-align: top;\"><strong><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103119914906/original/toWpQ-WAAV6eTUxPae0lrxKWpoBzsElt8g.png?1717754071\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103119914906\"></strong></td><td style=\"width: 25%; vertical-align: top;\"><strong><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103119914918/original/5695rDqhkRzPTnEeG8TKf3ck1BQ8wOVYIQ.png?1717754074\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103119914918\"></strong></td><td style=\"width: 25.0000%;\"><strong><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103119919098/original/9UOyn5TIHNWV2vp-3u1IyJ6fjKvG7FExRA.png?1717754494\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-id=\"103119919098\"></strong></td><td style=\"width: 25%; vertical-align: top;\"><strong><img src=\"https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103119915765/original/93pCwfefF5tW3mz-cxKzg5F04Ex8RBGaMg.png?1717754146\" style=\"width: auto;\" class=\"fr-fic fr-fil fr-dib\" data-attachment=\"[object Object]\" data-id=\"103119915765\"></strong></td></tr></tbody></table><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\">If your customer is missing this info, send an email to Odd - <a href=\"mailto:odd.rune@k3btg.com\">odd.rune@k3btg.com</a> containing<br><br>1. Link to the customer profile in Freshdesk.</p><p dir=\"ltr\">2. The missing ACC number from CRM</p><p dir=\"ltr\">3. The product name</p><p dir=\"ltr\">4. If the contract is missing in Freshdesk.</p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p dir=\"ltr\"><strong><br></strong></p><p><br></p>",
    "user_id": 103089414264,
    "thumbs_up": 0,
    "thumbs_down": 0,
    "hits": 1,
    "seo_data": {},
    "modified_at": "2024-06-07T11:04:01+01:00",
    "modified_by": 103089414264
  }
]