[
  {
    "title": "Updatebeschreibungen",
    "text": "Updatebeschreibungen\nRelease September 2017\nEigene Artikeltexte\nNeben den Standard Artikeltexten in Cowis können nun auch sog. Eigene Artikeltexte (bzw. Artikeltexttypen) definiert werden, welche an den DdD eShop übergeben werden können. Diese Texte können sowohl in COWIS, als auch im DdD eShop direkt bearbeitet werden. Im DdD eShop können nur die bereits in COWIS erstellten Texttypen verwendet werden.\nArtikelliste -> Texte\nRelease August 2017\nKategorie und gruppenbezogene Sortierung\nIn manchen Fällen kann es hilfreich sein, dass die globale Artikel -  Sortierung durch eine kategoriegenaue Artikel - Sortierung überschrieben werden kann. Im Bereich Kategorie / Gruppen / Warengruppen -> Kategorie sowie Kategorie / Gruppen / Warengruppen -> Gruppen wurde in den jeweiligen Detailansichten die Möglichkeit geschaffen, die Sortierung zu beeinflussen.\nRelease Januar 2017\nBehobene Fehler und Optimierungen\nWenn man nach einem Stichwort suchte und eine Seite blätterte, konnte es vorgekommen dass eine falsche Seite angezeigt wurde.\nRelease Dezember 2016\nBehobene Fehler und Optimierungen\nEs verbleiben manchmal SETS ohne Hauptartikel im Warenkorb. Diese können zu Problemen führen. Daher wurde eine Routine integriert, welche diese Set Fragmente aus der Warenkorbtabelle entfernt.\nBeim Speichern von Artikeln in der Gutscheinartikelliste konnte es vorkommen, dass Artikel beim Speichern wieder aus der Liste flogen.\nRelease November 2016\nMehrfachfilter im Kategoriebereich mit optionaler AJAX Erweiterung\nUm das Einkaufserlebnis für den User weiter zu verbessern wurde die bereits bestehende Filterfunktion des DdD eShops erweitert.\nWährend man bei der alten Filterfunktion nur jeweils nach einem Kriterium filtern konnte (Marke = A, Farbe = blau) ist es nun optional möglich, nach mehreren Kriterien zu filtern (Marke=A, X und Z, Farbe=blau,grün und gelb etc.)  Somit ist es dem User möglich, das Kategorieergebnis noch besser einzugrenzen.\nZusätzlich kann der DdD eShop so eingestellt werden, dass die Filteranfragen nicht mehr die ganze Seite laden, sondern nur noch den relevanten Kategoriebereich (AJAX basierend).  Somit ist das Surferlebnis für den Besucher der Seite noch besser.\nIm Zuge der Auffrischung dieser Funktionalität wurde auch ein neuer Preisfilter integriert, der jedoch nur für den AJAX basierenden Teil zur Verfügung steht.\nMelden sie sich einfach bei Fragen zur Integration, Kosten etc.\nRelease Oktober 2016\nArtikel-Vergleichsfunktion\nDer Benutzer klickt direkt in der Artikelübersichtsliste des Shops auf den Button „vergleichen“.\nDer Artikel wird intern als Vergleichslistenartikel gespeichert. Weiterhin erscheint im oberen Bereich des Shops (Kann über Layout Einstellungen definiert werden) die Information, dass sich aktuell 1 Artikel in der Vergleichsliste befindet.\nDer Vorgang kann mehrmals für andere Artikel oder Artikelvarianten wiederholt werden, bis die maximale Anzahl an Artikeln erreicht ist. Nun lässt sich die Vergleichsliste öffnen, einen Vergleich starten, Artikel aus der Vergleichsliste entfernen oder den kompletten Vergleich löschen.\nDurch Klick auf „Vergleich starten“ gelangt man in den Bereich „Vergleichslistendarstellung“\nIn diesem Bereich können nun Artikel bzw. Artikelvarianten miteinander verglichen werden.\nDurch Anklicken des „Produkt ansehen“ Buttons gelangt man direkt zum Artikel, durch Anklicken des „In den Warenkorb“ Buttons kann man Artikel direkt in den Warenkorb legen.\nHier kommt es allerdings darauf an, ob bereits eine Variante für einen Artikel ausgewählt wurde (Zu sehen an der Zeile „Variante“). Ist hier bereits eine Variante hinterlegt, wird der Artikel direkt in den Warenkorb gelegt. Ist noch keine Variante ausgewählt, erscheint ein Zwischen PopUp, mit dem man entscheiden kann, welche Variante in den Warenkorb gelegt werden soll.\nIndixierung von Gruppen Langtexten\nDamit Artikel auch Nach Gruppen-Langtexten durchsucht werden können, die Performance jedoch nicht darunter leiden soll, können diese Artikelinformationen nun über einen Texttypen gespeichert und durchsucht werden. Die Indexierung erfolgt zeitgesteuert einmal am Tag über das Zeitmanagement des Shops und muss vom DdD Support eingerichtet werden. Im Zeitmanagement muss dafür die Funktion \"Erstelle Artikel-Gruppentexte\" angelegt und aktiviert sein.\nRelease August 2016\n301 Weiterleitungen\nArtikel die aus dem Shop genommen werden (Abverkauf, Saisonende etc..) können sich negativ auf das Suchmaschinenverhalten auswirken. Google und andere Suchmaschinen haben sich diese Artikelseiten gemerkt (indiziert) und der normale User kann kann weiterhin diese Seite aufrufen. Bei diesem Aufruf wird nun ein sog. 404 Error Code erzeugt (Seite nicht auffindbar). Da dieses Ergebnis für Mensch und Maschine nicht optimal ist, ist es nun möglich, diese Artikel Links anhand von Regeln auf andere Seiten referenzieren zu lassen (301 Weiterleitung).\nFolgende Regeln sind hierbei möglich (Beispiele):\nAlle Artikel der Marke Adidas werden auf eine mit Adidas spezifischem Inhalt gefüllte Seite geleitet. (Markenweiterleitung)\nAlle Sneaker der Marke Adidas werden auf eine mit Adidaschuhen spezifischen Inhalt geleitet (Marken und warengruppenspezifisch)\nDer Sneaker 40175 Warm Air wird direkt auf eine spezifische Seite weitergeleitet.\nBehobene Fehler\nIm Bereich Administration -> Grundeinstellungen -> Javascript Kopf und Fuss konnte ein Fehler dazu führen, dass Code falsch übertragen wurde (+ Zeichen). Dies wurde korrigiert.\nRelease Juli 2016\n\"Neue Artikel\" im Webshop\nDamit der Webshop Artikel, welche das Erste Mal im Shop sind, besser erkennen kann, wurde ein Mechanismus geschaffen, welcher Artikel, die neu in den Shop kommen zu indizieren.\nSomit kann man nun:\nNach neuen Artikeln sortieren\nEine Auswahl an Artikeln, beispielsweise auf der Startseite, als „Neu im Shop“ darstellen.\nNeue Artikel mit einem Teaser markieren\nBehobene Fehler\nEin Problem beim Darstellen von Mail Texten wurde behoben. Es konnte vorkommen, dass sich Mail Texte nicht richtig darstellen ließen und somit auch nicht editierbar waren. Die Darstellung dieser Mail texte wurde nun verändert, wodurch der Fehler behoben wurde.\nRelease Juni 2016\nBehobene Fehler\nBeim Hinterlegen von Modellen wurden bisher nur Kürzel von Farben und anderer Merkmale gespeichert. Nun werden die kompletten Werte für jedes Modell hinterlegt.\nRelease Februar 2016\nOptimierte Auswahl von Varianten/Modellen\nAktuell wird die Variantenauswahl lediglich in Form von Selektionsboxen dargestellt. Die Auswahl von Varianten/Modellen wurde nun um eine zeitgemäßere alternative Darstellungsform erweitert.\nALT:\nNEU:\nVorteile:\n- Die Elemente können grafisch angepasst werden.\n- Farben können als Hexadezimalwert oder als Grafik angezeigt werden.\n- Schönere Darstellungsvariante.\nRelease Dezember 2015\nPersonalisierte Gutscheine\nUm dem Shop Besucher einen höheren Anreiz zu geben, einen Warengutschein zu kaufen, wurde das Thema „Personalisierung“ aufgegriffen. Das bedeutet, dass der Kunde in der Lage ist, aus verschiedenen Gutscheinlayouts auszuwählen, Titel, Schriftfarbe, Hintergrundbild nach seinen Wünschen zu gestalten und zudem eine Nachricht direkt auf dem Gutschein zu hinterlassen.\nIn der Motivauswahl kann der Käufer aus verschiedenen Vorlagen für seinen Gutschein wählen. Dem Shop-Betreiber sind hierbei dank der flexiblen Darstellung mittels Karussell-Darstellung keinerlei Begrenzungen gesetzt, was die Anzahl der Vorlagen angeht.\nIm Bereich „Personalisierung“ ist es dem Käufer möglich, einen eigenen Titel für den Gutschein zu vergeben. Der ursprüngliche Gutscheintitel wird hierbei ersetzt. Neben fest definierten Gutscheinwerten (10,00 Euro bis 250,00 Euro) kann der Kunde auch einen eigenen Wert angeben (Die Maximalgrenze kann hierbei über das Backend des Shops definiert werden). So kann man beispielsweise für einen 66.ten Geburtstag den Betrag 66,66 Euro angeben. Im finalen Schritt legt der Kunde seinen personalisierten Gutschein in den Warenkorb.\nSollte der Besucher mit der vordefinierten Schriftfarbe nicht einverstanden sein (vorallem dann, wenn der Shop Besucher ein eigenes Bild verwenden möchte), so kann auch die Schriftfarbe den Besonderheiten angepasst werden.\nAuch das Hochladen eines eigenen Hintergrundbildes ist möglich. Sollte der Kunde den Wunsch haben, beispielsweise ein Familienfoto als Hintergrundbild zu verwenden, so kann dieses Bild über „Durchsuchen“ geladen werden. Die Dateigröße ist hierbei auf 8 MB limitiert und das Dateiformat auf Jpeg begrenzt.\nMöchte der Kunde noch einen personalisierten Gruß hinterlegen, so kann er dies über den Punkt \"Freitext\" tun.\nSind die Angaben zur Zufriedenheit des Kunden, kann der Gutschein in den Warenkorb gelegt werden. Um sich im Vorfeld einen Eindruck über den fertigen Gutschein machen zu können, kann mittels der \"Vorschau\" Schaltfläche ein Fenster geöffnet werden, mit welcher eine Live-Vorschau erzeugt wird.\nIm finalen Schritt legt der Kunde seinen personalisierten Gutschein in den Warenkorb.\nGutschein mit geändertem Titel, einem optionalen Freitext sowie einer geänderten Schriftfarbe\nUm das Einkaufserlebnis weiterhin zu verbessern, kann der Shop so eingestellt werden, dass diese gekauften Gutscheine direkt nach dem Kauf aktiv sind und die Gutscheine als Grafik an den Besteller versendet werden.\nEine weitere Besonderheit dieser Art der Gutscheinerstellung ist, dass der Kunde diesen Gutschein direkt nach der Bestellung mittels der Bestellbestätigung in Form einer PDF im Anhang bekommt.\nSollte ein Kunde seinen Gutschein nicht direkt über die Bestellung freigeschaltet bekommen, da er beispielsweise mit Vorkasse bezahlt, so kann der Shop-Betreiber diesen Gutschein nach erhaltener Zahlung einfach über das Shop Backend freischalten und eine automatisierte Nachricht mit Gutscheincode und PDF Datei an den Kunden versenden.\nRelease Oktober 2015\nNeue Textfelder für Kategorien und Gruppen\nFür den Bereich \"Kategorien und Gruppen\" wurde die Datenbank um 3 neue Textfelder erweitert, damit Layouts noch flexibler gestaltet werden können. Mit Hilfe dieser neuen Textfelder kann man Kategorien oder Gruppen (z.B. Alle Artikel einer Marke) genauer und ausführlicher definieren.\nDie Ansicht der verschiedenen Kategorien und Gruppen besitzt nun zusätzliche\nTextfelder um Infotext zu anzuzeigen.\nIm Backend gibt es nun sechs, anstatt drei Schaltflächen für das Hinterlegen von Infotexten.\nRelease September 2015\nSet-Artikel\nDer DdD eShop eröffnet nun die Möglichkeit, mehrere Artikel zu einem sogenannten \"Set\" zusammenzufassen. Artikel eines \"Sets\" werden üblicherweise im Gesamtpaket günstiger angeboten, als sie es einzeln wären, wodurch neue Kaufanreize geschaffen werden. Mit der Möglichkeit pro Set \"optionale Zusatzartikel\" anzubieten, lässt sich das Angebot zusätzlich abrunden.\nFeatures\nZusammenfassen mehrerer Artikel zu einem Set.\nMöglichkeit nur bestimmte Modelle der zum Set gehörenden Artikel zuzulassen.\nFestlegung wie der Preis eines Artikels innerhalb des Sets reduziert sein soll (reduzierter Festbetrag oder prozentuale Reduzierung).\nDies ist sogar bis auf Variante-Ebene hin möglich, also bspw. „größenspezifisch“.\nVariantenauswahl: Pro Set kann der Käufer aus den Artikel-Varianten (Modellen) auswählen, welche der Händler vorkonfiguriert hat.\nOptionale Zusatz-Artikel: Es können pro Set „Zusatzartikel“ angeboten werden, welche ebenfalls reduziert werden, wenn sie in Verbindung mit einem Set gekauft werden.\nWeitere Informationen erhalten Sie im\nHandbuch\n.\nZum Erwerb dieses Add-On´s kontaktieren Sie bitte unseren\nVertrieb\n.\nBei der Beratung und Einrichtung Ihres gewünschten Layouts von Sets steht Ihnen unser\neShop-Kundenbetreuung\nzur Verfügung.\nDarstellung im DdD eshop\nLegende:\nFür die Darstellung des Sets werden das Bild verwendet, welches dem COWIS \"Set-Artikel\" zugeordnet ist.\nDarstellung weiterer Bilder.\nFür die Anzeige weiterer Bilder, werden ebenfalls die Bilder verwendet, die dem COWIS \"Set-Artikel\" zugeordnet wurden.\nDarstellung eines Beschreibungstextes.\nDarstellung des Set-Namens.\nDarstellung der im Set enthaltenen Artikel.\nKalkulation des Setpreises (größenbezogene Preise, welche für das Set konfiguriert sind, werden ebenfalls berücksichtigt).\nBehobene Fehler\nIn bestimmten Fällen war es nicht mehr möglich, Formulare innerhalb der Admin Bereichs zu speichern. Dies betraf den Bereich \"Katalog und Gruppen\" sowie den Bereich \"Seitenmanagement.\"\nUnter bestimmten Umständen konnte der Zustand eines Katalogeintrags (aktiv/passiv) nicht mehr geändert werden. Um diesen Fehler zu beheben, wird diese Einstellung künfig im Detailbereich des Katalogs konfigurierbar sein.\nIm Admin Bereich konnte ein Fehler auftreten, der die Benutzer daran hinderte Inhalte, die als Popup dargestellt werden, zu speichern.\nRelease August 2015\nCSV Export\nIn den CSV Dateien, die für andere Platformen exportiert werden können, wird nun die Filialnummer und der Filialname abgebildet.\nBehobene Fehler\nNach dem Umbau der Administration im letzten Monat, war es im Content Editor nicht mehr möglich Inhalte zu speichern. Dies wurde nun behoben, indem die alten Funktionalitäten wiederhergestellt und das neue Aussehen beibehalten wurde.\nRelease Juli 2015\nLogging\nEs wurde ein Logging Bereich für den internen Gebrauch implementiert. Über diesen Bereich lassen sich nun auf alle geloggten Informationen zurück greifen.\nModernisierung der Administration\nHier wurde das Look and Feel modernisiert. Dieses neue Design erleichtert die Arbeitsprozesse. Außerdem wurde der Übersetzer von Google integriert um den Anspruch einer international gängigen Administration gerecht zu werden.\nDas neue Look&Feel der Webshop Administration.\nRelease Mai 2015\nKlarna Integration\nIm Webshop lässt sich \"Klarna\" nun als Zahlungsanbieter integrieren.\nKlarna ist ein schwedisches E-Commerce-Unternehmen, das Zahlungslösungen für Onlineshop-Betreiber anbietet.\nRelease April 2015\nPaypal API Integration\nDie Paypal API des Shops wurde angepasst. Paypal schreibt aktuell viele unserer Kunden an. Damit darauf reagiert werden kann und um das Shop System aktuell zu halten, wurde die PayPal API Schnittstelle eingebunden. Durch die Einbindung dieser Schnittstelle sollten vorallem auch die abgebrochenen Zahlungen an den Shop zurückgehen.\nBasisländer\nIm Shop wird nun zwischen zwischen Ländern der EU und sonstigen Ländern unterschieden. Länder innerhalb der EU werden nun intern als \"Basisländer\" angesehen. Durch diese Änderung können komplexere steuerrelevante Situationen im Programm besser gehandhabt werden.\nBeispiel hierfür: Eine Firma hat ihren Standort innerhalb der EU, vertreibt jedoch über einen Webshop Waren in andere Länder mit anderer Währung, Mehrwertsteuer, ect.\nRelease März 2015\nDem Händler wird nun die Möglichkeit gegeben, bei einem eingelösten Rabattgutschein in Kombination mit einer Retoure die Gutschrift besser zu kalkulieren, da der Rabattbetrag nun direkt beim Artikel angegeben wird.Hierbei wird der Gutscheinrabatt nicht wie bisher, als eigenständige Position, sondern  direkt beim Artikel dargestellt. Somit ist die Kalkulation transparenter als bisher.\nRelease Februar 2015\nAusweisung von Gutschein-Rabatten im Shop\nDem Händler wird nun die Möglichkeit gegeben, bei einem eingelösten Rabattgutschein in Kombination mit einer Retoure die Gutschrift besser zu kalkulieren, da der Rabattbetrag nun direkt beim Artikel angegeben wird.\nHierbei wird der Gutscheinrabatt nicht wie bisher, als eigenständige Position ausgewiesen, sondern direkt auf alle Artikelpositionen umgeschlagen. Im Falle einer Retoure ist es dem Händler damit einfacher möglich den gutzuschreibenden Betrag zu bestimmen.\nHinweis:\nDas Verfahren, wie Gutschein-Rabatte umgeschlagen und ausgewiesen werden, ist über eine Einstellung im Shop steuerbar. In der Standardeinstellung legt der Shop für Rabatt-Gutscheine eine extra Rabattposition an. Um das oben aufgeführte Verfahen zu verwenden, muss der Shop entsprechend umgestellt werden.\nRelease August 2014\nBehobene Fehler\nBilder von DdD Cowis backoffice im Format \"DB200\" und \"DB800\" wurden nicht korrekt angezeigt.\nWenn  Bilder über DdD Cowis backoffice eingepflegt werden, dann wurden diese im Shop erst nach erneutem Reload angezeigt.\nRelease November 2013\nMengeneinheit darstellbar\nDie \"Mengeneinheit\" (Stück, Meter...) eines Artikels ist im Shop auch verfügbar, um bspw. Meterware auch online verkaufen zu können.\nRelease September 2013\nSet in der virtuellen Umkleide speichern\nAls User möchte man, dass das letzte angesehene Set der virtuellen Ankleide gespeichert wird.\nJetzt besteht die Möglichkeit, sich ein Set zusammenzustellen und dieses bei Bedarf später bei erneutem Einloggen wieder ansehen zu können.\nRelease August 2013\nD\nie virtuelle Ankleide\nDie virtuelle Ankleide bietet dem User die Möglichkeit, Artikel aus dem Sortiment zu „sammeln“ und anschliessend in\neinem attraktiven Design (Nach Warengruppen) anzeigen zu lassen, um sich Kombinationen dieser Artikel anzeigen zu lassen. Damit kann der Kunde sein zukünftiges Outfit schon Live am Monitor erleben und muss nicht mehr warten, bis die Artikel geliefert worden sind.\nHierbei gibt es verschiedene Möglichkeiten:\nDirekt aus dem Artikel heraus über einen Button.\nÜber die Merkliste.\nÜber den regulären Warenkorb.\nDieses Tool soll als Entscheidungs- und somit als Einkaufshilfe für ihre Kunden dienen, damit diese sich besser vorstellen können,welche Kombination zu ihnen passt.\nAuch das Teilen von Outfits bei Facebook ist mit der virtuellen Umkleide möglich. So hat jeder Kunde die Möglichkeit, sein Lieblings-Outfit seinem Freundeskreis schon vor dem Kauf zu zeigen.",
    "category": "Cowis Webshop",
    "subcategory": "ddd-cowis-webshop",
    "source": "Cowis Knowledge Base",
    "url": "https://knowledge.cowis.net/content/44/179/de/updatebeschreibungen.html",
    "images": [
      "http://knowledge.cowis.net/images/knowledgebase_data/eShop_eigene_texte/eigene_shop.jpg",
      "http://knowledge.cowis.net/images/knowledgebase_data/neu_artikel_marked.png",
      "https://knowledge.cowis.net/images/knowledgebase_data/SET_Webdarstellung.jpg",
      "http://knowledge.cowis.net/images/knowledgebase_data/WebshopCharacterSelection.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/neu_artikel_sort.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/WebShopAdditionalTextBoxes_1.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/neu_artikel_selection.png",
      "http://knowledge.cowis.net/images/CompareArticlesShop1.png",
      "http://knowledge.cowis.net/images/CompareArticlesShop4.png",
      "http://knowledge.cowis.net/images/multi_filter_2.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/CreativeVouchers2.jpg",
      "http://knowledge.cowis.net/images/knowledgebase_data/CreativeVouchers3.png",
      "http://knowledge.cowis.net/images/ShopModernisation.png",
      "http://knowledge.cowis.net/images/multi_filter_1.png",
      "http://knowledge.cowis.net/images/CompareArticlesShop3.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/CreativeVouchers1.jpg",
      "http://knowledge.cowis.net/images/knowledgebase_data/e_shop_sortierung/sortier_group.jpg",
      "http://knowledge.cowis.net/images/knowledgebase_data/e_shop_sortierung/sortier_kategorie.jpg",
      "http://knowledge.cowis.net/images/CompareArticlesShop2.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/WebShopBackendTextAreaEditor.png",
      "http://knowledge.cowis.net/images/knowledgebase_data/WebshopCharacterSelection2.png",
      "https://knowledge.cowis.net/images/knowledgebase_data/eshop_virtuelleimkleide.jpg"
    ],
    "has_images": true,
    "image_count": 22,
    "created_at": null,
    "updated_at": null,
    "id": null,
    "tags": []
  },
  {
    "title": "Gutschein Objekt (Warengutschein) einrichten",
    "text": "Gutschein Objekt (Warengutschein) einrichten\nInhaltsverzeichnis\nOrt des Gutschein Objekt Managers\nNeuanlage\nAttributbeschreibung\nAktivierung\nLöschen\nBeispiel\nListenintegration\nMit dem Gutschein - Objekt - Manager erstellen sie sogenannte Warengutscheine. Diese Warengutscheine werden als Liste im Shop dargestellt und wie Artikel behandelt, obwohl sie kein Bestandteil der Warenwirtschaft sind.\nOrt des Gutschein Objekt Managers\nShop Administration > Gutscheine > Gutschein - Objekt - Manager\nAnlage eines neuen Gutschein - Objektes\nLegen sie einen neues Gutschein Objekt wie folgt an\nWechseln sie in den Bereich Gutscheine -> Gutschein - Objekt - Manager\nKlicken sie auf den Button \"Neuen Gutschein anlegen.Es erscheint eine neue Zeile in der Tabellen Listenansicht links neben dem Button \"Neuen Gutschein anlegen\".\nDurch Anklicken des Aktion - Icons () gelangen sie in die Attributverwaltung des neu erstellten Gutschein Objekts.\nAttribute und ihre Bedeutung\nAttributname\nBeschreibung des Attributs\nEinbindung in Template\nWert\nStandard\nBezeichnung\nGibt dem Gutschein Objekt eine Bezeichnung, die sowohl in der Administration als auch im Shop angezeigt wird.\n{BEZEICHNUNG}\nAlphanummerisch (Pflicht)\nWert\nDefiniert den Wert des Gutschein Objekts (z.B.: 22,50)\n{WERT}\nNummerisch (Pflicht)\nReduzierter Wert\nDefiniert den reduzierten Wert des Gutschein Objekts equivalent zu Artikeln mit Sonderpreis\nNummerisch (Optional)\nGewicht\nDefiniert das Gewicht des Gutschein Objekts. Da Waren Gutscheine in der Regel nicht mit Versandkosten belegt werden (sollten), kann dieses Feld freigelassen werden.\nNummerisch (Optional)\n0\nBeschreibung\nBeschreibt das Gutschein Objekt\n{BESCHREIBUNG}\nAlphanummerisch (Optional)\nMwSt\nDefiniert den MwSt Satz für das Gutschein Objekt. Im Regelfall wird ein Gutschein Objekt mit dem MwSt Satz \"Kein\" angelegt (Voll = Voller MwSt Satz, Halb = Reduzierter MwSt Satz)\nKein\nGrundmenge\nDie Grundmenge definiert, wieviele Objekte  automatisch in den Warenkorb gelegt werden). Sollte auf 1 gesetzt werden.\n1\nBestellmöglichkeit\nDefiniert, ob ein Gutschein Objekt verkauft werden kann oder nicht.\n{ORDER} (Alte tabellenbasierte Variante) oder {ORDERNEW} (Neue, div basierte Version)\nJ\nVersandfrei\nDefiniert, ob ein Gutschein Objekt Versandkosten generiert oder nicht, wenn es alleine im Warenkorb liegt.\nJ\nBild\nWeisen sie hier dem Gutschein Objekt ein Bild mittels des File Managers zu.Dieses Feld kann leer bleiben, sollte allerdings mit einem Bild hinterlegt werden.\n{IMAGE}\nBild Referenzierung (Optional)\nTemplate\nDefiniert, ob, bzw. welches Template für dieses Gutschein Objekt benutzt werden soll. Das Gutschein Objekt sollte mit einem Template hinterlegt sein, da es sonst nicht angezeigt wird.\nReferenzierung auf das Objekt Template\n(Optional)\nErlaubte Zahlarten\nDefiniert die Zahlarten, die erlaubt sind, wenn sich dieses Gutschein Objekt im Warenkorb befindet.\n(Optional)\nDruckgrafik\nWeisen sie hier diesem Objekt eine mögliche Druckgrafik zu. Mit dieser Grafik können sie Einfluss auf die dynamisch generierte PDF Datei nehmen, die über den Bereich Gutscheinliste erstellt werden kann.\nBild Referenzierung (Optional)\nAktivierung des Gutschein Objekts\nUm ein Gutschein Objekt im Shop anzeigen zu lassen, muss in der Objekt Liste die Checkbox \"Aktiv\" angehakt werden. Soll ein Objekt segmentgenau angezeigt werden, so setzen sie die Segment Nummer auf das Segment, in dem das Objekt angezeigt werden soll. (Alle) steht für alle Segmente.\nLöschen eines Gutschein Objekts\nDurch Anklicken des roten X im rechten Bereich der Liste kann nach Anklicken und Zustimmung des Löschvorgangs das Gutschein Objekt gelöscht werden. Es wird komplett entfernt.Der Vorgang kann nicht rückgängig gemacht werden.\nBeispiel eines Templates:\nDie Vorlage (Template) des Gutschein Objekts muss angelegt sein, um zugeordnet werden zu können. Der Speicherort für Gutschein Objekt Templates befindet sich unter Layout -> Templating -> Diverse Templates\nBeispiel eines Templates\n<div class=\"Object-Template\">\n<div class=\"Object-Name\"><h3>{BEZEICHNUNG}</h3></div>\n<div class=\"Object-Image\">{IMAGE}</div>\n<div class=\"Object-Name\">{BESCHREIBUNG}</div>\n<div class=\"Object-Value\">{WERT}</div>\n<div class=\"Object-Order\">{ORDERNEW}</div>\n</div>\nIntegration der Objekte via Liste\nUm die Gutschein Objekte im Shop darstellen zu können, gehen sie folgendermassen vor:\nErstellen sie eine neue Seite im Seitenmanagement, die für die Anzeige von Gutscheinen benötigt wird.\nSetzen sie diesen Platzhalter in den Content Bereich der Seite:{OBJEKTLISTE1}Typ=GV,Orientation=Diagonal{/OBJEKTLISTE1}\nSetzen sie die nötigen Einstellungen für die Seite (Navigationsgruppe, Aktiv etc.) und komplettieren den Kontent der Seite nach ihren Bedürfnissen.",
    "category": "Cowis Webshop",
    "subcategory": "gutscheinverwaltung",
    "source": "Cowis Knowledge Base",
    "url": "https://knowledge.cowis.net/content/17/15/de/gutschein-objekt-&lparwarengutschein&rpar-einrichten.html",
    "images": [
      "https://knowledge.cowis.net/images/cowis_eshop/administration/gutschein/001_gutschein_objekt_manager.PNG"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": null,
    "updated_at": null,
    "id": null,
    "tags": []
  }
]