[
  {
    "title": "Why is my POS  / Till slow?",
    "text": "Your Point of Sale might be slow because it's old (5 years is the normal expected lifespan of any computer before operating system updates etc slow it down). The operating system might need optimising - see help in the product-specific sections of this knowledgebase. Some customers install other software on their POS, including back office software, Microsoft Office, and many other applications. This can slow your POS down if the hardware was specified for only running a POS (most likely) i.e. it was not intended as a general purpose computer. K3 test the performance and functionality of their POS software on the hardware that we supply, but we do not test the impact of adding many unknown extra applications on it. We can help you by supplying a higher specification POS if you do need a POS which doubles as a general purpose machine. Also See What Hardware Can I Purchase from K3? How Long Can Hardware be Supported For?",
    "category": "Hardware Support",
    "subcategory": "Hardware FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-03-31T17:29:53+01:00",
    "updated_at": "2025-05-01T09:57:26+01:00",
    "id": 103000343231,
    "tags": []
  },
  {
    "title": "What Hardware Can I Purchase from K3?",
    "text": "The following brochure includes hardware which is optimised for most of K3's software solutions. Please contact your Customer Success Manager if you would like to discuss purchasing any of the hardware listed.",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103206960191/original/W9bFejr8EK86tnok-eA1X6b82qDXqiJ2Zw.png?1744627652"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2025-04-14T11:49:01+01:00",
    "updated_at": "2025-04-14T11:55:53+01:00",
    "id": 103000347002,
    "tags": []
  },
  {
    "title": "Hardware Support - What's Covered?",
    "text": "TABLE OF CONTENTS K3-Supplied Hardware in Year 1 If you have a K3 Hardware Support Contract If you do not have a K3 Hardware Support Contract (but K3 supplied the hardware) Post Year 1 Support (Hardware Support Contract Required) K3 Supplied Hardware Non-K3 Supplied Hardware When and How Will K3 Respond to Faults? Service Level Agreement Support Process What’s Not Covered K3-Supplied Hardware in Year 1 If you have a K3 Hardware Support Contract During the first year after K3 have supplied your POS/till, the full system is covered which includes: All-in-one POS units or PC based units Receipt printers Barcode scanners Cash drawers Monitors (if sold with PC base unit) Optional Add-ons you may have purchased: Ticket printers Label printers Tablets Standalone monitors/screens Hand Held Terminals (HHT’s) K3 Supplied Integrated Payment Terminals (purchased with an additional EFT package) Cover is for: Hardware Failures - Malfunctioning or failed items supplied by K3. Diagnosis and repair - Faults that occur through normal usage of the equipment. POS OS - POS Windows operating system issues which cause the POS to cease working. Associated Cable or PSU Failures - Issues with power supply units (PSUs) or data cables originally supplied with covered items. Remote or On-Site Attendance as required for repair or replacement of faulty hardware. Depending on the criticality, we may ask you to ship items to us for repair. If you do not have a K3 Hardware Support Contract (but K3 supplied the hardware) If you do not have a K3 hardware support contract, you will be covered under the manufacturer's warranty only. Items will be handled via the suppliers standard RTB (return to base) warranty policy which K3 will facilitate. Note that our assistance will not be governed by a Service Level Agreement. Any shipping or initial inspection costs incurred by K3 will be passed on to the customer. The manufacturer's warranty may be longer than one year, but if you do not have a support contract with us, you will need to work with the manufacturer direct (or ask for us to quote to help you). Post Year 1 Support (Hardware Support Contract Required) K3 Supplied Hardware For K3-supplied hardware, customers can opt to purchase an annual hardware support contract (if they haven't already from the date we supplied the hardware). If a spare part is required for a repair, and it's for standard hardware which K3 supplied, the cost of the spare part is included in the annual hardware support. We generally hold them in stock for quick remediation which includes new and refurbished parts. In the unlikely event that a whole replacement POS unit or other sealed unit such as a tablet is required (not just a spare part), then this would not be included free of charge (unless the manufacturer's warranty provides for a free new complete unit). Note that if K3 supplied the hardware which is now more than a year old, but you do not have a hardware support contract with K3, then we may be able to help you, but it would not be governed by any SLA target times, and all time and materials would be chargeable at the standard rates. Non-K3 Supplied Hardware We can provide hardware support via a contract for customers who did not purchase their hardware from us. We will carry out a hardware audit before quoting and taking on support which will include recommendations, and terms bespoke for each customer. We will not purchase spares for your own hardware, but you may purchase spares which we will hold in stock, ready for any emergency repairs. Also See - How Long Can Hardware be Supported For? - Need Help, but Don't have a Hardware Support Contract? When and How Will K3 Respond to Faults? The following only applies to customers who have a hardware support contract in place. Service Level Agreement Customers with an annual hardware support contract will benefit from the target times as explained in the Standard Service Level Agreement (SLA). This SLA applies to the hardware and any faults with K3 software which you may be subscribing to. We will fix things remotely if possible, but if required to attend a site, we pride ourselves on usually being able to attend either the same, or next business day (depending on location and time of the fault being raised to us). Standard Hours of coverage are weekdays (excluding UK Public Holidays) by default, but there are options to purchase weekend and Public Holiday cover as well, as explained in What days and times is Support available? In addition, there is an option for having a Premium Service Level Agreement (SLA) - see What are the Benefits of the Premium SLA? for more information. Support Process We have multiple channels for you to gain access to support - see How do I contact K3 Retail Support? Once a support ticket is identified as a hardware-related issue, our first line support team will pass it to the hardware support team. Once the hardware technician confirms that the customer and hardware is eligible for hardware support, the technician will performs an initial diagnosis of the problem through a phone call or remote session. Basic checks include: POS units - Is there power to the unit? Can it reboot? Are any error messages displayed on the screen? Receipt printers - Can it print a self-test with legible text? Barcode scanners - Can it scan a barcode in Notepad? Cash drawers - Does it open correctly? If necessary, the technician will arrange an on-site visit at a mutually convenient time to investigate and rectify the issue. For issues which don't require a specialist engineer on site, we may ship replacement items to you and provide you with instructions and remote assistance to install them. What’s Not Covered Regardless of how old the hardware is, the following are not included in the hardware purchase price or support fees: Deliberate or Accidental Damage - Hardware damage caused intentionally or due to mishandling or accidents. This includes cosmetic damage which is not covered. Environmental Changes - Damage resulting from environmental factors such as water, heat, electrical, or other external conditions outside of our control. 3rd Party Changes - Any modifications, non-approved software installations, changes to the operating system or amendments by the customer, third-party services or vendors. 3rd Party Software - Any software not owned by K3 (e.g. the Windows operating system, antivirus), and updates to 3rd party software. Item Relocation - Moving or relocating hardware to a different location without consulting with K3 or K3's involvement. Consumables like printer toner, print heads, accessories, parts intended by the equipment manufacturer to require periodic replacement. Additional Hardware – Hardware not supplied by K3, or if you are using your own hardware, if it was not in the support contract audit. Data Restoration - if data is lost as a result of a hardware failure (e.g. a hard drive), we will rebuild the software, but cannot recover the software's data. If you have a backup and need help restoring it, we may be able to assist (time would be chargeable) Items Beyond Economic Repair - Any hardware where the cost of the required part(s) to make the hardware properly functional will exceed the current list or new replacement price, and/or any required spare parts or components are no longer available from the manufacturer.",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-11-07T16:43:44+00:00",
    "updated_at": "2025-04-14T11:55:17+01:00",
    "id": 103000319884,
    "tags": []
  },
  {
    "title": "How Long Can Hardware be Supported For?",
    "text": "Peace of Mind for Five Years or More With an annual hardware support contract from K3, you have the peace of mind of knowing that any faults included in the agreement will be supported until the hardware is five years old. Once the hardware is more than five years old, we may still be able to offer support, but the cost of available spare parts would not be included. To provide lightening fast support, we hold spare parts for standard K3-supplied hardware, and we can also hold spare parts that customers purchase and ask us to manage for them. The availability of spare parts is one of the factors which limit the support of hardware to five years, but occasionally suppliers will end support and availability early, in which case we will advise you if spare parts are no longer available, even if your hardware is less than five years old. Recycling Hardware When equipment is surplus to requirements or at the end of its “usable” life, it can be donated or recycled. For a minimal fee, we can handle this for you. You may want to shred hard drives to be certain that data is secure which is a service we can also provide. What if You Don't have a Hardware Support Contract with K3? If you purchased the hardware from us, the manufacturer's warranty will apply - please see If you do not have a K3 Hardware Support Contract (but K3 supplied the hardware) for more information, or see Need Help, but Don't have a Hardware Support Contract?",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-12-10T15:57:02+00:00",
    "updated_at": "2025-04-14T11:55:14+01:00",
    "id": 103000323844,
    "tags": []
  },
  {
    "title": "Need Help, but Don't have a Hardware Support Contract?",
    "text": "If you purchased hardware from us, the manufacturer's warranty will apply - please see If you do not have a K3 Hardware Support Contract (but K3 supplied the hardware). We can still help you if you don't have a hardware support contract, but it will not be governed by a Service Level Agreement (which means that response and resolution times can't be given, one-off costs will be higher, and customers with support contracts will take priority). Once we receive your request, we will create a quotation and send to you for signature. One-off support is offered on a Time and Materials (T&M) basis, and reasonable efforts will be made to resolve the issue in a timely manner. If hardware needs to be purchased or a slot booked with the technician, this will impact the resolution time. Customers will be billed for all time spent on an order/request, including any travel time, and all expenses including mileage, and any subsistence and accommodation costs. Please ask us if you would be interested in having a hardware support contract with all the benefits outlined in Hardware Support - What's Covered?",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-12-10T16:13:25+00:00",
    "updated_at": "2025-04-14T11:55:14+01:00",
    "id": 103000323859,
    "tags": []
  },
  {
    "title": "What version of Windows does my POS run on?",
    "text": "TABLE OF CONTENTS Introduction Windows 10 IoT Enterprise LTSC Windows 7 Pro and Embedded POSReady 7 Windows XP Windows 8 and 8.1 End of Life Windows versions Introduction This article refers to the Windows version running on your Point Of Sale / Till. These versions are usually different to the ones running on a normal desktop PC / Laptop. For more information on what's supported for non-POS K3 software, please search this knowledgebase (e.g. What Operating Systems is the MStore Back Office Supported On?) Windows 10 IoT Enterprise LTSC Microsoft Windows 10 LTSC has several versions but most customers will be running either 2019 or 2021 2019 has an extended end of life date of 9th Jan 2029, version 2021 has an extended end of life date of 13th Jane 2032 so if you are running one of these versions you do not need to take any immediate action. If you have provided your own POS, it might be running on Microsoft Windows 10 Home or Pro which are usually found on desktop PCs and laptops, and will reach their end of life support on 14th October 2025 https://learn.microsoft.com/en-us/lifecycle/products/windows-10-home-and-pro If you believe your system is running a Win 10 Pro or Home edition please contact your internal IT department and reach out to your CSM team member at K3 to discuss upgrade options. Windows 7 Pro and Embedded POSReady 7 Microsoft Windows 7 extended end of life support ended on 14th Jan 2020 Microsoft Windows Embedded POSReady 7 extended end of life ended on 12th October 2021 What to do next - if you believe your system is still running one of these versions please contact your internal IT Department and reach out to your CSM team member at K3 to discuss upgrade options Windows XP Microsoft Windows XP extended end of life support ended on 8th April 2014 What to do next - if you believe your system is still running one of these versions please contact your internal IT Department and reach out to your CSM team member at K3 to discuss upgrade options Windows 8 and 8.1 Microsoft Windows 8 and 8.1 extended end of life support ended on 12th Jan 2016 and 10th Jan 2023 respectively. What to do next - if you believe your system is still running one of these versions please contact your internal IT Department and reach out to your CSM team member at K3 to discuss upgrade options End of Life Windows versions A recent review has highlighted that a large proportion of customers are still using outdated operating systems (Windows XP, Windows 7, and Windows 7 Embedded) on their POS units which poses significant security risks and operational challenges to their businesses. Here are some key points and recommendations: Security Risks Outdated operating systems, such as Windows XP and Windows 7, no longer receive critical security updates from Microsoft. This makes POS units running these systems vulnerable to malware, hackers, and ransomware attacks. The lack of security updates increases the likelihood of data breaches and compromises sensitive customer information breaking GDPR policy. Be aware of the risks associated with using unsupported operating systems and the importance of keeping both hardware and software up to date to avoid potential security threats and the financial impact of data breaches. Hardware Issues Older POS units are likely to experience more hardware issues, reduced reliability, and slower performance compared to newer units. Upgrading to modern POS hardware with the latest operating system can improve system reliability, speed, and overall performance. Recommendations Upgrade POS operating systems to a more secure and supported operating system will ensure that you receive regular security updates to protect against emerging threats. Older hardware may not be powerful enough to have an OS upgrade. Upgrade hardware to newer POS models that are compatible with modern operating systems. Newer hardware is more reliable, faster, and better equipped to handle the demands of modern point-of-sale. Implement security best practices, in the short term, while upgrading is being planned, ensure you are following security best practices. This may include using our antivirus software, regularly backing up data, and implementing network security measures. Timeline for Upgrades Discuss and plan a timeline for upgrading your POS systems with your CSM. By addressing these issues and implementing a proactive approach to system upgrades, you can help mitigate security risks, enhance system performance, and ensure the business continuity and long-term sustainability of your POS units.",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-01-09T17:38:55+00:00",
    "updated_at": "2025-04-14T11:55:14+01:00",
    "id": 103000328259,
    "tags": []
  },
  {
    "title": "Yomani EFT terminal ATOS Wordline supportstop per 2026 or 2027",
    "text": "Please be aware that from then end of 2027 in The Netherlands (and the end of 2026 in some other countries), Atos Worldline will stop supporting the EFT terminal YOMANI (and maybe also YOXIMO) But this does not mean that the machines can no longer be used for card payments after that time. Only then there is no more support available if there are questions. A replacement for the Yomani is currently being tested with our software (Q2 2025)",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103187469117/original/Yx-smGrLzaLdvnVCYSw10q_1hdrd6qPoIQ.png?1738852981",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103187468796/original/WVjzxPZ1_JDS5NHrADf7U2u360GuuWsf6Q.png?1738852953"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2025-02-06T14:44:32+00:00",
    "updated_at": "2025-04-14T11:55:14+01:00",
    "id": 103000333783,
    "tags": []
  },
  {
    "title": "Why buy Hardware from K3 for Retail?",
    "text": "RMA (will help, even if don't have HW support contract) Imaging and keeping up to date Help to rollout",
    "category": "Hardware Support",
    "subcategory": "Hardware Support Options & Lifecycle",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-06-12T15:30:48+01:00",
    "updated_at": "2025-06-17T11:48:07+01:00",
    "id": 103000356212,
    "tags": []
  },
  {
    "title": "What can you hire or purchase from K3 for your stock take",
    "text": "We have several options available to support our customers with their stock taking needs. For MStore customers- we have 6\" Windows tablets with built-in 2D scanners available to rent by the day. These tablets are setup and configured in-house and shipped out to the customer a few days prior to them being required, the team will make a courtesy call to confirm the units have arrived safely and are powered on and connected to the sites Wi-Fi and pointing to the DB machine. Rentals can be arranged through our CSM Team. We have also just released a new 6.5\" Android tablet with built-in 2D scanner with pistol trigger option for ease of use when scanning. These devices are available to purchase from our CSM Team. For customers purchasing the Android tablets they have the added advantage of being able to use them for stock taking and membership scanning. For non MStore customers- we offer the BHT 9000 range of handheld terminals with built in scanners, these are rented out by the day, setup and configured in-house and shipped out to the customer a few days prior to being needed. The units are shipped with a download data cable for transferring stock count to the back office system. Rental can be arrange through our CSM Team.",
    "category": "Hardware Support",
    "subcategory": "Hardware Loans for Stock Taking",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103178218110/original/2QAJTLaf8Ac2gaeeME1BblkECTmK92Rpyg.png?1736336771",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103178218542/original/cpUdUcnXZbtj7CRYEWQ0knI7FNrUtxmi0Q.png?1736336811",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103178224313/original/9gm4pKlNS2rFFBXbDZxep55Uw2yD2s1ogg.png?1736337381"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2025-01-03T10:46:25+00:00",
    "updated_at": "2025-01-08T11:59:12+00:00",
    "id": 103000327481,
    "tags": []
  }
]