[
  {
    "title": "How to create a new ticket",
    "text": "TABLE OF CONTENTS How to Create a Ticket Information Required to Create a Ticket Requester Subject Site Name Description of Request Ticket Category Incident Service Request Change Request Sub-Category Impact and Urgency What Are They and Why? Impact Urgency Environment/Hardware Details Customer's Own Reference Number Product Name Product - Version Requestor's name How to Create a Ticket A ticket can be created by emailing support@k3btg.com as well as phoning for emergencies (see What is the phone number for Support?) To start the process of creating a ticket on the portal, simply click the Submit a Ticket button on the top right of the menu. This is the best option as explained in You're here, but why use the portal? Information Required to Create a Ticket Below is an explanation of each field you see on the portal. Not all fields are necessary, but the mandatory ones are marked with a red asterisk. . Remember, the more you help us by providing lots of information, the more we can help you. Requester The requestor is automatically populated with your email address. Please do not change this. You can add other people to be notified/copied on the ticket, but they must be a registered contact in our system (otherwise the email address is ignored/removed) Subject Subject should be a short meaningful summary of the request. Site Name Select from the list of sites/stores which we have on record for your company. If the location is not listed, then please select the last option \"zz Not Listed...\" and include the site name in the ticket Description box so that we can add that site, and update the ticket. When you submit your first ticket from the portal, the Site you use is set as your default. This means that each time you submit a ticket after this, your default Site will be automatically selected, but you can change the Site for that ticket by selecting from the dropdown list. Description of Request If the request is an Incident (something's not working as expected), please include a description of what the issue is with screenshots if applicable, upload any files, is it replicable (does it always happen, or just sometimes), and how this is impacting you/the company. If your request is for us to help you with something, deliver something, or a feature/configuration request, please provide as much information as you can. Ticket Category This is very important so we understand if you have a problem which needs fixing, or if you need help, or want something else from us. The Service Level Agreement (SLA) only Incidents which are K3's responsibility (K3 software or hardware fault if you have a contract for us to provide support), but we will do our best to respond to the other types within similar timescales as well. Incident Select this category if something's not working as expected. This might be a suspected software bug/fault, or hardware fault etc, but this can be defined in the Sub-category dropdown list. Service Request Select this category if you want us to help you with something or deliver something to you Change Request Select this category if you would like us to consider a change to our software (otherwise known as a Feature Request), or change your configuration (might be chargeable). Sub-Category The list of sub-categories will change depending on what Ticket Category you have selected. This helps us to understand the type of request and route/prioritise it correctly. Impact and Urgency What Are They and Why? The Impact and urgency are described below. They are used to calculate the priority of a ticket. Details on this can be seen in How quickly can I expect my ticket to be dealt with? Please do not be tempted to assign all tickets a High Impact (for Incidents only) and High Urgency unless you have a whole site unable to trade. Impact This dropdown list is only shown if the Ticket Category is \"Incident\" because an impact is only really felt when something doesn't work as expected. Urgency Urgency reflects how quickly this needs to be investigated/delivered. Environment/Hardware Details If your request pertains to hardware or the IIT environment/infrastructure which the hardware is in, please provide us details here to keep this information separate and clear for everyone. Customer's Own Reference Number If you have an IT system where you have logged an issue or request before logging it with us, you might want to put your IT system reference number in here to help you match them up. Product Name This is to tell us the name of the software, or perhaps \"Other\" if you have purchased something other than software from us (e.g. hardware only or hardware support). if you have only purchased one product from us , the Product Name will be pre-populated with that product. If you have purchased more than one, you will need to select which one from the dropdown list Product - Version If you know the version of the product (for non-cloud software only because cloud software is always on the latest version which we install), and it's relevant to the ticket, please let us know to speed up our investigation. Requestor's name If you are using your own email address to login to the portal, you do not need to enter anything here. If you are using a store/site generic email (or a manager's email, or any email address which is not just fir you), type your name in here so that you and us know who raised the ticket to avoid confusion if someone else reads the email etc",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031345548/original/34Y5ttBk6_UflKnMkUr9jz5_oOExgCkHjw.png?1687335896",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031511397/original/kxigzVg5wkNZU9e7AGZQ5OyGW0Gq2ryOXw.png?1687370903"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-06-21T09:25:03+01:00",
    "updated_at": "2024-04-25T09:26:08+01:00",
    "id": 103000134416,
    "tags": []
  },
  {
    "title": "What do I do if I am having problems using the portal, or questions about it?",
    "text": "If you are not able to create a ticket, and have looked at the FAQs here including How to create a new ticket , then please just email support@k3btg.com. If you are able to create a ticket, and have a question about the portal, please raise a Service Request with a sub-category of Question.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031607511/original/bgp1EXC5sOxP89KbxF2_dgGxrIOQJhe3kw.png?1687425486"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-06-22T10:18:18+01:00",
    "updated_at": "2023-06-22T10:18:18+01:00",
    "id": 103000135824,
    "tags": []
  },
  {
    "title": "How can you give us feedback and help us improve our support service",
    "text": "TABLE OF CONTENTS Feedback on Resolved Tickets I Clicked the Wrong Rating - How Can I Correct It? What Do K3 Do With the Feedback? Feedback on Knowledge Base articles There are two ways in which you can communicate directly to the Support team to help us improve, or tell us when we've done well :-) Feedback on Resolved Tickets When certain types of tickets are resolved, the email notifying you will ask you to complete a very quick satisfaction survey - just a few clicks unless you want to add a comment as well (which is very useful if you choose one of the \"Extremely\" ratings). Once you click on one of the above, you will be taken to a screen which looks like the below. As you hover your mouse over the dots under the extra two questions, you will see the possible ratings change (same options as for the main question). What Do K3 Do With the Feedback? The Support team have Customer Satisfaction (CSAT) targets which are personal and for the whole team. The whole K3 team have access to reports to review the CSAT ratings and trends so that they can react to them. Managers are automatically emailed if there are any \"Extremely Unsatisfied\" ratings, and regularly review any comments added by customers. Comments really help us take action in response to ratings, whether it be issues, or praising staff or teams for their excellent customer service. I Clicked the Wrong Rating - How Can I Correct It? If you click the wrong rating by mistake, and what to correct it after you've submitted it, just go into the ticket on the portal (you might need to set the filter on the right of the Tickets page to show your resolved tickets) You will see an option to \"Rate us again\" which will open the original ticket rating screen for you to select your choices again. Feedback on Knowledge Base articles Every knowledgebase article has the following at the bottom of it: If you click \"Yes\", then we will know that this is an article which is useful, so we will make sure that it is updated when necessary so it's kept in place for you and other customers in future. If you click \"No\", you will be shown the below so you can tell us what needs improving in the article (or maybe another article needs to be written by us)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031703017/original/moVIjgS7axj9Oro9mxuc2YNUJNYyh0GA1w.png?1687443202",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103154015030/original/2ovK0z-hBSfWqwtq44MyhUFxTyo0vVrwqw.png?1728493659",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103154015911/original/gEX6fbDML8i21eGg-O98tQPAsW93u4V0EA.png?1728494108",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103154015612/original/0n15e9gwCnhzAr0gBDc1YJonRWdvL7iUPA.png?1728493942",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031696667/original/FmQNPwqiLLiU-LQWntQ-YVLcHU6nGWLqBA.png?1687442017",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031697188/original/OJXN-5ovjFXnnbQAtjltQEw2tFynoW6yhg.png?1687442148"
    ],
    "has_images": true,
    "image_count": 6,
    "created_at": "2023-06-22T15:18:54+01:00",
    "updated_at": "2025-04-04T17:26:50+01:00",
    "id": 103000136334,
    "tags": []
  },
  {
    "title": "How to copy other people on a ticket (or remove them!)",
    "text": "If you would like to add colleagues to a ticket so that they can see updates, you can copy them on any emails you send, or you can add their email address to the ticket by simply clicking on the button shown below (when you're in a ticket on the portal). Click on the same \"Add People\" button to see a list of any other people already added to the ticket >> You can remove people from the copy list from this screen if you need to . Any emails you add do not need to be people registered on the portal",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103090131329/original/uZ4PgJAzBJPJMRngWCjMYp9VKJZXpoZ4GQ.png?1708595833"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2024-02-22T09:57:30+00:00",
    "updated_at": "2024-03-07T15:33:41+00:00",
    "id": 103000277917,
    "tags": []
  },
  {
    "title": "What Does \"Support on Stop\" Mean?",
    "text": "TABLE OF CONTENTS Why your support is limited and what to do next What is “Support on Stop”? ⚠️ Why might support be on stop? 1. Commercial Hold (Unpaid Invoices or Contract Issues) 2. Outdated Software Version ✅ How to restore full support Need help? Why your support is limited and what to do next Most ticket statuses should be self-explanatory, but if your ticket is set to \"Support On Stop\", what does it mean? To ensure we deliver fast, effective support for all customers, we operate a Support on Stop policy in specific (rare!) circumstances. This article explains what it means, the reasons it may be applied, and how to restore full support. What is “Support on Stop”? If your organisation is placed into Support on Stop, it means that some, or all tickets will be placed on hold until the issue is resolved. This means that the SLA timer will be paused. You’ll be notified via the Support Portal if your ticket is affected. ⚠️ Why might support be on stop? There are two main reasons your organisation may be placed into Support on Stop: 1. Commercial Hold (Unpaid Invoices or Contract Issues) If there are outstanding payments, expired agreements, or other commercial concerns relating to your contract, your organisation may also be placed into Support on Stop. K3's Finance team determine when a customer are put on hold for this reason, and when they are taken off hold. 2. Outdated Software Version For some on-premise (non-cloud) products, e.g. MStore, if the version you have is more than 12 months old, you will be placed on Support on Stop until your system is upgraded to a supported version. Priority 1 and 2 faults, and non-software related requests are still dealt with as normal Staying up to date ensures access to new features, improved stability, and quicker issue resolution. To schedule an upgrade, please raise a request via the Support Portal: Service Request → Software Delivery Request For MStore, you can see more in What versions of MStore are supported? ✅ How to restore full support To resume full support, the underlying reason for the hold must be resolved: For commercial holds: Settle outstanding invoices or resolve contract issues with your Customer Success Manager. For software version holds: Upgrade to a supported version of MStore. Once resolved, support for all ticket types will be reinstated. Need help? If you're unsure why your support has been limited, or you’d like help getting back on track, please contact your Customer Success Manager.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "FAQ",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-03-24T17:02:45+00:00",
    "updated_at": "2025-04-03T17:58:48+01:00",
    "id": 103000341339,
    "tags": []
  },
  {
    "title": "UK Customer Support Update 2025",
    "text": "We have reflected on the past year as well as looking forward to the new one. We have reviewed the customer satisfaction feedback many of you have provided (requested by email when we resolved tickets), and looked at our support system statistics after its first full calendar year in operation. Here are our key achievements and what we are going to change in response to your feedback which includes faster resolution targets and more phone access to the Support team. For MStore customers, there's more good news in MStore Support Update January 2025. Fast Resolution During 2024, we resolved Incidents (faults/issues) 79% faster on average than the Service Level Agreement (SLA) targets. The full results can be seen on UK Support Stats for 2024. We have therefore decided to: Upgrade (free of charge) the Incident Resolution SLA We will aim to provide an even faster service as shown below. Phone Calls To and From Support We’ve had feedback that some customers feel that Support do not use the phone as a channel to help customers. During 2024 we: Answered 1,347 phone calls which lasted 9 minutes, 31 seconds on average for new issues being raised. Made 3,306 calls out to customers, lasting an average 6 minutes, 2 seconds. If we feel that the best way of resolving a ticket is by talking to you, we will! During the year we have consistently requested that customers to only phone us for situations where a location is unable to trade (i.e. a Priority 1 fault). This keeps the phone lines free for such emergencies for all of our customers. We have also integrated our support system with Microsoft Teams during the last year, which also means that any P1s raised directly by you via the portal are instantly messaged to the entire UK support team, so the portal is now just as fast as the phone and can enable you to provide better quality information about your issue (e.g. screenshots, error messages, etc), and reaches a wider Support audience immediately. Based on your feedback we have decided to now accept phones calls to Support for both P1 and P2 issues for customers on the Standard SLA agreement, and P1, P2 and P3 issues for customers with a Premium SLA agreement. We are adding more people to the phone lines to manage this, but the choice is now yours – the portal may still be better to send us detailed information, and see what may be already available to help you within the knowledge base articles. We hope that these improvements will help you in your daily use of our systems and services, and encourage you to provide feedback on support tickets as often as you can to help us to continue to make further improvements in how we support you in 2025 and beyond. Note that Extended Hours support remains for P1s for (contracted customers) only",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Support Updates",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103182461381/original/H2-RRN_w09Xw4U33C51lMbT0-s0HJQ4HyQ.PNG?1737533734"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2025-01-22T07:55:51+00:00",
    "updated_at": "2025-02-10T13:09:57+00:00",
    "id": 103000330314,
    "tags": []
  },
  {
    "title": "MStore Support Update January 2025",
    "text": "In addition to the UK Customer Support Update 2025, MStore customers also have the following updates: Free Annual Upgrade The software for upgrades is always provided free of charge (to customers paying for support and maintenance). Historically, we have not charged the time and effort to implement upgrades if the upgrade is to fix a fault, and if the upgrade is undertaken in normal business hours. For 2025 we are introducing that every customer can have the one free of charge upgrade per year (during normal business hours). This will enable you to take advantage of all the latest features that have been developed and will keep your system up to date. Upgrades during normal hours to fix significant faults will continue to remain free of charge. IF your current version of MStore is more than 12 months old, we would encourage you to request an upgrade because older versions cannot be supported to the same level as current versions. A full explanation can be found in What versions of MStore are supported? User Guides Updated and Searchable! We have been working hard to update our user guides, as well as provide regular recorded Webinars to help our customers get the best out of the extensive feature-set which MStore provides. In February, we will be replacing the current k3btg.training website with full product user guides maintained by the product development team in the Freshdesk support system This means that you’ll be able to search the guides for information and, when raising a support ticket, the AI in our Support system will search the guides for you to find potential resolutions or answers to your questions – all in one place. We hope that these improvements will help you in your daily use of MStore and encourage you to provide feedback on support tickets as often as you can to help us to continue to make further improvements in how we service and support you in 2025 and beyond.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Support Updates",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-01-22T07:56:18+00:00",
    "updated_at": "2025-01-27T08:45:57+00:00",
    "id": 103000330316,
    "tags": []
  },
  {
    "title": "UK Support Stats for 2024",
    "text": "As described in UK Customer Support Update 2025, we reviewed our Service Level Agreement (SLA) targets and achievements which are shown below for customers to see. This below shows how much quicker on average we solve K3 faults which has resulted in some changes to the SLA as described on UK Customer Support Update January 2025.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Support Updates",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103182718430/original/AWc0GYVvAJeZcY-DxxxLYaKhTXutBdZy6A.png?1737558957",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103182733333/original/zGf0lI2IjX0blro4z54SWjK7khFfHvPrhw.png?1737560554"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2025-01-22T07:59:49+00:00",
    "updated_at": "2025-02-10T13:10:22+00:00",
    "id": 103000330317,
    "tags": []
  },
  {
    "title": "K3's Support Service and How To Get the Most Out Of It",
    "text": "K3 Support Brochure",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103137528685/original/pwPOfGMyOpdPdmUyf9me80n3z0Zdq-adpQ.jpg?1723476999",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103137528706/original/IBugZY4J6MxQC9ODGuDsZmIJBMBZUiCkNw.jpg?1723477006",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103137528934/original/Ea-qwhyqFO1Sfx0NxzqQraYqJDj0-mCyiQ.jpg?1723477052",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103137529015/original/648AmtAM9knbekuq0eudfQrSC89c_DRJBQ.jpg?1723477064"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2024-08-12T16:37:15+01:00",
    "updated_at": "2024-09-04T11:33:18+01:00",
    "id": 103000307826,
    "tags": []
  },
  {
    "title": "What will the Support team help me with?",
    "text": "What's Included in the Support Agreement? Omnichannel access into Support (phone for system down, email, portal) Fixes and workarounds for faults in K3 software Parts replaced for K3 supported hardware (see Hardware Support - What's Covered?) Unlimited how-to self-help via the support portal Limited how-to help via a ticket (max 15 minutes per query) Software upgrades if on a SaaS platform New modules may be separately chargeable Minor technical configuration change requests during normal working hours (max 15 minutes) if we host your (non-SaaS) solution (e.g. a change of IP address). If we commence a minor change which takes more than the expected maximum of 15 minutes, then we will request your written approval for chargeable work before continuing What’s Not Included Faults caused by environmental factors such as customer network, up/downstream integrated services/apps, user error/damage, bad data Maintenance of your database performance (and backups) if it's not hosted or managed by K3 (we have a K3 MStore Database Optimisation and Maintenance Plan available for us to remotely manage your database performance if you need help) Help with how to use or configure our software (unless a how-to question takes less than 15 minutes, or a minor technical change to a solution we host for you) Customer-specific customisations (unless by separate agreement) For anything which is not included we may still be able to help you, so please ask for a quote for the work. The principle is that if K3's software enables a customer to do something for themselves, but you would like K3 to help/do it for you, this activity would be chargeable More Detail If you would like more detail on what's included, please see the Standard Service Level Agreement (SLA) or Premium Service Level Agreement (SLA) as applicable.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103038067081/original/PRzaVgTfhLYyWyvEMugIf_sT6ByiakQoiQ.png?1689951559"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-07-21T16:04:36+01:00",
    "updated_at": "2025-05-22T18:29:29+01:00",
    "id": 103000166739,
    "tags": []
  },
  {
    "title": "How quickly can I expect my ticket to be dealt with?",
    "text": "TABLE OF CONTENTS Ticket Type Impact and Urgency Priority Assigned Target Times When Will We Work On Your Ticket? Full Service Level Agreements Ticket Type We will take into account the type of request, the urgency, and the impact (if it's a fault). We prioritise Incidents (which means something's not working as expected) over other requests for how-to do something or changes you'd like. Impact and Urgency Once the Impact and Urgency has been determined (note that only Urgency is required for non-incidents), the priority is calculated. Note that High Impact and High Urgency (which calculates to a Priority 1 Incident) are reserved for the rare situations when trading is not possible at a whole site (which may be a shop. café, website). The impact and urgency may change over time, and the K3 Support team may change the Impact and Urgency according to their evaluation. Priority Assigned Once the ticket has been registered, the Priority will be calculated and made visible on the list of tickets you can see on the portal. Note that the highest priority which a Service Request or Change Request can be assigned is a P3. Target Times The times below are targets (not a guarantee), but we try to meet these times where possible, and beat the targets in the majority of cases. Note that a Recovery is where we provide a workaround while a permanent solution is being worked on. Note that the SLA timer will be paused when we are waiting for the customer to provide more information, and outside of business hours. When Will We Work On Your Ticket? We work on tickets of all priorities during normal business hours, and if out of hours extended support has been purchased, we will work on P1 (and P2 for Premium SLA customers) during extended hours as well - see What days and times is Support available? We work on tickets according to their priority and target dates as shown above. Full Service Level Agreements For full SLA details, please refer to your contract with K3 and to our Standard Service Level Agreement (SLA) or Premium Service Level Agreement (SLA) as applicable. Please contact your Customer Success Manager if you would like to explore upgrading to the Premium SLA.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103025854963/original/OqSoQa4u-TqwroAaz_UKtaNhIb20SVG7BA.png?1684948896",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103025855055/original/mWl7NRoj8E7lHBx8oAoPDx8DNmto06s7rw.png?1684948967",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103092148354/original/cx6mg9pAqoZ5ee7SXp7ZnokinWoGDtnDoA.png?1709207887"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2023-05-23T17:26:35+01:00",
    "updated_at": "2024-12-06T15:35:11+00:00",
    "id": 103000121712,
    "tags": []
  },
  {
    "title": "Standard Service Level Agreement (SLA)",
    "text": "K3 Standard Service Level Agreement (SLA) TABLE OF CONTENTS Introduction Support Organisation Overview Ticket Priorities and Definitions Ticket Classification Impact and Urgency Priority SLA Target Times Support Service Hours Standard Hours Extended Hours Accessing Support Services Support Portal Support Hotline Support Email Ticket Communication Escalation Process Definitions and Terms Introduction This Service Level Agreement (SLA) provides additional information and guidance on the K3 Support Service. This Standard SLA aims to help customers understand what to expect from K3’s Support Services, how to get the best out of the service, and the options available to provide the level of cover you require. A Premium SLA is also available - details can be provided on request and found on the Support Portal. This guidance is only relevant for Customers who have a current license or right to use the applicable K3 products, and who have a current applicable Support Service included as part of their agreement. Support Organisation Overview K3’s Service Desk provides Support Services which K3 delivers from multiple locations using global industry standard ITIL® best practices. The Support Team management is ITIL® qualified and reports to the Director of Global Operations. At any one time, there is always one Support Manager responsible for managing major incidents, and dealing with any customer escalations. Support Team members have goals to achieve which include exceeding the targets set out in this document, and also provide high levels of customer satisfaction which is measured from customer feedback upon resolution. Tickets are responded to by K3’s Customer Support Team who will investigate and resolve Incidents, involving more than one person within the Customer Support Team if necessary. If a deeper level of technical expertise is required, Incidents will be escalated to the appropriate K3 team (e.g. software development or hardware team) and worked on as required to seek to bring about a timely resolution where an Incident is confirmed. Ticket Priorities and Definitions Ticket Classification A ticket is classified into three possible categories: Incident Something is not working as expected Service Request You need help or want us to deliver something Change Request You would like us to change configuration or the product This ensures that K3 and customers understand why a ticket’s been raised, and helps prioritise how they are dealt with. Impact and Urgency Tickets are assigned an Impact and Urgency which is used to calculate the priority. Impact is a measure of the effect of an Incident. Urgency is a measure of how long it will be until an Incident has a significant business impact. The definitions of levels of Impact and Urgency are in the table below: Rating Impact Urgency Low Superficial and does not materially impact functionality. A solution can be scheduled for when is mutually convenient. Medium Impacts functionality, but continued system use is possible. Needs to be addressed soon to prevent any further deterioration. High Affects the majority of users and/or prevents use of an entire system. Requires immediate attention. Priority The following table defines the priority levels applied to all tickets which is calculated from the Impact and Urgency. Tickets which are not Incidents (examples include an enquiry on how to do something, or an enhancement request) will be assigned a Priority according to their Urgency only i.e. a Priority of P3, P4, or P5 for Urgency of High, Medium, or Low respectively. The priority of an Incident may change throughout its duration. For example, a Priority 2 Incident may be upgraded to Priority 1 if an Incident affecting some users spreads to all users; or a Priority 1 Incident could be downgraded to Priority 2 if a Workaround is provided in advance of a permanent fix. Urgency Impact Low Medium High Low P5 P4 P3 Medium P4 P3 P2 High P3 P2 P1 The circumstances of an Incident determine its Impact or Urgency. An example is where a store has four Point of Sale (POS) solutions, and one develops a fault which renders it inoperable (hardware or software): During a quiet period when customer numbers are low, this might have an Impact of “Medium” and an Urgency of “Medium” (resulting in a Priority of “P3”). If the same Incident were to occur in a very busy period, the Impact would still be “Medium” (because other POS solutions are operable), but the Urgency may be “High” (resulting in a Priority of “P2”). In the extremely unlikely event that all POS solutions were inoperable in a location, this would be a High Impact and High Urgency Incident, resulting in a Priority of “P1”. Note that a “location” does not necessarily mean everything at a site/store – please see examples below: A P1 could be for a significant area such as a café is not able to trade, even if the shop in another building at the same site is able to trade. If online trading which K3 hosts is not functioning, but trading in a physical store is working, then the website is still a location that cannot trade i.e. a P1 situation. SLA Target Times The table below provides the Target Response and Target Resolution Times for Incidents which are calculated during Business Days. If K3 requires the Customer to provide further information or assistance in relation to an Incident, then the Target Resolution Time in the table below will be extended by the amount of time taken by the Customer to provide the information or assistance. Priority Target First Response Time Target Recovery Time Target Resolution Time P1 1 Hour 1 Business Day 1.5 Business Days P2 4 Hours 3 Business Days 7 Business Days P3 8 Hours 10 Business Days 2 Months P4 18 Hours 1 Month 4 Months P5 36 Hours Not Applicable 6 Months If applicable, the Support Team will endeavour to provide a Workaround which K3 may deem as a sufficient resolution that a permanent fix is not required. Note that the Target Recovery Time and the Target Resolution Time shall not apply to any Incident which is determined not to be a Product Fault, and K3 reserves the right to charge the Customer for any time spent by K3’s Support Team investigating any non-Product Faults (e.g. faults caused by the Customer or Customer’s infrastructure). The service levels listed above are targets only, and do not constitute a guaranteed service level. Any failure by K3 to meet these targets shall not, of itself, constitute a breach of contract or a default on the part of K3. Support Service Hours Standard Hours Standard Hours are weekdays, excluding Public Holidays in the Customer’s country, during the local hours of the K3 Service Desk as displayed on the k3btg.com Support web page (together defined as “Business Days”). Incidents will be worked on during Business Days and additionally, Customers may log Tickets 24x7 by emailing K3 Support or using the K3 Support Portal. Extended Hours Three Extended Hours options are available for additional fees for K3 to provide support for Priority 1 Incidents only as follows (either one or multiple options may be purchased): Weekday Evenings (excl. Public holidays) Saturdays Sundays and Public Holidays (excludes 25th December when we are closed) The hours included in each option vary by country as defined on the k3btg.com Support web page. Any purchased option will be deemed part of a “Business Day” (for the purposes of the Service Desk provision) for Priority 1 Incidents only. * Extended Hours options are not available for some legacy products. Accessing Support Services All Tickets must be investigated through the Customer’s internal support tiers prior to being referred to K3. This is to avoid raising issues with K3 which are not related to K3’s software and services which will delay resolution of the issue for the reporting user. Support Portal The Support Portal website address is https://support.k3btg.com. It is the best choice for Customers to access Support Services because it provides information which may solve the query automatically, and if not, it enables the Support Team to respond and help Customers more quickly due to the structured information about the Ticket which is captured via the Support Portal. In the unlikely event that a whole site is unable to trade (i.e. a Priority 1 Incident), then Customers can either phone the hotline, or raise a Ticket on the Support Portal. Any P1s raised by the portal are automatically notified to all support team members via an integration with K3’s internal chat platform (Microsoft Teams) , so this method is just as fast as making a phone call, and may be the better method if you need to pass lots of information that is difficult to do over the phone (e.g. screenshots). Creating a Ticket via the Support Portal also facilitates efficient follow-up communications such as Support providing updates, and Customers providing further information if requested. Customers can self-register for the portal, and once we have performed verification checks, they will be able to see and do more than via email or phone (see You're here, but why use the portal?), and upon request, customers can see all tickets for their company as well as just their own. Support Hotline For Priority 1 and Priority 2 Incidents, Customers may call the applicable local Support Hotline during Standard Hours (Priority 1 only during Extended Hours, if purchased). Lower priority Incidents, and non-Incidents (requests for help, change requests) must be registered via the Support Portal or email, not via the Hotline. Support may phone the Customer at a later point to explain something or discuss an issue if it’s likely to be the most efficient way to resolve an Incident. Type Contact Danish & Swedish Support Hotline +45 7011 9100 Dutch Support Hotline +31 157 99 78 00 English Support Hotline (except for the below) +44 161 524 6793 English Support Hotline for SmartVision, Omnis, Sigma, JobBOSS +44 190 493 5732 German Support Hotline +49 7344 166 3100 Norwegian Support Hotline +47 3399 8150 Support Email The K3 Support email address is support@k3btg.com. Tickets raised by email default to a category of Service Request, and Priority 4, but once reviewed by a Support Team member, the Category, Impact, and Urgency will be updated in accordance with our understanding of the email content. Unlike tickets raised on the Support Portal which can be automatically prioritised and managed as applicable, this cannot happen automatically with tickets from email until they have been reviewed. Therefore, High Impact and Urgency Incidents should never be reported this way to avoid delays in the Incident being investigated. Ticket Communication Every Ticket raised will be assigned a unique reference number which is provided to the Customer on the Support Portal and via email to enable the Customer and K3 Support to follow up on Tickets efficiently where necessary. If the first contact from a Customer for a Priority 1 or Priority 2 Incident is via calling the Support Hotline, Support will register the details on the Support Portal to track details, notify the Customer of updates, and to maintain a full report of all Tickets raised by each Customer. Ticket updates, status, and target dates are available to view on the portal, and most updates are also emailed to the Customer. The Support Team may phone the Customer if it is determined to be the most efficient and effective way to provide an update or investigate an Incident further. K3’s Support Team will endeavour to communicate in the primary language of the Customer’s country, but to enable the maximum amount of K3’s expertise to be used to solve an Incident, K3’s Support Team may communicate in English even if the first contact was not in English. Escalation Process We are committed to delivering high quality support to all our Customers. In the unlikely event that a Customer has worked through K3’s support processes and is not satisfied with the service received, Customers can escalate the Support Ticket by requesting that a Support Manager is notified or by contacting their K3 Customer Success Manager. Please provide the Ticket number and reason for the escalation. The escalation request will be evaluated by a Support Manager on a number of factors including the Ticket category, and if the Ticket has not met any of the relevant target times in this SLA. Definitions and Terms Please note the following terms and definitions that are used in this document. Term Definition Incident A type of Ticket which is a Product Fault causing an unplanned interruption to the Service or reduction in the quality of the Service. Product Fault Any error, bug, or defect with K3’s software, hardware, or hosting services (excluding any error, bug, or defect contained within any customer specific configuration or infrastructure). Support Services The provision by K3 of a remote support service to enable the Customer to report and K3 to investigate Product Faults in the applicable supported K3 product. Target Recovery Time The time from the Customer successfully registering an Incident with K3 Support to the time that K3 Support provides a Workaround which reduces the impact of an Incident. Target Resolution Time The time from the Customer successfully registering a Ticket with K3 Support to the time that K3 Support provides (i) a Workaround which K3 deems as a sufficient resolution that a permanent fix is not required, (ii) a permanent fix if no Workaround is possible, or if the Workaround cannot remain in place long-term. Target Response Time The time from the Customer successfully registering an Incident with K3 Support to the time that K3 Support first provides a (non-automated) response. Ticket A record of every request made by the Customer to K3 for Support Services. Workaround A temporary solution for an Incident to minimise the business impact while waiting for a permanent fix. As technology, products, and processes evolve, it may be necessary for K3 to amend, update, or supplement this guidance. This document may therefore be amended, updated, or supplemented from time to time by K3, at its discretion.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103002972607/original/D1t86tF639npJV3UFAFIc9rE-PslcENX7g.jpeg?1667471986"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2022-11-03T10:25:39+00:00",
    "updated_at": "2025-03-05T08:41:24+00:00",
    "id": 103000022571,
    "tags": []
  },
  {
    "title": "Premium Service Level Agreement (SLA)",
    "text": "K3 Premium Service Level Agreement (SLA) TABLE OF CONTENTS Introduction Support Organisation Overview Ticket Priorities and Definitions Ticket Classification Impact and Urgency Priority Support Service Hours Standard Hours Extended Hours Accessing Support Services Support Portal Support Hotline Support Email Ticket Communication Service Management Quarterly Reviews Escalation Process Appendix: Definitions and Terms Introduction This document provides additional information and guidance on the K3 Support Service. This guidance is only relevant for Customers who have purchased the K3 Premium SLA option. For a comparison of the Standard and Premium SLAs, please see What are the differences between the Standard and Premium SLA? Support Organisation Overview K3’s Service Desk provides Support Services which K3 delivers from multiple locations using global industry standard ITIL® best practices. The Support Team management is ITIL® qualified and reports to the Director of Global Operations. At any one time, there is always one Support Manager responsible for managing major incidents, and dealing with any customer escalations. Support Team members have goals to achieve which include exceeding the targets set out in this document, and also provide high levels of customer satisfaction which is measured from customer feedback upon resolution. Tickets are responded to by K3’s Customer Support Team who will investigate and resolve Incidents, involving more than one person within the Customer Support Team if necessary. If a deeper level of technical expertise is required, Incidents will be escalated to the appropriate K3 team (e.g. software development or hardware team) and worked on as required to seek to bring about a timely resolution where an Incident is confirmed. Ticket Priorities and Definitions Ticket Classification A ticket is classified into three possible categories: Incident Something is not working as expected Service Request You need help or want us to deliver something Change Request You would like us to change configuration or the product This ensures that K3 and customers understand why a ticket’s been raised, and helps prioritise how they are dealt with. Impact and Urgency Tickets are assigned an Impact and Urgency which is used to calculate the priority. Impact is a measure of the effect of an Incident. Urgency is a measure of how long it will be until an Incident has a significant business impact. The definitions of Impact and Urgency are in the table below: Rating Impact Urgency Low Superficial and does not materially impact functionality. A solution can be scheduled for when is mutually convenient. Medium Impacts functionality, but continued system use is possible. Needs to be addressed soon to prevent any further deterioration. High Affects the majority of users and/or prevents use of an entire system. Requires immediate attention. Priority The following table defines the priority levels applied to all Tickets which is calculated from the Impact and Urgency. Tickets which are not Incidents (examples include an enquiry on how to do something, or an enhancement request) will be assigned a Priority according to their Urgency only i.e. a Priority of P3, P4, or P5 for Urgency of High, Medium, or Low respectively. The priority of an Incident may change throughout its duration. For example, a Priority 2 Incident may be upgraded to Priority 1 if an Incident affecting some users spreads to all users; or a Priority 1 Incident could be downgraded to Priority 2 if a Workaround is provided in advance of a permanent fix. Urgency Impact Low Medium High Low P5 P4 P3 Medium P4 P3 P2 High P3 P2 P1 The circumstances of an Incident determine its Impact or Urgency. An example is where a store has four Point of Sale (POS) solutions, and one develops a fault which renders it inoperable (hardware or software): During a quiet period when customer numbers are low, this might have an Impact of “Medium” and an Urgency of “Medium” (resulting in a Priority of “P3”). If the same Incident were to occur in a very busy period, the Impact would still be “Medium” (because other POS solutions are operable), but the Urgency may be “High” (resulting in a Priority of “P2”). In the extremely unlikely event that all POS solutions were inoperable in a location, this would be a High Impact and High Urgency Incident, resulting in a Priority of “P1”. Note that a “location” does not necessarily mean everything at a site/store – please see examples below: A P1 could be for a significant area such as a café is not able to trade, even if the shop in another building at the same site is able to trade. If online trading which K3 hosts is not functioning, but trading in a physical store is working, then the website is still a location that cannot trade i.e. a P1 situation. SLA Target Times The table below provides the target times for Incidents and Questions which are calculated during Business Days. The target times are generally twice as fast as the Standard SLA which means that Premium customers will effectively jump the queue compared to Standard SLA customers raising the same priority ticket at a similar time. Priority Target First Response Time Target Recovery Time Target Resolution Time P1 ½ hour 4 Hours 1 Business Day* P2 2 hours 2 Business Days 5 Business Days P3 4 hours 5 Business Days 4 Weeks P4 8 hours 1 Month 2 Months P5 16 hours Not Applicable 4 Months * If a solution is possible remotely; 1.5 business days if an onsite visit is required for a hardware breakdown. If applicable, the Support Team will endeavour to provide a Workaround which K3 may deem as a sufficient resolution that a permanent fix is not required. The scope of what is included in the Premium SLA target times is greater than the Standard SLA; the Standard SLA applies to Incidents only, but this Premium SLA also applies to Questions (How-To) up to a maximum of 15 minutes per ticket (after which training or further support effort will be chargeable). Note that the Target Recovery Time and the Target Resolution Time shall not apply to any Incident which is determined not to be a Product Fault or a Service Request - Question (How-To), and K3 reserves the right to charge the Customer for any time spent by K3’s Support Team investigating any non-product Faults (e.g. faults caused by the Customer or Customer’s infrastructure). The service levels listed above are targets only, and do not constitute a guaranteed service level. Any failure by K3 to meet these targets shall not, of itself, constitute a breach of contract or a default on the part of K3. Support Service Hours Standard Hours Standard Hours are weekdays, excluding Public Holidays in the Customer’s country, during the local hours of the K3 Service Desk as displayed on the k3btg.com Support web page (together defined as “Business Days”). Incidents will be worked on during Business Days and additionally, Customers may log Tickets 24x7 by emailing K3 Support or using the K3 Support Portal. Extended Hours Three Extended Hours options are available for additional fees for K3 to provide support for Priority 1 and 2 Incidents only as follows (either one or multiple options may be purchased): Weekday Evenings (excl. Public holidays) Saturdays Sundays and Public Holidays (excludes 25th December when we are closed) The hours included in each option vary by country as defined on the k3btg.com Support web page. Any purchased option will be deemed part of a “Business Day” (for the purposes of the Service Desk provision) for Priority 1 and 2 Incidents only. * Extended Hours options are not available for some legacy products, and hardware support is only offered on Saturdays, Sundays and Public Holidays Accessing Support Services All Tickets must be investigated through the Customer’s internal support tiers prior to being referred to K3. Support Portal The Support Portal website address is https://support.k3btg.com. It is the best choice for Customers to access Support Services because it provides information which may solve the query automatically, and if not, it enables the Support Team to respond and help Customers more quickly due to the structured information about the Ticket which is captured via the Support Portal. In the unlikely event that a whole site is unable to trade (i.e. a Priority 1 Incident), then Customers can either phone the hotline, or raise a Ticket on the Support Portal. Any P1s raised by the portal are automatically notified to all support team members via an integration with K3’s internal chat platform (Microsoft Teams), so this method is just as fast as making a phone call, and may be the better method if you need to pass lots of information that is difficult to do over the phone (e.g. screenshots). Creating a Ticket via the Support Portal also facilitates efficient follow-up communications such as Support providing updates, and Customers providing further information if requested. Customers can self-register for the portal, and once we have performed verification checks, they will be able to see and do more than via email or phone (see You're here, but why use the portal?), and upon request, customers can see all tickets for their company as well as just their own. Support Hotline For Priority 1, 2, and 3 Incidents, and urgent Service Request - Questions, Premium SLA Customers may call the applicable local Support Hotline during Standard Hours (Priority 1 and 2 only during Extended Hours, if purchased). Lower priority Incidents, and non-Incidents (requests for help, change requests) must be registered via the Support Portal or email, not via the Hotline. Support may phone the Customer at a later point to explain something or discuss an issue if it’s likely to be the most efficient way to resolve an Incident. Type Contact Support Portal https://support.k3btg.com/ Support Email support@k3btg.com Danish & Swedish Support Hotline +45 7011 9100 Dutch Support Hotline +31 157 99 78 00 English Support Hotline (except for the below) +44 161 524 6793 English Support Hotline for SmartVision, Omnis, Sigma, JobBOSS +44 190 493 5732 German Support Hotline +49 7344 166 3100 Norwegian Support Hotline +47 3399 8150 Support Email The K3 Support email address is support@k3btg.com. Tickets raised by email default to a category of Service Request, and Priority 4, but once reviewed by a Support Team member, the Category, Impact, and Urgency will be updated in accordance with our understanding of the email content. Unlike tickets raised on the Support Portal which can be automatically prioritised and managed as applicable, this cannot happen automatically with tickets from email until they have been reviewed. Therefore, High Impact and Urgency Incidents should never be reported this way to avoid delays in the Incident being investigated. Ticket Communication Every Ticket raised will be assigned a unique reference number which is provided to the Customer on the Support Portal and via email to enable the Customer and K3 Support to follow up on Tickets efficiently where necessary. If the first contact from a Customer for a Priority 1 or Priority 2 Incident is via calling the Support Hotline, Support will register the details on the Support Portal to track details, notify the Customer of updates, and to maintain a full report of all Tickets raised by each Customer. Ticket updates, status, and target dates are available to view on the portal, and most updates are also emailed to the Customer. The Support Team may phone the Customer if it is determined to be the most efficient and effective way to provide an update or investigate an Incident further. K3’s Support Team will endeavour to communicate in the primary language of the Customer’s country, but to enable the maximum amount of K3’s expertise to be used to solve an Incident, K3’s Support Team may communicate in English even if the first contact was not in English. Service Management Quarterly Reviews Quarterly service reviews will be arranged with a K3 Support Manager and Customer Success Manager where the tickets raised in the previous period will be reviewed to assess where improvements may be made to the service, and where K3 might be able to help the customer to avoid similar issues in future. Bespoke reports will be made available to Customers in advance of the meeting which will provide a summary and detailed level of information, and can be tailored to the Customer’s needs. Escalation Process Priority 1 Incidents will be automatically escalated to a Support Manager who will ensure that all possible actions are taken to resolve it quickly. We are committed to delivering high quality support to all our Customers. In the unlikely event that a Customer has worked through K3’s support processes and is not satisfied with the service received, Customers can escalate the Support Ticket direct to a Support Manager via the portal, phone call, or email. Please provide the Ticket number and reason for the escalation. The escalation request will be evaluated by a Support Manager on a number of factors including the Ticket type and if the Ticket has not met any of the relevant target times in this SLA. Appendix: Definitions and Terms Please note the following terms and definitions that are used in this document. Term Definition Incident A type of Ticket which is a Product Fault causing an unplanned interruption to the Service or reduction in the quality of the Service. Product Fault Any error, bug, or defect with K3’s software, hardware, or hosting services (excluding any error, bug, or defect contained within any customer specific configuration or infrastructure). Support Services The provision by K3 of a remote support service to enable the Customer to report and K3 to investigate Product Faults in the applicable supported K3 product. Target Recovery Time The time from the Customer successfully registering an Incident with K3 Support to the time that K3 Support provides a Workaround which reduces the impact of an Incident. Target Resolution Time The time from the Customer successfully registering a Ticket with K3 Support to the time that K3 Support provides (i) a Workaround which K3 deems as a sufficient resolution that a permanent fix is not required, (ii) a permanent fix if no Workaround is possible, or if the Workaround cannot remain in place long-term. Target Response Time The time from the Customer successfully registering an Incident with K3 Support to the time that K3 Support first provides a (non-automated) response. Ticket A record of every request made by the Customer to K3 for Support Services. Workaround A temporary solution for an Incident to minimise the business impact while waiting for a permanent fix. As technology, products, and processes evolve, it may be necessary for K3 to amend, update, or supplement this guidance. This document may therefore be amended, updated, or supplemented from time to time by K3, at its discretion.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103078538291/original/ZWPNJB83mEyHma7AeV117GoVfGxhQgkHNg.jpeg?1704898026"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2024-01-10T14:52:58+00:00",
    "updated_at": "2025-05-22T18:28:00+01:00",
    "id": 103000267928,
    "tags": []
  },
  {
    "title": "What are the differences between the Standard and Premium SLA?",
    "text": "The Premium Service Level Agreement (SLA) is an optional extra giving the following benefits over Standard Service Level Agreement (SLA) customers. Below you can see the additional benefits the Premium SLA provides. 1 Only available via the portal except if registering a Priority 1 or 2 Incident via the Hotline 2 Only applicable via the portal A Comparison of the Standard and Premium SLA target times can be found below. Full details can be found in the Premium Service Level Agreement (SLA) * If a solution is possible remotely; 1.5 business days if an onsite visit is required for a hardware breakdown.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103185755201/original/Y1uedsrb14mrHyB0v0HNWyUc2aQo1z3P7A.png?1738347672",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103185753978/original/3HKdAT4xWLOkyZ_IZbbSbmuKEAzZaRXgqQ.png?1738346962",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103185754992/original/-9T8lEDgqjfrHrcE4g68ioPMfWgapNay4A.png?1738347532"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2024-01-10T14:52:52+00:00",
    "updated_at": "2025-03-11T13:13:20+00:00",
    "id": 103000267927,
    "tags": []
  },
  {
    "title": "What are the Benefits of the Premium SLA?",
    "text": "TABLE OF CONTENTS Unlock Unparalleled Support for Your Business Key Benefits of the Premium SLA Peak Period or Annual Subscription How Can I Compare SLAs in Detail? Unlock Unparalleled Support for Your Business With the K3 Premium SLA add-on service, you gain exclusive access to a suite of premium benefits that prioritise your needs and streamline your support experience. From accelerated response and resolution times to additional support services. We are dedicated to ensuring that your business operations remain uninterrupted and optimised. Key Benefits of the Premium SLA Accelerated Target Response, Recovery, and Resolution Times1 Benefit from reduced timelines for response, recovery, and resolution, ensuring a faster resolution to incidents. Phone Hotline for Priority 3 Incidents Receive immediate assistance for Priority 1, 2, 3 incidents via our dedicated hotline, ensuring swift resolution while minimising disruption. Response and Resolution Target Times for \"How-To\" Questions2 Enjoy expedited support for \"How-To\" questions, ensuring you receive the guidance you need promptly. Quarterly Service Reviews with Support Manager and Customer Success Manager Stay informed and aligned with our support and success teams through regular reviews, enhancing the overall value of our partnership. Escalations Direct to Support Manager (P1 Incidents and service issues)2 In case of Priority 1 incidents and service issues, escalate directly to a Support Manager for immediate attention and resolution. Priority 2 Incidents (optional) Out of Normal Hours Cover If you have already purchased for extended coverage beyond normal hours for Priority 2 incidents, providing peace of mind during critical times. 1 Only available via portal except if registering Priority 1 or 2 incidents via the hotline. 2 Only available via the Portal. Peak Period or Annual Subscription K3 understands that different businesses have different peak periods and may not require Premium SLA benefits the whole year round. Premium can be purchased in blocks of three months for when it’s required to fit your commercial needs, or a discounted annual subscription option is also available. How Can I Compare SLAs in Detail? Both SLAs can be seen in detail from the links listed below. You can also review What are the differences between the Standard and Premium SLA? Standard Service Level Agreement (SLA) Premium Service Level Agreement (SLA)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "What to expect from Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103092159275/original/PZcWhXvc2I_dJCrvdTmdAqwyq9rCHVoEnQ.png?1709209155"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2024-02-29T12:15:48+00:00",
    "updated_at": "2025-02-24T14:32:00+00:00",
    "id": 103000279648,
    "tags": []
  },
  {
    "title": "You're here, but why use the portal?",
    "text": "W E L C O M E to the K 3 S U P P O R T P O R T A L We're glad you're here :-) but just in case you're not sure, the portal is the best way to log and review all of your tickets because.... Your ticket will be dealt with faster! > You can let us know instantly what the category, urgency and impact of your request is. Any P1s logged via the portal (P1 means that you can't trade at all from a physical or online location) are immediately alerted to all support team members. > Tickets from email default to low priority; they have to wait for an agent to read, categorise, and assess their view of the impact and urgency. Use the portal for urgent issues. ?? Phone calls are quicker aren't they ?? Phone us only when something is stopping you trading i.e. is high impact and urgency = P1. If you phone for lower priority things, you may be blocking people who have a genuine emergency. The portal can suggest solutions from our knowledge base for speedier resolution to common questions and issues. See the latest updates on one or all tickets all in one place. > We can also enable access to see all tickets for your whole company, not just your own tickets (raise a Service Request/Access Request ticket for this). You can see what to expect from Support (when logged into the portal) including the Service Level Agreement (SLA). Check if a ticket is being worked on by K3, or if it's waiting for you, the customer to respond. Some information can only be seen on the portal (it can't be sent via email). You can see if we met the First Response SLA, what the Target Resolution Date is, and for resolved tickets, you can look at the Resolution Summary, and if we met the Target Resolution SLA. See what can you see on the portal? (when logged into the portal) for more information Some product documentation is integrated which will be suggested to you if relevant. Release notes for some products are available. The portal content and functionality is only available once you are logged in. When logged in, the portal knows what product(s) your company has purchased from us, so you will only see relevant content If you haven't already, please register to use the portal (see How to register to use the portal)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103090142979/original/K5MtoFxbLUs1qj3Wh3A9ykMARstba9OmSg.JPG?1708596958",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103035363082/original/CsnDH_UruSCAP_x5x8lYppUO4ofHN-M3sw.png?1688996126"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-06-08T18:40:56+01:00",
    "updated_at": "2024-05-21T15:19:20+01:00",
    "id": 103000128439,
    "tags": []
  },
  {
    "title": "How to register to use the portal",
    "text": "To use or see more information on how to use this portal, you will need to be logged on which means registering with us (if you are a K3 customer). TABLE OF CONTENTS Who Is This Portal For? How to Register / Sign Up Activate Your Account Who Is This Portal For? This portal is for customers of K3 Business Technologies who have an active subscription or support contract for one of the following products: Cowis DdD Imagine JobBOSS LSOne MStore Omnis Retail Manager RMS RVE Sigma SmartVision Hardware support only (Product Name is \"OTHER\") How to Register / Sign Up For initial registration, please click on the Signup link and enter your full name and email address (screenshot below). Please use your business address so that we can identify which company you work for. The sign up page looks like the below (where we have filled in an example). You will then see a confirmation banner above the login page (see green banner in screenshot below). There's nothing more for you to do until we have sent you an activation email - see the next section. Please note that your email address must not be registered already. If we already have your email address in our system, you will see an error like the below. If this happens, then you may need to reset your password - please see How to reset your password Activate Your Account Once you have registered, we will review your request, match you with your company record in our system, and send an activation email which will ask you to set a password. Screenshots of this process are below: 1. Activation Email Example 2. Password Setting Screen (from clicking the link in the email) 3. Successful Account Activation Once you have entered your password and clicked on the \"Activate and Log in\" button, you will be logged in with the confirmation message shown in the green banner below Once you are logged in, you will be able to see more information on how to use this portal, submit tickets, see all of your tickets (and your colleagues as well if you ask us to enable you to see them), and search our knowledge base for answers to any queries you may have",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103025642644/original/3xprQQW9_A66H9hBWW5DRj86Ct5XPIl-AA.png?1684858863",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103106328943/original/pu_IL86l5PWOaVZyfI-Y1UvgZhzagQ6Rkg.png?1713454834",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103106330638/original/UN3rMjf2oVVFfo06Qf80RVd3DTqiBQ-HgQ.png?1713455150",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103032347119/original/0kqfa-WZDcgZIuM7qEjo5LmQKz5oI6g4SA.png?1687860075",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103106332537/original/O-5NTC8RT6IL4nwCavkq_GjFulHevahBbg.png?1713455525",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103106333025/original/KZv1Y2bgly1CLP9uQm7VqxJVgJReHXHJRA.png?1713455605",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103106333633/original/ysHTaVDzIVB6g0QvYdb1ZnYSjjqZ_6A2LQ.png?1713455717"
    ],
    "has_images": true,
    "image_count": 7,
    "created_at": "2023-07-06T17:23:53+01:00",
    "updated_at": "2024-04-18T17:10:50+01:00",
    "id": 103000155749,
    "tags": []
  },
  {
    "title": "How to change / reset your portal password",
    "text": "TABLE OF CONTENTS Change Your Password (if you're already logged in) Password Reset Link (if you can't log in) Password Reset Email Change Your Password (if you're already logged in) If you're logged in and want to change your password for any reason (e.g. you've been given a temporary password by K3 Support): Click on your profile picture/initial, and select \"My profile\" Click on the \"Change Password\" button/tab (you'll be asked to enter your current password as well as your new one) Password Reset Link (if you can't log in) If you are already a registered user, you can reset your password by clicking on the \"Forgot your password?\" link from the Login page. The link is different depending on your language, but here's a direct link to the English version: https://support.k3btg.com/en/support/login and the Danish link: https://support.k3btg.com/da/support/login Password Reset Email You will receive an email which looks like this (depending on language). Please check your spam/junk email if you do not receive it.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103146130173/original/ck2Nbs2aPs6m07rDGr3Ba8MyeGjIZkBE9g.png?1726142122",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103146131252/original/M8QOPpFg_SdMIFYewFQf6-F1IkLCKf2IPg.png?1726142229",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031504755/original/g2UCJMj7WdsFfvWDSLBtqE2chzvYVHNgwg.png?1687366242",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103032462448/original/VwKN7kHgtx3eWetZ7ojZYtYW_RcC421dVw.png?1687880325",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103074397032/original/mGm5eOlPRGF-8kPuyI_BQz9zhHjVUkixGQ.png?1703001233"
    ],
    "has_images": true,
    "image_count": 5,
    "created_at": "2023-06-21T17:51:03+01:00",
    "updated_at": "2024-09-13T12:50:46+01:00",
    "id": 103000135610,
    "tags": []
  },
  {
    "title": "How do I contact K3 Retail Support?",
    "text": "Portal This is the best way of contacting Support, and the reasons why can be found in You're here, but why use the portal? You will need to register to use the portal. If you haven't registered already, please see How to register to use the portal Email You can email support@k3btg.com but as the You're here, but why use the portal article explains , tickets created from emailing us is the slowest way of engaging Support to work on a request or issue you have, so do not use email for high impact and high urgency issues. Emails for follow-up on existing tickets are fine, regardless of the ticket category and priority. Phone Hotlines The support hotline is only for serious issues which prevent trading/operations. This keeps the phone lines free for emergencies only, so that if your business can't function, you are not waiting on the phone line while someone else is talking to Support about something less critical. To call support in an emergency (Priority 1 Incident) to report a new issue, please use the relevant number for your country below. Note that Premium SLA customers are also entitled to phone for Priority 2 Incidents. If our phone lines are busy, then please wait until you get through, or choose the option to leave a voicemail which you will be given if you have waited more than 5 minutes. If you log a P1 ticket via the Support Portal, then we will be alerted immediately, so this method is as effective as phoning the hotline, and may even be more effective if you need to provide screenshots or other information which we might ask you for on a phone call. Country Phone Number Danish Support Hotline +45 70 11 91 00 Dutch Support Hotline +31 157 99 78 00 English Support Hotline (except the products below) +44 161 524 6793 English Support Hotline for SmartVision, Omnis, Sigma, JobBOSS +44 190 493 5732 German Support Hotline +49 7344 166 31 00 Norwegian Support Hotline +47 3399 8150 Sweden Support Hotline +45 70 11 91 00 If we need to talk to you about an existing ticket, we will arrange (via updates on the ticket) to call you at an agreed time. Please don't call us so that we keep the hotline free for new emergencies Also See What days and times is Support available? Standard Service Level Agreement (SLA) (must be logged into the customer portal to see this) What are the differences between the Standard and Premium SLA?",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103070581438/original/N-7n4MdTOoPTKicyU2TDcJnhqKLbnmNmyA.png?1701780963"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-06-21T09:23:00+01:00",
    "updated_at": "2024-05-21T15:21:33+01:00",
    "id": 103000134412,
    "tags": []
  },
  {
    "title": "What days and times is Support available?",
    "text": "TABLE OF CONTENTS Standard Hours The Nordics United Kingdom The Netherlands Germany Extended Hours The Nordics United Kingdom The Netherlands Germany Holiday Period Exceptions Also See How do I contact Support? Standard Service Level Agreement (SLA) (must be logged into the customer portal to see this) What are the differences between the Standard and Premium SLA? Standard Hours We have support teams based in different countries who operate different standard hours in line with the majority of customer's standard open hours in that region. The Nordics Monday to Friday 8:30am to 4:30pm United Kingdom Monday to Friday 9:00am to 5:30pm except the below products: SmartVision, Omnis, Sigma, JobBOSS are supported Monday-Friday 9:00am to 5:00pm The Netherlands Monday to Friday 8:30am to 6:30pm Germany Monday to Friday 8:00am to 6:00pm Public Holidays on week days in the above regions are excluded; Extended Hours option 3 below is required to respond to customers on Public Holidays. Extended Hours Extended Hours are for customers who have subscribed to the extra support times and are for Priority 1 Incidents only (i.e. something which is preventing you from trading). Premium Service Level Agreement (SLA) customers can also contact Support for Priority 2 Incidents (e.g. something that is seriously restricting your ability to trade such as 1 POS not working, but 2 POS are working). Extended Hours are not available for some products (as noted below). You can register lower priority issues outside of our Standard Hours via the portal or email, but they will not be worked on during Extended Hours. Three Extended Hours options are available for additional fees to provide support for Priority 1 Incidents only as follows (either one or multiple options may be purchased): Weekday Evenings (excl. Public holidays) Saturdays Sundays and Public Holidays (excludes 25th December when we are closed, and some other exceptions) Please contact your K3 Customer Success Manager if you would like to purchase any of these options, or check if you have them already. The Nordics Weekday Evenings: 4:30pm to 7:00pm Saturdays: 10:00am to 6:00pm Sundays: 10:00am to 5:00pm and Public Holidays: 10:00am to 2:00pm United Kingdom Weekday Evenings: 5:30pm to 8:00pm Saturdays: 9:00am to 5:30pm Sundays and Public Holidays: 9:00am to 5:30pm No extended hours options for SmartVision, Omnis, Sigma, or JobBOSS, and hardware support is offered on Saturdays, Sundays and Public Holidays only. The Netherlands Thursday and Friday Evenings: 6:30pm to 9:30pm Saturdays: 8:30am to 5:30pm Sundays (no Public Holiday cover unless exceptionally agreed): 12:00pm to 5:30pm Germany No extended hours for Cowis. Imagine and DdD/RIAB have extended hours options which match The Nordics open hours. Holiday Period Exceptions Support is available on Public Holidays in the relevant country using Sunday open hours. There are some exceptions around major holidays such as Christmas and Easter which will be listed below if relevant. Also See How do I contact Support? Standard Service Level Agreement (SLA) (login to portal to see this) What are the differences between the Standard and Premium SLA? (login to portal to see this)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2023-05-23T17:34:12+01:00",
    "updated_at": "2025-05-22T10:52:23+01:00",
    "id": 103000121728,
    "tags": []
  },
  {
    "title": "Christmas 2025",
    "text": "TABLE OF CONTENTS Standard Hours The Nordics United Kingdom The Netherlands Germany Extended Hours The Nordics United Kingdom The Netherlands Germany Holiday Period Exceptions Also See How do I contact Support? Standard Service Level Agreement (SLA) (must be logged into the customer portal to see this) What are the differences between the Standard and Premium SLA? Standard Hours We have support teams based in different countries who operate different standard hours in line with the majority of customer's standard open hours in that region. The Nordics Monday to Friday 8:30am to 4:30pm United Kingdom Monday to Friday 9:00am to 5:30pm except the below products: SmartVision, Omnis, Sigma, JobBOSS are supported Monday-Friday 9:00am to 5:00pm The Netherlands Monday to Friday 8:30am to 6:30pm Germany Monday to Friday 8:00am to 6:00pm Public Holidays on week days in the above regions are excluded; Extended Hours option 3 below is required to respond to customers on Public Holidays. Extended Hours Extended Hours are for customers who have subscribed to the extra support times and are for Priority 1 Incidents only (i.e. something which is preventing you from trading). Premium Service Level Agreement (SLA) customers can also contact Support for Priority 2 Incidents (e.g. something that is seriously restricting your ability to trade such as 1 POS not working, but 2 POS are working). Extended Hours are not available for some products (as noted below). You can register lower priority issues outside of our Standard Hours via the portal or email, but they will not be worked on during Extended Hours. Three Extended Hours options are available for additional fees to provide support for Priority 1 Incidents only as follows (either one or multiple options may be purchased): Weekday Evenings (excl. Public holidays) Saturdays Sundays and Public Holidays (excludes 25th December when we are closed, and some other exceptions) Please contact your K3 Customer Success Manager if you would like to purchase any of these options, or check if you have them already. The Nordics Weekday Evenings: 4:30pm to 7:00pm Saturdays: 10:00am to 6:00pm Sundays: 10:00am to 5:00pm and Public Holidays: 10:00am to 2:00pm United Kingdom Weekday Evenings: 5:30pm to 8:00pm Saturdays: 9:00am to 5:30pm Sundays and Public Holidays: 9:00am to 5:30pm No extended hours options for SmartVision, Omnis, Sigma, or JobBOSS. The Netherlands Thursday and Friday Evenings: 6:30pm to 9:30pm Saturdays: 8:30am to 5:30pm Sundays (no Public Holiday cover unless exceptionally agreed): 12:00pm to 5:30pm Germany No extended hours for Cowis. Imagine and DdD/RIAB have extended hours options which match The Nordics open hours. Holiday Period Exceptions Support is available on Public Holidays in the relevant country using Sunday open hours. There are some exceptions around major holidays such as Christmas and Easter which will be listed below if relevant. Christmas and New Year 2024/2025 The table below specifies the Support availability during this period (if the relevant Extended Hours option has been purchased). Note that the highlighted periods show when the Standard or Extended Hours are different to the usual open hours for those days/times. Day NordicUKNLDE Sun 22 Dec 2024 10:00 - 17:00 09:00 - 17:30 12:00 - 17:30 10:00 - 17:00 Mon 23 Dec 2024 08:30 - 19:00 09:00 - 20:00 08:30 - 21:30 10:00 - 18:00 (RIAB) Tue 24 Dec 2024 10:00 - 14:00 09:00 - 17:30* 08:30 -16:00 10:00 - 14:00 (RIAB) Wed 25 Dec 2024 CLOSED CLOSED CLOSED CLOSED Thu 26 Dec 2024 10:00 - 14:00 10:00 - 16:00 CLOSED CLOSED Fri 27 Dec 2024 08:30 - 19:00 09:00 - 20:00* 08:30 - 21:30 08:00 - 18:00 Sat 28 Dec 2024 08:30 - 18:00 09:00 - 17:30 08:30 - 17:30 08:00 - 18:00 Sun 29 Dec 2024 08:30 - 17:00 09:00 - 17:30 12:00 - 17:30 08:00 - 17:00 Mon 30 Dec 2024 10:00 - 18:00 09:00 - 20:00* 08:30 - 21:30 10:00 - 18:00 (RIAB) Tue 31 Dec 2024 10:00 - 14:00 09:00 - 17:30* 08:30 - 16:00 10:00 - 14:00 (RIAB) Wed 01 Jan 2025 10:00 - 14:00 10:00 - 16:00 CLOSED CLOSED Thu 02 Jan 2025 08:30 - 19:00 09:00 - 20:00 08:30-21:30 08:00 - 18:00 Fri 03 Jan 2025 08:30 - 19:00 09:00 - 20:00 08:30-21:30 08:00 - 18:00 Non-standard due to Christmas/New Year/Public Holidays * Support finishes at 15:00 for the following products: SmartVision, Omnis, Sigma, JobBOSS Also See How do I contact Support? Standard Service Level Agreement (SLA) (login to portal to see this) What are the differences between the Standard and Premium SLA? (login to portal to see this)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "How to Login to the Portal and Contact Support",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-01-06T09:38:05+00:00",
    "updated_at": "2025-01-06T09:38:05+00:00",
    "id": 103000327600,
    "tags": []
  },
  {
    "title": "What Language is the Portal In?",
    "text": "The portal is available in English, German, Danish, Swedish, Norwegian, and Dutch. This applies to most areas of the portal and tickets, but the articles in the portal knowledge base are generally in English where products are available in multiple countries.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Getting Started",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2023-06-21T18:18:49+01:00",
    "updated_at": "2023-08-09T15:51:37+01:00",
    "id": 103000135612,
    "tags": []
  },
  {
    "title": "Profile Settings",
    "text": "Once you are logged in, click on the icon at the top right of your screen which will have the first letter of your name displayed, and select \"My profile\" (or the equivalent in your language if not using English). From this page you can update your language, Time zone, phone number (but email cannot be changed), and your job title if you wish.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Getting Started",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028257090/original/Px9ixr94Qmckjqkm4lhj2JDbem42_ZWwYg.png?1686051139"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2022-11-03T10:24:42+00:00",
    "updated_at": "2023-08-08T09:13:53+01:00",
    "id": 103000022569,
    "tags": []
  },
  {
    "title": "What can you see on the portal?",
    "text": "TABLE OF CONTENTS Solutions All of the tickets you have personally logged Ticket Information that is not available via emails Tickets that anyone in your company has logged Export a list of tickets Solutions You can browse and search our Knowledge Base - see How to search the Knowledge Base to see if we already know the answer to your enquiry All of the tickets you have personally logged You can also see all of the tickets you've logged with us by clicking on the Tickets menu item. Note the panel on the right of the ticket list which lets you select if you want to see Open tickets, or Resolved, or All tickets Note that when you click on a ticket from the list (if there are more than one), the top of the screen will show you the original description of the ticket, and below will then be all of the subsequent updates - you can choose to see the oldest or newest at the top by clicking on the option as shown below. When you click on a ticket, the top of the screen will show you the original description of the ticket, and below will be all of the subsequent updates - you can choose to see the oldest or newest update at the top by clicking on the option as shown below. Ticket Information that is not available via emails Some information can only be seen on the portal (it can't be sent via email). You can: Check if we met the First Response SLA (Service Level Agreement) View the Target Resolution Date (this will show as being on pause if we are waiting for a customer response) See if we met the Resolution SLA (for closed tickets) Resolution Summary (text entered by the support agent) For Premium SLA customers, you can now escalate a ticket direct from the portal Tickets that anyone in your company has logged Did you know that you can opt to see all tickets for your company as well as just your own tickets. Raise a Service Request/Access Request to ask Support to enable this for you. Once enabled, you will be able to select to see your own tickets only, all of those for your company, or select to see tickets raised by any other individual in your company Export a list of tickets On the tickets screen, there is a button to Export Tickets. The screen which pops up will allow you to select which fields are exported, and if you want a CSV or an Excel format file. Note that the default time period is tickets raised in the last 30 days - you can change this to a different preset, or select to set a custom date (which means that you can set the date from to an early date if you would like a list of all open tickets, regardless of when they were logged)",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Getting Started",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028811140/original/yg0u0qKqYL3CxM7oJqsdbCSj2azPy8mkfA.png?1686246585",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103036131676/original/WogCtWbKKwUCwUYKZW3kQlzjo8Kkw9DtFw.png?1689245595",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103089637821/original/HNaDEF5qTzXIrGH4wfEw2FP4uyoCUMCN1Q.png?1708451853",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028810867/original/1dpQaLFQqLwHjaLKOCQtWViX8PjWgF8ROg.png?1686246327",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028810962/original/3OsJz4gYLCSP-VMHyRnSlumysCYjdnCLdw.png?1686246446",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103089637434/original/jE7fOPBa3p7PpKNEP_WdQX74luHHE4i1ew.png?1708451703",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103046904302/original/USRm-eaJdsRDx_5DShM5qiSaL2_qgQv27Q.png?1693903950"
    ],
    "has_images": true,
    "image_count": 7,
    "created_at": "2023-06-08T18:49:59+01:00",
    "updated_at": "2024-03-22T10:29:37+00:00",
    "id": 103000128440,
    "tags": []
  },
  {
    "title": "How to search the Knowledge Base to see if we already know the answer to your enquiry",
    "text": "From the portal home screen, you can browse and search articles for the product(s) which you have from K3. Our system is configured to only show you articles which are for the product(s) you have purchased. You can do any of: Click on the \"Browse articles\" button Click on View all articles link Click on the panel with your product name in it (e.g. \"Imagine Documentation\" as shown below Enter a search term Note that articles for most products are in English (try both English and your country's language if not English) Note that if you decide to Submit a ticket, when typing into the Subject field, any matching articles will be shown on a panel on the right.",
    "category": "How to use this portal and what to expect from Support",
    "subcategory": "Getting Started",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028809928/original/Cs2aul_Ayl93nmX4UTyplVltvAHFRP_4QQ.png?1686245368",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103028810280/original/ImabuIFguf7d6p-XvJLn8Bnygt6Ly1H2pw.png?1686245696"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-06-08T18:35:00+01:00",
    "updated_at": "2023-08-08T09:34:29+01:00",
    "id": 103000128424,
    "tags": []
  }
]