[
  {
    "title": "Clear Stuck Users",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071472204/original/-aFdD5wa_B1hKgLU1-M6HKZ_DVF_h_BFVw.png?1701966558"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-12-07T16:29:26+00:00",
    "updated_at": "2023-12-07T16:29:41+00:00",
    "id": 103000260982,
    "tags": []
  },
  {
    "title": "Update a new Feature License Key",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075797153/original/bRM5ETNNbkPwmgPKIIUZOTo7WDMYqTqBDw.png?1703756068"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-12-28T09:34:37+00:00",
    "updated_at": "2023-12-28T09:34:39+00:00",
    "id": 103000264904,
    "tags": []
  },
  {
    "title": "PO description missing from Print",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075798487/original/tV16bnqYvxE_p-BSkFrPLAtbjW3ESPIi8g.png?1703756378",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075798539/original/nfkd1GAgT4xFeDurMR3HQ44R1OFDQ-d7yA.png?1703756385",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075798600/original/ZP41___cM_mJlfldfxOdsKINzzU6xDNrrQ.png?1703756399"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2023-12-28T09:40:20+00:00",
    "updated_at": "2023-12-28T09:40:23+00:00",
    "id": 103000264906,
    "tags": []
  },
  {
    "title": "Quotes extended description missing from print",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075799431/original/q1k_f75eRxfH5mYMfvkwjm3nURqNnuKu0g.png?1703756580",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075799305/original/PhTsL92SkZy5cNLr1KtfAkoNPHJIuR-eXA.png?1703756555"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-12-28T09:43:28+00:00",
    "updated_at": "2023-12-28T09:43:30+00:00",
    "id": 103000264908,
    "tags": []
  },
  {
    "title": "Update your new JobBOSS Client License Key",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103076461621/original/5OkVj2k66J8-C9Y1CRVfNA_gB18kEsU3JQ.png?1704204465"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2024-01-02T14:07:49+00:00",
    "updated_at": "2024-10-30T09:35:59+00:00",
    "id": 103000265398,
    "tags": []
  },
  {
    "title": "Communication Link Failure / Connection Errors",
    "text": "This article addresses when workstations receive Communication Link Failure or connection errors over various stages of use and frequency. Users may experience this after walking away from the workstation repeatedly throughout the day. Scope The scope of this article is intended for IT professionals, Network Administrators and those with a high level of technical expertise with networking in general. JobBOSS Support is not responsible for troubleshooting or diagnosing issues with your network; this should be handled by your IT support personnel. Cause The JobBOSS client has lost network connectivity with the server while JobBOSS was open. Due to the sensitive nature of the network connection with the database, JobBOSS will need to be shut down and logged back into to re-establish the connection. There are a wide variety of causes for connection errors. The most common we see are: Sleep mode - Workstation enters sleep mode while idle and JobBOSS is open. Sleep mode disables the Network Card (NIC) and interrupts the connection to JobBOSS. Docking/undocking or roaming on Wi-Fi with a laptop while JobBOSS is open; this interrupts the network connection. Poor Wi-Fi connectivity. Loose network cables. General network hardware failure, including but not limited to the workstation, cables, network equipment or the server itself. Interference from heavy machinery or power conduits (poorly shielded or routed networking). Incorrect SQL Compatibility level of the databases (rare) Restricted connections to the JobBOSS Server shared folder Solution Solutions will vary depending on the cause. If the workstation is being left idle, disable sleep mode in the Power Options control panel or GPO. Alternatively, close JobBOSS before leaving the workstation idle. Do not use JobBOSS with Wi-Fi connections. This is not supported. Gigabit ethernet is recommended. If docking/undocking a laptop, close the JobBOSS application first. Check and re-seat network cables for the affected area or workstation. Make sure the networking is properly shielded and has appropriate proximity to power conduits and machinery. Test for packet loss and DNS resolution. Check the sharing properties of the JobBOSS Server shared folder on the server and ensure the number of connections are not too restricted. SQL Compatibility levels would typical only affect those that have recently upgraded from a very old version of JobBOSS (12 or lower). Review the SQL database properties in SQL Management Studio and ensure they are all set to 2012 or higher. Contact support if you need more information on this.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-03-01T11:29:55+00:00",
    "updated_at": "2024-03-01T11:30:10+00:00",
    "id": 103000279839,
    "tags": []
  },
  {
    "title": "JobBOSS - Service Unavailable Error in Data Collection",
    "text": "This article is regarding a \"Service Unavailable\" error in Data Collection Applies to Troubleshooting the Data Collection Web Service Problem On the Data Collection Entry Points (either Workstation Drivers or Keypads), the user sees a message stating “Service Unavailable” or Connection Failure. This indicates that the Entry Point cannot communicate successfully through the web service to the JobBOSS database. Cause There are several possible causes of this problem, detailed in the \"Resolution\" section below. Resolution To assist in troubleshooting, a utility has been created to check the basic flow of data to the JobBOSS database through Data Collection. Resolutions are suggested below based on the error(s) the utility returns. For detailed information on the flow of Data Collection, please review JobBOSS - Data Collection Data Flow Troubleshooting. Troubleshooting 1. Download the attached file (TraceDC_Setup.zip) to the desktop of the Data Collection Web Service machine. 2. Double-click TraceDC_Setup.exe. 3. On the window that opens, click UnZip. This will place three icons on your desktop. 4. Double-click Edit_Path.bat. This will open the file Workstation.cfg in Notepad. Change SERVER_NAME to the name of your server. If the web service you're troubleshooting is named something other than DataCollection, you'll need to change that as well. When you are finished editing, save and close Notepad. 5. Double-click TraceDC.exe (you should see the web service defined in the previous step) and enter a valid employee ID from your JobBOSS database. 6. Click the Test Data Collection Web Service button. Compare the results you receive against the errors listed below for troubleshooting - if no errors are returned and you're seeing the Service Unavailable error on the TNET Keypads, please use the troubleshooting steps in JobBOSS - DC 8.1 or greater - How to display the time and date on the TNET keypads . Error Result: A connection with the server could not be established - URL:http://localhost/DataCollection/ISAPI_DcWebService.dll/soap/IDataCollection - SOAPAction:urn:DataCollectionIntf-IDataCollection#TestForEcho Cause: Data Collection Web Service is not running. Solution: IIS Reset/Troubleshoot IIS to see if you can open the Data Collection Web Site. Error Result: The database id \"{whatever}\" is not recognized as a registered JobBOSS database identifier. Cause: GUID in DcWebService.cfg does not match a GUID in JBIDX2k.mdb. Solution: 1. Contact JobBOSS Support to open JBIDX2k.mdb and review the JB_Database table. 2. Copy the contents of the DatabaseID field for the desired database and paste it over the incorrect GUID in DcWebService.cfg (normally located in C:\\inetpub\\wwwroot\\datacollection on the Web Service Server). Error Result: Received content of invalid Content-Type setting: text/html - SOAP expects \"text/xml\" Two Possible Causes: 1. This is a Windows 2003 Server and the file ISAPI_DCWebService.dll has not been registered correctly in the IIS Server Extensions. 2. The file ISAPI_DCWebService.dll is not in the folder for the virtual directory of the Data Collection Web Service. Solution: 1. Register the file ISAPI_DCWebService.dll in the Server Extensions. 2. The file ISAPI_DCWebService.dll should be located in the JobBOSS Server\\DataCollection\\JB Web Service. Manually take a copy of the file and place it into the virtual directory for the failing web service - by default C:\\inetpub\\wwwroot\\datacollection. Error Result: Unable to connect to the database for the following reason: The Microsoft Jet database engine cannot open the file '\\\\Servername \\Client70\\jbidx2k.mdb'. It is already opened exclusively by another user, or you need permission to view its data. [Error Code: -534709256] Cause: Anonymous Web Account does not have rights to JBIDX2k.mdb. Solution: Ensure that the anonymous access account being used by the Data Collection Web Service has full control rights to JBIDX2k.mdb. Error Result: Assertion failure (C:\\Develop\\Dev\\D5\\JB2K\\Business\\B_Prefs.pas, line 2998) Cause: Anonymous Web Account does not have rights to JobBOSS.mdb. Solution: Ensure that the anonymous access account being used by the Data Collection Web Service has full control rights to JobBOSS.mdb. Error Result: Method not allowed (405) - 'http://localhost/DataCollection1/ISAPI_DcWebService.dll/soap/IDataCollection'; Cause: The Data Collection Entry Point is trying to access an incorrect Web Service name. Solution: Correct the Web Service that the Entry Point is trying to connect to in the “Verify URL\" window. Error Result: An error occurred trying to contact the server: Access violation at address 06336A46. Write of address 06336A46 Cause: The system attempting to run Workstation Driver or the Check URL utility has Windows DEP turned on. Solution: See JobBOSS - Windows DEP and how it can affect JobBOSS and Data Collection for instructions on configuring DEP to allow JobBOSS executables to run on the machine. Error Result: Class not Registered Cause: The file DCSYS.dll is not registered correctly on the web service machine. Solution: Re-register DCSys.dll by clicking Start\\Run and running the following command (modifying the path if your web service is installed to a different directory) regsvr32 \"C:\\program files\\JobBOSS\\DCSYS.dll\" (NOTE: You may need to do an IISReset after re-registering.) Error Result: The specified module could not be found Cause: The Data Collection Web Service cannot find the file DCSYS.dll in the registered location Solution: Register DCSys.dll in the directory it is installed to on the server by clicking Start\\Run and running the following command (modifying the path if your web service is installed to a different directory - you may need to search for the fie) regsvr32 \"C:\\program files\\JobBOSS\\DCSYS.dll\" (NOTE: You may need to do an IISReset after re-registering.) URL Name JobBOSS-Service-Unavailable-Error-in-Data-Collection Keywords Keywords are required and should be 1-2 words that will assist with search. Separate keywords with a comma. Data Collection; datacollection; dc; dcweb; dc web service; service unavailable; trouble shoot dc; trouble-shoot dc; troubleshoot; troubleshooting; shooting;",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355407/original/zTdrXnpSZkSqe64Md4yM0wyNpAqi1uVmKg.png?1712045553",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355411/original/jrSJm4wLmBuV4DFyUZ5MZpOAdqMLPEGL5g.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355412/original/ePNIYzE-ypFwfdXq2yjMCVIc7Hq-Gh7pkw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355418/original/NCYL5UHjNA5Qjqbp5RXp9haiG8YPFbQJpQ.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355409/original/0iIJU29Ft3swTA-DPMV162ZXIvEaluhsPA.png?1712045553",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355421/original/zRixs1JzcudLcRJzkwLa6aP1uCPZLsvkQw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355408/original/QQRMGJus88eGhwuzlLN49xEM7TgwgvwOOQ.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355423/original/mM8EpdNxgcOHOlfRHdDLXBa8ffSKgrvs1w.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355410/original/t7MW-9wHim062o2hgmG-kScfdySe3fv_yw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355419/original/Yz85eh-qHz0_lonhzfln60fBH24eva4Nhg.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355416/original/04jLys8pLDhlIv_UV-UOJmhJOIiMvSzFjw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355420/original/SQd74r1C84ipzNNAI4Onqp6KsCK2x5Ns_w.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355417/original/ILiNZ7kskRK570yckxjQvV9jfkMkgCQ9Fw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355415/original/i8ieQxc73egIimPVoj1hCdjAEDZaCxjsow.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355413/original/pMgn1XKNRHVT67A6Q2zN6ESK8vxMUOkTYw.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355422/original/5Abdl7zyPeMdJjDQNduvOQKSeQfn4JWM0A.png?1712045554",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101355414/original/6I-glevtbaTDxXkkKIV_Kzo3dh9JHZzetg.png?1712045554"
    ],
    "has_images": true,
    "image_count": 17,
    "created_at": "2024-04-02T09:10:53+01:00",
    "updated_at": "2024-04-02T09:14:59+01:00",
    "id": 103000285174,
    "tags": []
  },
  {
    "title": "JobBOSS - XML Error",
    "text": "This article is regarding a \"XML Document must have a top level element\" error message when opening Workstation Driver. Versions: All JB Versions Applies to: Data Collection customers troubleshooting Data Collection. Problem: Opening Workstation Driver returns error: XML Document must have a top level element Line: 0 Cause: Inability to connect to Data Collection web service. Causes may be one or more of the following problem areas. Problem Areas IIS/Webserver Service is not running Unable to Contact IIS/Web Server Unable to Access Workstation Driver Configuration File Workstation Driver Pointed to Incorrect Web Service JobBOSS Data Collection Web Service has been installed on a machine other than JobBOSS Server/Data Collection Web Service Authentication Resolution: Note: These will require IT/Technical skillset and some product experience. It is best to leave these steps to your IT Resource, with assistance of our Support department. IIS/Webserver Service is Not Running 1. Connect to the machine that has JobBOSS Data Collection Web Service installed (often will be JobBOSS Server). 2. Navigate to Control Panel > Administrative Tools. 3. Open Internet Information Services (IIS) Manager. 4. On left side of Object Explorer, click server name. 5. Clicking on server name will expose the Actions pane. If the option Start is NOT greyed out, then press Start. 6. Optionally, you may press Restart to restart IIS/Data Collection Web Services. Unable to Contact IIS/Web Server There can be MANY reasons for an inability to contact IIS/Web Server. While working with your IT resource, confirm that the station unable to contact IIS/Web Server is on the same LAN as the JobBOSS Server. Also validate DNS and firewall. Optionally, review 3rd party security products. Please confirm IP addresses are correct and resolve to proper host. Does this issue occur for all stations? If yes, then please review passage: IIS/Webserver service is not running Once validated web server is running, then it is time to check firewall exclusions. From an elevated command prompt on server, disable Windows Firewall as a test. To do so, execute command: netsh advfirewall set allprofiles state off To re-enable Windows Firewall: netsh advfirewall set allprofiles state on Repeat testing from client stations that are unable to connect. If stations are able to connect, then add a JobBOSS - JobBOSS Firewall Recommendations & Exceptions. Unable to Access Workstation Driver Configuration File If problem pertains to a single station/user, this could indicate an issue with user rights to workstation.cfg file. Does Workstation Driver work for Admin user but not for non-Admin user? Confirm that client stations have been domain-joined and are able to access \\JobBOSS Server shared folder. Audit permissions on C:\\ProgramData\\JobBOSS\\WSD\\Workstation.cfg. 1. Navigate to: C:\\ProgramData\\JobBOSS\\WSD\\. 2. Right-click Workstation.cfg and select Properties. 3. Select the Security tab. 4. Some customer environments may have a Users group or an Everyone group. Select a group and note the permissions in lower pane: 5. If needed, click Edit... to set permissions. 6. Select the desired group and place a checkmark in the Full Control box. 7. Click OK to close Permissions/Properties dialogs. 8. Attempt to re-test by opening Workstation Driver. Further information: Ensure machines which may be used on shop floor are domain-joined and the Windows user has at least Standard Windows User permissions on station. Workstation Driver Pointed to Incorrect Web Service First, review which Data Collection web services are currently available in your environment. 1. Navigate to \\JobBOSS Server\\Data Collection\\Workstation Driver. 2. Double-click WorkstationDriverSetup.exe. 3. At the second screen, pause and note the web services listed. 4. Audit Values returned. If value(s) returned are correct then continue with installation of Workstation Driver which will rewrite configuration. If values are incorrect, then refer to JobBOSS - Restarting IIS Web Services. 5. Once complete, execute Workstation Driver and note function. JobBOSS Data Collection Web Service Has Been Installed on a Machine Other Than JobBOSS Server/Data Collection Web Service Authentication The below excerpt is copy/pasted from JB 2018 SP3 Appendix C of JobBOSS installation and Upgrade Guide 2018 SP3.pdf. You may choose to install the Data Collection Web Service on a computer other than the JobBOSS Server or in addition to the JobBOSS Server (if multiple instances are required). After installing the Data Collection Web Service on a computer that is not running JobBOSS Server, you must ensure that the IIS user has network rights to access the JobBOSS Server folder. JobBOSS recommends creating another network user with these parameters: User name IUSR_DC Access rights to the JobBOSS Server folder on the JobBOSS Server computer Password never expires (if possible) To set up web services to use IUSR_DC (or whatever user you create, as recommended above): 1. On the computer where the JB DC Web Service installed, go to Control Panel > Administrative Tools and double-click Internet Information Services (IIS) Manager. (Do not double-click Internet Information Services (IIS) 6.0 Manager. This is the previous version of IIS.) The Internet Information Services (IIS) Manager window will open. 2. Open the Data Collection Web Service (JBDCWebService): On Windows 7, 8, or 8.1 client OS, expand Local computer name (top level in tree) > Web Sites > JBDCWebService. On Windows Server OS, expand Local computer name (top level in tree) > Sites > JBDCWebService. 3. Click the Data Collection Virtual Folder and select Properties. The Virtual Folder will be called “DataCollection”, by default, for the first single-database installation of the Data Collection Web Service. The Virtual Folder will be named per the JobBOSS database it links to (PRODUCTION, TRAINING, etc.), by default, for multiple database installations of the web service. 4. Double-click Authentication under the IIS section in the middle panel. 5. Right-click Anonymous Authentication and then click Edit. The Edit Anonymous Authentication Credentials window will appear. Click Set. 6. The Set Credentials window will appear. In the User name field, type the IUSR_DC domain user that you created. 7. Enter and confirm the password that you selected for user IUSR_DC. 8. Click OK to close the Set Credentials window. 9. Click OK to close the Edit Anonymous Authentication Credentials window. 10. Close the Internet Information Services (IIS) Manager window. You have completed the modifications needed to successfully run the JB DC Web Service on a computer other than the JobBOSS Server. If your JB DC Web Service workstation is accessible directly from the Internet, JobBOSS does not recommend giving IUSR_DC permissions to any folder other than your JobBOSS Server folder.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101363482/original/faXdVaZezgwcWOo0WjLgvzWmv4bLu23KFw.png?1712046314",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101363480/original/R1buoQoiHmnhT0jN0crh13Snwxw02xMqcA.png?1712046314",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101363483/original/zYLu1UTPukBnOCRp9H1Lzhk7FmkzhGxOaQ.png?1712046314",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103101363481/original/MC_V81TLaFAxjne6HuRpb1riwxkCkysnAw.png?1712046314"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2024-04-02T09:25:29+01:00",
    "updated_at": "2024-04-02T09:26:34+01:00",
    "id": 103000285176,
    "tags": []
  },
  {
    "title": "JOB COSTING FAQ",
    "text": "",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103107766980/original/ffgb-4z5sC3zmdMrWWtc_U3QYqDgKEfhOw.png?1713951471"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2024-04-24T10:37:56+01:00",
    "updated_at": "2024-04-24T10:38:07+01:00",
    "id": 103000289202,
    "tags": []
  },
  {
    "title": "Update Country Code",
    "text": "Applicable to user upgrading from v 11.3 only When logging on to the JobBOSS Client, if there are country codes in the Country field in Preferences, Customer or Vendor that do not match the new country codes Perform the steps below to run the Update Country Code utility if you want to replace any existing country codes with a new country code from a predefined list. These steps only need to be performed once. When a new customer or vendor is created, its Country defaults from the Country defined on the General tab in System Administration - Preferences. If the Country in System Administration - Preferences is not defined, the Country for a new customer or vendor defaults to US. 1. From a computer with the JobBOSS Client installed, browse to the JobBOSS Server to the \\JobBOSS Server\\Utilities folder. 2. Right-click CountryCodeUpdater.exe and click Copy. 3. Browse to the JobBOSS Client install location on the JobBOSS Client computer (C:\\Program Files\\JobBOSS by default). 4. Right-click in a blank area of the folder and click Paste. The CountryCodeUpdater.exe is now in the folder. 5. Double-click the file CountryCodeUpdater.exe that you copied down to the JobBOSS Client computer. The Update Country Code window appears. 6. Review the country codes that exist in the JobBOSS database that was logged on to last on the computer in the Existing Country column. 7. Click in the Select New Country field, click the down arrow and click the country name whose country code you want to replace the Existing Country code with. 8. Repeat Step 7 for each Existing Country code that you want to replace with a different country code. 9. Click Apply. The Existing Country codes are replaced with the specified new country code. 10. Click Close to close the Update Country Code utility.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-06-03T16:54:25+01:00",
    "updated_at": "2024-06-05T11:58:04+01:00",
    "id": 103000295149,
    "tags": []
  },
  {
    "title": "Setting up a UDReports DSN for JobBOSS",
    "text": "Open the ODBC Data Source Administrator Select System DSN and if UDReports does not exist you need to create it by selecting Add:- Enter the details:- Select SQL Server authentication: and enter the password:- Ensure the default database is the JobBOSS database and click Next:- Select Finish:- Select the Test Data Source button:-",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126824478/original/IykLIwwppJXey6L7papVsfaAoQSoOZCAZA.png?1719996446",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126825289/original/shE0B-lxo8oXy-wExzzks2bu7JLHTE4a4w.png?1719996504",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126827132/original/atGcg86eETCfHf0QBZ7iiUrlBiWZvaT73g.png?1719996683",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126827240/original/bvMB6uuvep2KOTCMZhVZu1W5MlX5HskSsA.png?1719996696",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126827427/original/P9izSnQmF0ohlfX3qt86g4cT9D55lBY2kQ.png?1719996710",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126827629/original/zXGZMCdKhXsGiRKn4oBFwlPa16BPIVvLlg.png?1719996726",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126828043/original/CqJVWhClMDPuXHRY6FvjU-mAI-uHzSW9BA.png?1719996764",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103126828191/original/7ObxRJff_OVkohH3deGkQDsCqrhUQwgJig.png?1719996775"
    ],
    "has_images": true,
    "image_count": 8,
    "created_at": "2024-07-03T09:58:46+01:00",
    "updated_at": "2024-07-03T09:58:53+01:00",
    "id": 103000300958,
    "tags": []
  },
  {
    "title": "JobBOSS - Using JobBOSS from Remote Locations",
    "text": "Versions JobBOSS 11.7 and Higher Module(s) JobBOSS Client Applies to Users interested in using JobBOSS or Workstation Driver from a machine that is not part of the LAN their JobBOSS Server resides on. Question What is the best way to implement JobBOSS on a machine that is not on our network? Answer There are several ways to implement JobBOSS on a machine that is not part of your network. Generally these decisions should be made between the JobBOSS User and their I/T Support to ensure the necessary support will be available for implementing the remote solution. JobBOSS Support cannot assist in establishing the remote connection as it is a network support issue, nor will Support assist in troubleshooting performance issues through a multi-site setup. However, Support can provide the following recommendations: Understanding Client/Server Applications versus Local Data Applications The difference between a Client/Server application like JobBOSS and a program like Microsoft Word is how the data is handled when editing. Client Server Apps like JobBOSS, ACT!, or GoldMine (to name a few) have a central database that several people can utilize at once. Data is written directly into the live database “real time”. Programs like Microsoft Word or Excel actually open a temporary local copy of the file is being edited. Only one person can edit a file at once. The changes to the file are passed back to the server when the user chooses to save. Because of the \"live connection\", a Client/Server application is dependent on a solid network/Internet connection between the two systems and can behave strangely if this connection is compromised. The solution we do NOT recommend: VPN VPN (Virtual Private Networking) is one solution that is often asked about. VPN is a function built into Microsoft Operating systems that allows a PC to connect in and become “part of the LAN” using the Internet as the connection conduit. Generally speaking, VPN is not a viable solution for hosting any Client/Server application. Because client server applications are writing data directly to the live database and the inconsistency of the Internet as a network connection, Client Server Applications may experience slow performance. Because all JobBOSS databases are now SQL-based, previous concerns of potential data corruption when using VPN has diminished. However, even with that risk aside, using VPN as your connection to the JobBOSS database, you may still see unexpected crashes or very slow performance. VPN with JobBOSS If you are adamant about trying to use VPN for JobBOSS, it is strongly recommended to bring the PC that will be running JobBOSS into the location where the JobBOSS Server resides, and join it to the LAN to get the JobBOSS Client installed from a local connection, rather than trying to install over VPN (installing via VPN can literally take hours). Again, JobBOSS Support will not assist with performance issues in this kind of setup. VPN with Terminal Services/Remote Desktop Where VPN does become a good solution for remote use of JobBOSS is if you are using VPN in connection with Remote Desktop - so you use VPN to make the connection to your JobBOSS Network and let VPN handle the connection and security. Then, once connected, you can use Remote Desktop Services to connect to either a Terminal Server or a Workstation that is part of the LAN where the JobBOSS Server resides. Because the data is not traveling across the internet in that setup (only a light video stream of your controlling the remote session), performance is generally not an issue. If you get disconnected due to Internet connectivity issues, there is no problem with the JobBOSS setup, because that is all local and just being connected to. Remote Desktop does not require the use of VPN, but it can be used as an option to manage the security. Better Solutions – Remote Session Software For the best experience with remote use of JobBOSS, we recommend either implementing a software that allows you to either run a remote session of JobBOSS (Terminal Server or Citrix) or take Remote Control of a PC that has JobBOSS on it (i.e., Real VNC, TeamViewer, PC Anywhere, or GoTo My PC). The remote machine connects in to the client machine and sees a session window of what is happening, but the actual data processing happens “back in the office”. These solutions allow for the interruptions of connecting via the Internet, again, leaving all of the data local to the LAN where the JobBOSS Server resides, providing a better performance solution.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-08-19T16:47:58+01:00",
    "updated_at": "2024-08-19T16:48:00+01:00",
    "id": 103000308513,
    "tags": []
  },
  {
    "title": "JobBOSS - General Information Citrix Server or Terminal Services",
    "text": "General Information about using JobBOSS over a Citrix Server or Terminal Services This article contains general information on using JobBOSS over a Citrix Server or Terminal Services. Versions All versions of JobBOSS Applies to Terminal or Citrix Server use for JobBOSS Clients Question I'm thinking about going to a Terminal Server/Citrix Server deployment for JobBOSS. What should I consider and what do I need to know? Answer JobBOSS and Workstation Driver will both work without issue hosted over either of these environments. Both of these solutions are a method of using a Windows Server to host an application to client machines over your LAN or the Internet. The actual work and processing done in the application happens on the Server, using the RAM and Processor of the Server. Additionally it allows PC workstations to have a longer lifecycle, because the processing of the application happens on the server and the clients simply view \"a screenshot\" of what is happening on the server. Many JobBOSS customers also like the fact that this setup has the benefit of centralized client upgrade/installation When configuring a Host Server, you will need to consider the specifications to ensure you have enough processing capability to host the desired applications. Typically you would want to allow a minimum of 1 Gigabyte of RAM for the Operating System alone, and then apply a \"100, 200, 300\" rule for JobBOSS users that will be connecting in: 100 Megabytes of RAM allocated per concurrent Workstation Driver only session, 200 Megabytes of RAM allocated per concurrent JobBOSS session, 300 Megabytes of RAM allocated per JobBOSS session if the JobBOSS user is a scheduler. This is in addition to the RAM needed for any other applications being hosted on Terminal Services. Microsoft does not recommend a Terminal Server hosting any other functions (i.e. Exchange, Data Server, SQL, etc.) but instead suggests deploying a Terminal Server as a large shared workstation. If a you choose to implement a hosted environment, it does not mean you cannot have locally installed clients. You may use a combination of \"fat\" and \"thin\" clients with no problem. However, when you upgrade, any machine that has the JobBOSS client directly installed on it will need to be updated. These solutions have the capability of hosting the application both to your internal network as well as - with the proper network and security setup - hosting the application to machines outside of your network as a remote site or work-at-home solution. Please consult your I/T Service Provider for assistance in configuring network security. Rather than using PCs to connect to the hosting server, you may also use Thin Client Hardware (Wyse Terminals or the like) or a combination of Thin Client Terminals and PCs to access the host. Thin Client Terminals are simply another hardware method of being on the network and connecting into Terminal Server via Remote Desktop. It is not supported to install JobBOSS applications directly to the embedded OS a thin client terminal. Regarding installation, simply install the JobBOSS client or Workstation Driver as you would any other shared application on the host server - using the same install file as you would for any JobBOSS Client. Some information about installing on a Terminal Server can be found in Appendix B of our installation instructions. JobBOSS is not supported for use in \"hosted application\" mode. This is a mode of Terminal Services where users don't see the desktop of the Terminal Server, they only see the application. Because JobBOSS actually invokes other products (like the ShopAlerts Client) as part of its standard operation, users need to be able to see the full desktop for optimal use. Exact Support supports JobBOSS products running on the operating systems as specified in our compatibility document. When dealing with a Server-class OS, whether that server configured as a Terminal or Citrix Server does not matter. But, Exact does not support the hosting specifically. Our assistance goes as far as validating the product at the console of the Hosting Server while logged in as a standard user. If the application works at the console, anything that does not work through a session is up to a customer's I/T resources to resolve. Finally, the most common issues found with these hosted environments relate to Windows security rights. JobBOSS users will need the same rights on a Terminal Server that they would need to run JobBOSS successfully on a workstation.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2024-08-19T16:58:18+01:00",
    "updated_at": "2024-08-19T16:59:04+01:00",
    "id": 103000308531,
    "tags": []
  },
  {
    "title": "JobBOSS - Making Changes to a Material Master Record",
    "text": "Versions 11.5 and greater Applies to Making changes to existing materials. Scenario You no longer use a certain material and would like to delete a material through System Administration > Material, but JobBOSS will not allow you to because there are records related to this material. You need to change the stock or purchase unit on a material but the dropdowns are grayed out. Cause Once a material has been used and there are permanent records associated with database tables, you will no longer be able to delete this material or update the purchase or stock units. Once a material has related records (Transfers, Adjustments, Purchase Orders, or it has been used on Jobs or Quotes, etc.), you will no longer be able to delete the material or make certain changes. Resolution If a material has been minimally used (no activity aside from Adjustments and Location Transfers) this utility may be able to be delete that activity and then make the necessary changes or delete this material. Otherwise, set the Status of this Material to Inactive and also ensure to set the On Hand Balance to 0 so Stock Status and Stock Valuation Reports do not include this material.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-01-31T13:45:02+00:00",
    "updated_at": "2025-01-31T13:49:54+00:00",
    "id": 103000332458,
    "tags": []
  },
  {
    "title": "JobBOSS - Purging a new material from JobBOSS - Material Killer",
    "text": "Versions: 9x to 2018 SP4 (Note:This utility will not work with version 2020 or higher) Applies to: Material and Raw Stock Sizes. Problem: Materials have been entered incorrectly into JobBOSS and need to be removed Cause: New JobBOSS users frequently find that they need to set up Materials and Raw Stock items differently. “Bad” material records exist with no significant activity; it is sometimes desirable to purge these. The JB_MaterialKiller.exe program allows materials with no activity aside from Adjustments and Location Transfers to be purged from a JobBOSS database. Resolution: Please make sure all users are out of the JobBOSS database. Back up the JobBOSS database. Unzip and run the utility file on any workstation with JobBOSS installed. Depending on database type and size, it may take a minute or two for the utility to list material records. Select materials you intend to delete and click the Delete button. NOTE: If you do not see a material on the list, it has activity against it that may show on the Material Control - Where Used report. Removing this activity, if possible, can allow the material to show in the utility. You will need to close and re-run the utility to refresh the list.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-01-31T13:46:41+00:00",
    "updated_at": "2025-01-31T13:48:48+00:00",
    "id": 103000332459,
    "tags": []
  },
  {
    "title": "Find and Replace Utility Overview",
    "text": "The Find and Replace Utility is used to: Change the ID of a customer, employee, material, vendor, work center, location, GL account number, bank code, tax name, or sales code anywhere it is used within JobBOSS Merge the IDs of customers, vendors, work centers, tax names, or sales codes Before using the Find and Replace Utility: Verify that the version of the utility matches your JobBOSS version. Using the wrong version of the utility can affect the integrity of your database. Notify all users to log off of JobBOSS. Back up the JobBOSS database that will be affected by the Find and Replace Utility. The Find and Replace Utility does not allow you to undo your changes. If a mistake is made, you can restore the database from the backup file, then make the change as originally intended. See the following topics for more information: Replacing an Existing ID with a New ID Merging an Existing ID into Another Existing ID What Should I Consider When Using the Find and Replace Utility? IDs in JobBOSS Data Collection transactions are not changed. If you have multiple databases, the Find and Replace Utility uses the last database that was logged into on the computer where the utility is run. The Find and Replace Utility must be installed before use. JobBOSS recommends installing the utility only on the computers of personnel who have the authority to make mass database changes. For installation instructions, see the installation guide for your version of JobBOSS Use the Find and Replace Utility during your non-peak time (such as a weekend) because: JobBOSS strongly recommends that all users be logged off of JobBOSS before using the utility. There cannot be any unprocessed Data Collection transactions. Scenarios that may require you to run the Find and Replace Utility: The inventory area in your shop has been reorganized, and a more meaningful naming structure has been implemented. Work centers have been combined into different groupings than are currently set up in JobBOSS. A customer is now owned by a different company. You continue to do business with them, but your information within JobBOSS needs to reflect the new ID. Two or more customers were set up but are actually the same customer, and you would like to combine them into one record. Both have customer invoices, deposits, and so on. Two or more vendors were set up but are actually the same vendor, and you would like to combine them into one record. Both have vendor invoices, payments, and so on. You've been using JobBOSS and Intuit QuickBooks separately, and you recently purchased JobBOSS Integration for QuickBooks. With the integration, your customer and vendor IDs must be identical in JobBOSS and QuickBooks. The following process is recommended: Analyze your JobBOSS customer and vendor lists for any discrepancies. Use the Find and Replace Utility to update an ID in JobBOSS. When the JobBOSS IDs are set, reprint the customer and/or vendor list. Use the updated lists to modify any QuickBooks customer or vendor names so that they are identical. If you are renaming or merging work centers, you will still need to verify the new settings (such as capacity hours, and Setup and Run labor rates) in System Administration - Work Center. Only the work center's ID is changed when using the Find and Replace Utility. If you are merging work centers, the shifts and employees assigned to the Merge From work center are copied to the Merge Into work center, removing any duplicates. Shift overrides and auto links defined on the Merge From work center do not copy over to the Merge Into work center. How Do My Actions Here Affect Other Areas of JobBOSS? Throughout JobBOSS: The Merge From IDs are changed everywhere in JobBOSS except for JobBOSS Data Collection transactions. Integrations: If you use an accounting solution other than JobBOSS Accounting, you are responsible for making the corresponding change in your accounting software. If you own Exact Synergy Enterprise, you can use the Find and Replace Utility on customers and vendors: Customers or vendors can be renamed in JobBOSS and Exact Synergy Enterprise using the Find and Replace Utility. If you need to merge customers or vendors in JobBOSS and Exact Synergy Enterprise, you must manually merge them in Exact Synergy Enterprise before using the Find and Replace Utility to merge them in JobBOSS.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-03-10T09:07:45+00:00",
    "updated_at": "2025-03-10T09:16:30+00:00",
    "id": 103000338964,
    "tags": []
  },
  {
    "title": "Replacing an Existing ID with a New ID",
    "text": "You can use the Find and Replace Utility to: Change the ID of a customer, employee, material, vendor, work center, location, GL account number, bank code, tax name, or sales code anywhere it is used in JobBOSS. Change multiple material IDs at once using a text file. For example, you might need to do this if one of your customers changes the name of its business. If the ID you want to change it to already exists in JobBOSS, see Merging an Existing ID into Another Existing ID instead. What happens when I replace an ID? Before using the Find and Replace Utility: Verify that the version of the utility matches your JobBOSS version. Using the wrong version of the utility can affect the integrity of your database. Notify all users to log off of JobBOSS. Back up the JobBOSS database that will be affected by the Find and Replace Utility. The Find and Replace Utility does not allow you to undo your changes. If a mistake is made, you can restore the database from the backup file, then make the change as originally intended. To change an exiting ID to a new ID: Open the utility. (Steps vary by your computer's OS. For example, navigate to Start > All Programs > JobBOSS > Find & Replace Utility.) If you cannot locate the utility, contact your system administrator. The Find and Replace Utility might not be installed on your computer. In the Select field, choose the type of ID that you want to change. Select the Create New option. In the Old Value field, select or paste the ID that you want to change. In the New Value field, type the ID that you want to change it to. Click the Apply button to preview the changes in the table. If the New Value ID already exists in the JobBOSS database, a warning message is displayed. Additionally, if that pre existing ID is for a customer, vendor, work center, tax name, or sales code, and the correct ID already exists, use the Merge option instead. (See Merging an Exiting ID into Another Existing ID.) Verify that the pending changes are correct, and reject any undesired changes: In the table, highlight the undesired line item. Click the Remove button. Optionally, repeat steps 2–7 until all the necessary changes have been entered and verified. Click the Process button. The IDs are permanently changed in the JobBOSS database. Click Exit to close the Find and Replace Utility. Users can log back in to JobBOSS.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-03-10T09:12:57+00:00",
    "updated_at": "2025-03-10T09:21:23+00:00",
    "id": 103000338967,
    "tags": []
  },
  {
    "title": "SIIM Export Error during processing - Cannot load document for export",
    "text": "This error can be a result of a duplicate address for the Customer in JobBOSS. The K3 PIIM product reads upper and lower case characters as the same. i.e. JOBBOSS; jobboss is a duplicate. Create a K3 Portal ticket as the support team will be required to amend the SQL database to change the duplicate.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103200451762/original/bXqc1mFmiMpvQtOhTWMBKQ2Za-GCnzBR4g.png?1742565829"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2025-03-21T15:09:12+00:00",
    "updated_at": "2025-03-21T15:25:33+00:00",
    "id": 103000340979,
    "tags": []
  },
  {
    "title": "JobBOSS - Troubleshooting Cash Flow Module error",
    "text": "Problem Attempting to open the Cash Flow Module and it errors out, perhaps even locks up the computer/forces an exit. Resolution Log into JobBOSS Switch to a different database than the one that errors out. Select the Cash Flow module Assuming it opens error-free, access the Data Included button and uncheck every box. OK Close the Cash Flow Module Switch back to the database having the problem opening the Cash Flow Module. Try to open the Cash Flow Module. It should open error-free as it is only now trying to load the open cash, payable and receivable balances. Access the Sources button Select the first inflow OK The module should now include the selected item in the results. If it presents the data error-free, go back to Sources. Select the next inflow OK Repeat these steps until you find the 'Source' that causes the Cash Flow Module to error out. The data for that particular item will need to be evaluated to determine what is ultimately causing the error.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103214606832/original/7tz5uqvQy93VAKNjTtN6yLjvcz8vPYNlMQ.png?1747211985"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2025-05-14T09:40:16+01:00",
    "updated_at": "2025-05-16T11:18:24+01:00",
    "id": 103000353256,
    "tags": []
  },
  {
    "title": "JobBOSS - Performance issues - Data Clean Up Recommendations",
    "text": "JobBOSS - Performance issues - Data Clean Up Recommendations This article is regarding performance issues after updating to 12x or greater. Applies to Customers receiving \"Out of Memory\" errors, unable to enter modules, modules do not load, receiving errors after update going into modules, reports that do not complete, a delay in searches, or extended wait time for reports. Cause New user interface components were added in JobBOSS version 12 and higher. These grids interact with data and system resources differently than previous JobBOSS versions. Resolution The latest release will have the most current fixes relating to these UI components. If you are not on at least 17.0, we suggest you update JobBOSS. The following information serves to aid in cleaning up open, old, or otherwise irrelevant data, which could be returned when running reports or attempting to use modules in the software. Step 1: Job Entry Module Close all Jobs that are no longer in process. JobBOSS will never automatically close a job. The status will automatically change to Complete, but that does not close out the material requirements on the job. Close all jobs that are finished. Most JobBOSS users will close a job once they receive final payment from their customer, though it is sometimes closed earlier. The Convert Jobs feature from the JBUtil.exe Utility set on the customer portal allows you to close multiple jobs at a time. The utility is in \\Utilities within your JobBOSS Server share. This utility allows you to narrow your search by status and date. Start with closing all jobs that are currently in a status of Complete and run it in batches by date. Whether that’s one month at a time or one year at a time is up to you. Keep in mind that Windows may state that the utility is Not Responding. Ignore that indication; it will eventually finish on its own. If you must end the task, use a smaller date range the next time so you have a smaller set of jobs to close. If you are closing large batches (more than 20 at a time), then Support suggests running the Utility after hours as it may slow down JobBOSS for everyone. Step 2: Run Data Doctor and Mass Close POs features from the JBUtil Utility Set Within Data Doctor are several queries that fix common data inconsistencies in the application. The Mass Close POs feature simply closes all PO Header lines that have all lines closed. Data Doctor is found in JBUtil.exe, included in the JobBOSS Server\\Utilities shared folder on the server. (JobBOSS 12.1 and above) Step 3: Purchase orders Check Open Purchase Orders. Close any Old POs that are no longer valid. There are no utilities to auto close purchase orders; this must be done manually. To find open POs, you can search within the module and change the status filter to Open, OR run a Purchase Order Summary report and select Open status. Step 4: Quotes Quote status will never change on its own, unless it is copied from a quote to a job; then the line status will change to WON. Line and header status do not change on their own under any other circumstance. Quotes that are active will be queried in modules such as ShopStats. Improper quote management will lead to inaccurate data and a \"bloated\" dataset, which results in longer times to wait for results. JobBOSS - Utility for Quote Expiration contains two utilities which can be used to help you manage your quotes. Step 5: Sales orders Sales order status will only change when: A line is shipped; then the line is updated to reflect shipped. If partial shipment; then the status is set to backorder. Once invoiced, the SO status will update to closed. It is suggested to review open SOs to validate the system is correct. Step 6: Database Maintenance Your data is one of the most important assets of your business, and we want to ensure that your JobBOSS and other softwares are properly backed up so you can focus on other aspects of running your shop. Since every manufacturing shop could have a different server setup, software version, number and type of applications running, and backup schedule needed, we are requiring that customers acknowledge they are using dedicated backup software before updating to the latest version of JobBOSS. Just the same as you trust JobBOSS to be your shop ERP, we want you to back up your data with software from a company that focuses resources on building and maintaining backup software to protect you from failures, outages, and unplanned disasters. JobBOSS uses databases to store your data. These databases are managed via a product called Microsoft SQL. Microsoft has recommended maintenance for databases. JobBOSS does not run this maintenance for you. It is generally something that your IT staff sets up, manages and monitors; it isn’t something that the JobBOSS Support staff does for you. The tasks are at minimum: Backup of the SQL Database Truncate and Shrink of the Log file Reindex of the main database file If you do not have an IT Resource capable of performing these tasks, we have Technical Consultants in the Professional Services department that can assist you. These services are billable. If you would like a quote, contact your Account Manager at 1-800-777-4334. Should you wish to continue using this utility, it is provided 100% as-is. Support has been instructed to provide no support for this utility. See Progression - SQL 2005/2008 Client Network Utility with Progression. Step 7: Financials tab AR and AP invoice data are reported here. If the Financials tab is generating errors, we suggest you audit your AP/AR performance, as well as Banks within JobBOSS. To review AP/AR performance under reports, in JobBOSS browse to Accounts Receivable > AR Aging and Accounts Payable > AP Aging. These reports will return aging information and report what is outstanding. The Cash section within Financials tab returns balances in accounts that are set up within System Administration > Accounting Preferences > Banks tab. Step 8: Environment It is common to see performance issues with the JobBOSS product as the result of a misconfigured/improper environment. Consider network medium, raid level, disk type, hardware, and load. From Support we do not audit your environment for these issues; this would be the role and responsibility of your IT resource. If you are having issues with a new installation of JB, we first suggest that you carefully review the first time install documents. If this is an established environment, start with reviewing system resources and Windows Event Viewer for events pertaining to your environment. Ensure there are no events for active directory, time, or DNS. Audit your antivirus and backup software schedules. If you have a problem statement that JobBOSS is slow at a certain time of day, then we recommend that you review these areas within your environment. We would further suggest reviewing MS best practices relating to Windows features/roles and SQL Server. JobBOSS does not have any scheduled tasks which run in standard configuration. Performance is extremely subjective. When tracking a performance issue, one thing to note is if it occurs for all or some JobBOSS users, or on all or some Windows stations, and even on the server itself. Use a stopwatch as a guide (to measure).",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-05-16T12:57:04+01:00",
    "updated_at": "2025-05-16T12:57:13+01:00",
    "id": 103000353527,
    "tags": []
  },
  {
    "title": "JobBOSS - Vendor Reference Change in Function",
    "text": "Versions JobBOSS 2020 SP1 Applies to Customers who have updated to JobBOSS 2020 SP1 or new, and now note that a vendor reference is no longer displayed on the Material General Tab Problem There was a change in product functionality around Vendor References for materials. This change will now allow for Vendor Specific references to be used on a per material basis. A valid Vendor and reference is now required. Cause N/A Resolution This functionality now requires a Vendor and Reference to be specified on the Vendor tab of the material. Vendor references without an assigned vendor will no longer display a reference on the General tab. This will now allow for Vendor Specific references to be utilized, for example when generating a Purchase Order and toggling a vendor you’ll now note the Vendor Reference will change with a Vendor change. To set a Vendor reference: Log into JobBOSS and navigate to module: System Administration > Material Load material in question Click into Vendor tab. Click + icon and select Add Vendor In the Vendor Selection window, locate and select a Vendor then click OK Add the reference for this Vendor If desired, set Lead Days, Unit Price, Purchase UofM, and Minimum Qty Click Save If desired, click into General tab and set a Primary Vendor and click save.",
    "category": "JobBOSS Customer Help",
    "subcategory": "JobBOSS",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2025-06-17T14:04:05+01:00",
    "updated_at": "2025-06-17T14:07:17+01:00",
    "id": 103000356500,
    "tags": []
  }
]