[
  {
    "title": "Navigating your Purchase Orders",
    "text": "TABLE OF CONTENTS Orders Tab Viewing an Existing Purchase Order Viewing linked CSR Document Viji Graph CSR Commitments Linked Sales Orders Archive Purchase Orders Welcome to the Purchase Orders page! Here, you can view a comprehensive list of all your Purchase Orders. Whether your Purchase Orders were automatically generated or imported using the Import feature, you can easily access them all from this page. If you require further information on how to import Purchase Orders, you can simply click the \"?\" icon on the Purchase Orders Page. Orders Tab On this page, you can view a comprehensive list of all your existing Purchase Orders, including their corresponding Reference, Seller, and Order Date details. NOTE: Your order lines will be included automatically once you import your orders into the system. Additionally, if you have any Purchase Orders associated with an alias, they will be indicated in the alias column. Viewing an Existing Purchase Order If you have existing Purchase Order lines you can view more details by simply clicking the reference name this will take you to Purchase Order Details. From this page, you can access various layers of information, such as CSR Commitments, Linked Sales Order Lines, and ViJi Graph. Here are some descriptions of the information displayed: Item ID: This serves as the Purchase Order Reference. Classification: This indicates the product type, such as T-Shirt or Jacket. Season: This represents the seasonal range ID. Item CSR Documents: A Red Flag indicates that the document is missing, while a Green Flag signifies that the supporting documents have been uploaded. ViJi Graph Tab : This is a structured view of your supply chain. CSR Commitments: The CSR documents linked to these Purchase Order Lines, which you can view from this tab. Linked Sales Order Lines: Shows the lines attached to your Purchase Order Lines. Viewing linked CSR Document NOTE: If you don't see any linked CSR documents you will need to link them as instructed via the \"Linking CSR Documents\". 1. To view a Linked CSR Document simply click on the CSR Document to view. 2. The CSR Document will pop up in a window for you to view. To close simply click anywhere off the CSR Document. Viji Graph The ViJi Graph uses a 'tree' structure that allows suppliers to track products through the supply chain. Users can see where their products came from and any relevant sustainability or quality information. However, the information is limited to products and suppliers directly connected to the user in the supply chain CSR Commitments This tab shows you the commitments associated with the item along with their status. Linked Sales Orders If you've linked any Sales Orders to your Purchase Order, you can view them by going to the Linked Sales Order Lines tab. It's important to note that you'll need to create the links between the orders for them to appear on this list. For further information on how to Link a Sales Order to a Purchase Order. Archive Purchase Orders As a brand user, you can use the 'Archive' feature to manage your Purchase Orders. Whether a season has concluded or you no longer collaborate with a specific supplier, archiving allows you to organize and streamline your records effectively. There are three status rules based on the user, whether they are a brand or a supplier. These rules are outlined below: As a Brand: The brand can identify which lines are archived, providing essential information for multiple users within the account. As a Supplier: The supplier is informed about which line linked to a Sales Order from the brand's Purchase Order has been archived. A Supplier viewing Sales Orders: The supplier is aware that the line linked to a Sales Order from the brand's Purchase Order is archived, and the linking action is disabled. 1. To start, go to the page where your Purchase Orders are located. 2. Utilize the checkboxes to choose the Purchase Orders you want to archive, and then, using the \"Actions\" button, opt for the \"Archive\" option. 3. You will now see the \"Status\" has changed to Archived. NOTE: You can easily 'Unarchive' Purchase Orders when needed. Just follow steps 1 and 2, and select the 'Unarchive' option from the 'Actions' menu.",
    "category": "ViJi Track Documentation",
    "subcategory": "Purchase Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054268074/original/3puFgDtGynXdVAcDplUBz7-WaddSE-PCtw.png?1696506175",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054269911/original/ZyuL0PmgUnaWCf25JNhzjgakwVj6Sx6oHQ.png?1696506404",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054271457/original/XHs0Ydd9YfqB51OwSG3BjQaEAyBR3yPUng.png?1696506616",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054319029/original/yqjfPmCEgS-KBQzCLFaKfDH2Ub4STUODjw.png?1696512423",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054319391/original/ZY5huM0fLXFwjgqZz63vPba3YjEw3Rwb2w.png?1696512459",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054327689/original/1tDPqqAy-2SptPRkX_7QaV3M79Q3Ut_xeQ.png?1696513381",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054328657/original/GpSWdy0U3prPVc_Hg-U6SK7MJtj1dS28Hg.png?1696513518",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054325624/original/t2vS1Ju1v_3Mu7zLZJ-p1qWQpKaPuMDiKw.png?1696513177",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103073100568/original/TFvzVDKc_K4ZgJqP9ZojQb-PLRDYj3UMLA.png?1702552038",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103073100363/original/-F__fHDi1RX78f8yEww31XsZn8zPLQV7ZA.png?1702552017",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103073100117/original/u9gc3ipbuAaYDzaE2dhf1xnUBmB056FjKg.png?1702551985"
    ],
    "has_images": true,
    "image_count": 11,
    "created_at": "2023-04-13T13:28:24+01:00",
    "updated_at": "2024-02-15T11:33:11+00:00",
    "id": 103000098178,
    "tags": []
  },
  {
    "title": "Uploading Purchase Orders",
    "text": "Being able to Import your purchase orders allows you to streamline your procurement process and save time and resources. This process is faster and more accurate, as it eliminates the risk of human error that can occur during manual data entry. When you import your Item(s), orders, and suppliers into ViJi, it will be automatically uploaded and the this information into your VijiTrack. Your suppliers will then receive an email to link their purchases with their orders using Viji Track, which starts the creation of your supply chains. Uploading Purchase Orders TABLE OF CONTENTS Download Template Populating the Template Importing the Template Purchase Order Details Purchase Order Line Details Failed Import Download Template To begin importing your Purchase Orders click \"Download Template\". Populating the Template NOTE: Always make sure you are using the latest template. If you are uncertain, use the \"Download Template\" function. Save the preconfigured Excel sheet to your computer with a suitable reference. You'll need this reference when you import the sheet. NOTE: Please refrain from adding additional fields or modifying the titles within the provided Excel sheet, as it has been specifically configured for ViJi Track. When populating the template, include as much information as possible to avoid errors when importing into Viji Track. The following fields must be filled in to avoid import failures: Supplier Email: This must be a valid full email address. Quantity: This should be a positive numeric value, limited to 2 billion. NOTE: If you are unsure of the field titles and the required format we have provided a guide within the template simply click the EN/FR tab. Importing the Template To upload your populated template, click \"Import\". A pop-up window will appear. Attach your populated template, and then click \"Upload\". Should the following warning appear during the upload of your Purchase Orders, you will need to download the most recent template. When you have a supplier whose name closely resembles another, the system will prompt you to determine if they could be considered an alias*. You will then receive a list of options to choose from. If it is an alias, simply check the box next to the primary supplier associated with the alias and click \"Create Alias\". NOTE: The term \"alias\" is used in this context to refer to a name that is similar to another but represents the same entity. In case the supplier is not an alias, you have the option to click on the \"Create new supplier\" button. NOTE: If the \"Create new supplier\" button appears grayed out, ensure that you have deselected any aliases from the list of options provided above. After importing your template, a pop-up will show the estimated upload time. Once uploaded, you'll receive an email notification. You can access your Purchase Orders on the Purchase Order page using the reference name you saved them under. NOTE: Importing your purchase orders will trigger new \"CSR Commitments\". Purchase Order Details On the Purchase Order details page, you can see the sales information, dates, and seller information, along with the list of associated item(s). To get more details about a particular item(s), click on the \"View\" button next to its corresponding item(s) line, and you'll be taken to the Purchase Order Line Details page. Purchase Order Line Details From this page, you can view your CSR Commitments, Linked Sales Order Lines, and ViJi Graph. CSR Commitments: This tab is the CSR documents that are linked to these Purchase Order Lines, and you can view and download them from this page. Linked Sales Order Lines: This tab refers to the lines you have linked to your Purchase Order Lines. ViJi Graph: This is a structured view of your supply chain that you can also access from this page. Failed Import If your import fails, you will receive an email notification, and the details will be available on the \"Import List\" tab. To access this tab, navigate to \"Purchase Orders\" and click on \"Import List\". Here, you can view various details, such as the time of the import and the person who imported it, along with the reasons for the import failure. To see more information about a failed import, click on the highlighted file name to view a summary. On the summary page, you will see in detail which cells from the template were missed. For example, if the supplier email was missed, it will be indicated by the \"Field Name\" and the corresponding cells under \"Cell Address\". To fix the import failure, fill in the missing information in the template and re-import it into Viji Track.",
    "category": "ViJi Track Documentation",
    "subcategory": "Purchase Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039136893/original/wey92TTGsBA9cWpaJmlubSgg0vRwryqOKg.png?1690471532",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039137737/original/XMyAnuL1WoEN79JfDqydsedqCnqZ4MCQeA.png?1690471699",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031118220/original/1___VmIBz0TQFNb7dNxVBuzR0u375KUQlw.png?1687255199",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039138401/original/-eoBH_RNIf6tror6IL8AcCKCU7YxUUtARQ.png?1690471798",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064147516/original/1nbAS6dzZZuqJp_utNilSzdxrfM6Cn2Phw.png?1699891953",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039149424/original/D0yYu79yeWxOwWh-iV1FRCiz0E856XRthA.png?1690474739",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039138023/original/opsXFMEIgfm3Bg82c_MW8n3WH4qJD7HEqQ.png?1690471742",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039138130/original/Le9wGffoOT4msjiqbB05ejdwn-PHkkgWqw.png?1690471755",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039152114/original/pKAhXjlM-PFil6OsnoGgM0doYK7YcPoDWg.png?1690475794",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103039152196/original/aahbaT1ROBVnDRcZFC9-TcBqVllhf2Q8VA.png?1690475833",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103022741394/original/qQm4gStZTuVbocjlwxNXxPdXOY_qWaNGvA.png?1683297140",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103022742120/original/NHeT62PlNVXPi1vi0YV0Xk6paz4h7FUfKg.png?1683297330"
    ],
    "has_images": true,
    "image_count": 12,
    "created_at": "2023-04-13T13:28:55+01:00",
    "updated_at": "2024-07-19T17:56:08+01:00",
    "id": 103000098179,
    "tags": []
  },
  {
    "title": "CSR Profile",
    "text": "The CSR Profile is designed to allow your entity to provide comprehensive information so that ViJi Track can develop a more precise understanding of your CSR practices and better track your progress towards sustainability goals. Please fill in the required fields and click 'Save'.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Profile",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055955459/original/1fbvgypKGra1ZkihOY6H2vN8ioorKjUTeQ.png?1697033993"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-04-21T14:28:23+01:00",
    "updated_at": "2024-07-19T17:56:09+01:00",
    "id": 103000102977,
    "tags": []
  },
  {
    "title": "Processes",
    "text": "The Processes page is where you can assign your processes which are relevant to your specific entity type this ensures compliance with AGEC regulations. From the CSR Profile page select the \"Processes\" tab. Here you will see a list of processes that are specific to your entity. Select the relevant processes and click \"Save\". Editing Your Processes: To edit your processes, first, identify and choose all the processes that align with your particular activity or requirements. You can do this by highlighting the corresponding checkbox next to each process. After selecting your desired processes, click on the \"Save\" button to confirm your choices. NOTE: If you need to remove or amend one or several of your selections, you can do so by unselecting the checkbox next to the process you wish to amend and clicking Save again.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Profile",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103062226371/original/4PHd50R8xsb7Le4b1bK7GcQYBZ0PQzMwvQ.png?1699262564",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103051045603/original/tZ_wfL5CKTOxIKrxToM_n8RzCRsSGP1Sqg.png?1695318243",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103051045699/original/yl2bDxtT1bE8UP4lZgp0u1AVgre7jflV_A.png?1695318295"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2023-09-21T18:47:04+01:00",
    "updated_at": "2024-07-19T17:56:11+01:00",
    "id": 103000232072,
    "tags": []
  },
  {
    "title": "Sales Orders",
    "text": "TABLE OF CONTENTS Sale Order Status Rules Adding a Manufactured Date to a Sales Order The Sales Order page is where you will see all your customer orders with each line representing a product, colour variant, and the corresponding customer order number from here you can manage or link your Sales Orders. NOTE: If you are importing products from K3 Fashion and K3 Pebblestone, please note that we will import both the product information and the Purchase Order List. Sale Order Status Rules New These are the Sales Order Lines generated when an entity raises a Purchase Order within their system. In Progress A Sales Order Line is marked as 'In Progress' because the user has linked it to some Purchase Orders. However there may be additional links necessary and have deliberately left it in this status until they choose to move it as 'Completed'. Completed Once a user has linked all the Purchase Order Lines they intend to associate with a Sales Order Line, they can opt for the 'Completed' status. This indicates that they have finished the linkings for this specific SOL and do not need to work on them any further. This page also has multiple columns of information across the page this information is automatically generated when a Purchase Order is raised for your entity's Sales Order. Order ID The Id used when raising a Sales Order is this. Order Date The date when the order was placed with the supplier. Classification This represents the product type entered into the PO template. Item Name The name or identification number employed for the item. Color Color of the item. Season This indicates the season for which these items are being purchased. Buyer This is the name of the entity who placed the Purchase Order for your Sales Order. Linked to PO This displays the number of your Sales Orders connected to your Purchase Orders if you are obtaining materials from another supplier. Documents This represents the number of CSR Documents associated with this Sales Order. Status This signifies the current stage of your Sales Order. Adding a Manufactured Date to a Sales Order On the Sales Order page, you have the option to input a Manufactured Date. This feature enhances the available CSR data, which can be utilized in conjunction with your CSR Documents. Step 1: To include a manufacturing date, go to the Sales Order Page. Step 2: Select the checkbox next to the Sales Order. Step 3: Click on the Actions button and choose \"Add Manufactured Date\" from the dropdown menu. Step 4: In the side menu that appears, you can either enter the date manually or utilize the calendar icon on the right. Step 5: After selecting the date, click \"Add\". The Manufactured Date will now be visible the Sales Order Line.",
    "category": "ViJi Track Documentation",
    "subcategory": "Sales Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054677254/original/Yj9DHzjnTbTLY2DPQeC_jtbZApSacLbbOA.png?1696596594",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067242538/original/FqYmDqHPKKPwQwBoCNhiTxmxgAuVKYayRA.png?1700824421",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067241462/original/YJ8gwflTXYgypbjVGhPu8D_TLMpwHPJEbQ.png?1700824294",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067243178/original/2M7zkkgaidybr1N3dzc3ro6ge9jgVer23w.png?1700824493",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064810434/original/senN-tLxmyirmY326qivLkX7obFWzUxRfg.png?1700063723",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064809379/original/YOxIieqzsZ4oEJPIWPDrtfWS_-vDaqRDXQ.png?1700063553",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064809570/original/oMrG8kCHHL-q5VVxGgc_H0wP4mmoF3qKzA.png?1700063576",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064809857/original/_jrJ8ggdRBaz39ZAVXwhVy2BQFG8mIQvqQ.png?1700063614",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064810042/original/p5TDLnZXk3huWgtrkf5Sa8NisKlxtFUfFQ.png?1700063642",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103064808963/original/2S1jDN3Icrbut2jMFUL4zP2-SabTWPciHw.png?1700063479"
    ],
    "has_images": true,
    "image_count": 10,
    "created_at": "2023-04-13T13:38:48+01:00",
    "updated_at": "2023-11-24T11:52:59+00:00",
    "id": 103000098198,
    "tags": []
  },
  {
    "title": "How to Link your Sales Orders to Purchase Orders",
    "text": "TABLE OF CONTENTS Linking a Sales Order to Purchase Order Unlinking a Sales Order The purpose of linking sales orders to purchase order lines after importing is to enable the retracing of the product journey. This helps in understanding the product's origin, movement across different stages of the supply chain, and ultimately its destination. Linking a Sales Order to Purchase Order 1. To begin, highlight the Sales Order you wish to link and click \"Add Link\" under the \"Actions\" section. NOTE: You can add multiple links simultaneously by highlighting the checkboxes for the desired Sales Orders. 2. Highlight which Purchase Product Order Lines you wish to link and click \"Next\". 3. Now select which Main Material from the list or select \"No Main Material\" *if required, now click \"Save\" 4. Once completed a notification will appear to confirm that the linking process was successful. The Status will now have changed from \"New\" to \"Not Completed\" Once completed you can manually change the status by highlighting the line and using the actions button and selecting \"Completed\". NOTE: If you need to update the status of multiple lines, please note that the lines you select must have the same initial state. This requirement doesn't apply to Sales Order Lines that are \"New\" or \"Not Complete\"; you can link them in the same action. Unlinking a Sales Order You can choose to unlink any sales orders that were previously linked for various reasons. If any situations arise where it's necessary to do so, you can unlink them. Some reasons for unlinking may include Order cancellation or change Issues with the supplier Pricing changes Inventory management adjustments 1. To begin click the \"Order ID\" of the Sale Order. 2. Navigate to the \"Linked Purchase Order Lines\" tab. 3. From the \"Actions\" select \"Unlink\". 4. When you choose to unlink, a pop-up will appear requesting your confirmation. To proceed with unlinking, click on the \"Confirm\" button. If you want to cancel the action, click on the \"Cancel\" button instead. 5. Once you have unlinked the sales order, it will be removed from the list. A confirmation message will appear to let you know that the unlinking process was successful.",
    "category": "ViJi Track Documentation",
    "subcategory": "Sales Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063019245/original/tQ6W6EBjtSfa3aQ6l0TjkvnqUtD-CxiinQ.png?1699450698",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063019531/original/vx5NXCqC5Z74McXHBiqeoHAJJh_QtgLWOQ.png?1699450732",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063019718/original/PiSuO_bc0YOiSolVxzS2Oi5tfSaDWmRVFA.png?1699450755",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063020881/original/8AYIt4wjsKn0Zf9OX14bkyi6NOVDMlWN8Q.png?1699450897",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063026024/original/z6-28pkuNb_AECjOr06NeXBCOcMVJMoFKw.png?1699451545",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063027456/original/saUldqU5h16KaG-U3JB30l32qE1-xDZNDA.png?1699451718",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063028194/original/FLC_BaqO3Rt-MPcwbxOtojR7zsUR9Y2cHw.png?1699451813",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063028409/original/5cGjMoLMjB4-FylUqcbf_JK3aqgjsU1jng.png?1699451834",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063028561/original/6vwfKnc_aAPmdtl8Iv_xgHBwNhMsQTs4-Q.png?1699451856"
    ],
    "has_images": true,
    "image_count": 9,
    "created_at": "2023-04-13T13:39:09+01:00",
    "updated_at": "2023-11-15T16:32:17+00:00",
    "id": 103000098199,
    "tags": []
  },
  {
    "title": "How to Unlink a Sales Order",
    "text": "You can choose to unlink any sales orders that were previously linked for various reasons. If any situations arise where it's necessary to do so, you can unlink them. Some reasons for unlinking may include; Order cancellation or change Issues with the supplier Pricing changes Inventory management adjustments To begin click the highlighted Order Reference of the Sales Order you wish to unlink. Navigate to the 'Linked Purchase Order Lines' tab, and using the action button against the line select 'Unlink'. When you choose to unlink, a pop-up will appear requesting your confirmation. To proceed with unlinking, click on the 'Confirm' button. If you want to cancel the action, click on the 'Cancel' button instead. Once you have unlinked the sales order, it will be removed from the list. A confirmation message will appear to let you know that the unlinking process was successful.",
    "category": "ViJi Track Documentation",
    "subcategory": "Sales Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063037496/original/x_LlWjetghhzQjrYjmf4xkmMuY1PFFvZmw.png?1699452949",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063037212/original/r1zMJGVzdTVv3xAIblYoIe_M0uvXEU7hAw.png?1699452916",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054679945/original/bU0cjxNwM-nrGu6g3FdWZdTTX5kfzBQWuQ.png?1696596980",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054680224/original/mGsOLETHrUJTmB1uJvRSqxfpHsq5TyKJ0w.png?1696597024"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2023-05-02T17:02:32+01:00",
    "updated_at": "2023-11-08T14:21:30+00:00",
    "id": 103000107652,
    "tags": []
  },
  {
    "title": "Types of Entities",
    "text": "If you are uncertain about the process for managing multiple entities, please refer to the table below. It will assist you in making the best selection when creating your CSR profile or when inviting other suppliers. Agent / Intermediator Wholesalers, agents, intermediaries, and other administrative entities. Brand Brands and retailers have two options when purchasing goods. Option 1: They can acquire finished products from store shelves. Finished products can be slightly modified by the brands and retailers, such as altering the colour, print, or transforming a short sleeve into a long sleeve. Option 2: They may choose to purchase raw materials either in whole or in part. Raw materials are then sent to a manufacturer who assembles them. The distributor pays for the CM(P)T service, which includes cutting, making (stitching), packaging, and sewing thread. Chemicals Supplier Chemical Suppliers typically provide a range of specialized chemicals and additives used in various stages of the garment production process. Offering solutions such as: Dyes Pigments Finishing agents Softeners Flame Retardants Printing Waterproofing Stain Resistance Ennobler (Finishing Plant) A manufacturer that specializes in enhancing various types of raw materials such as: Thread Fabric Semi-finished goods Finished Products They also possess the capability to perform a wide range of processes including: Dyeing Printing Washing Bleaching Sewing Sequins / Trims Creating Smocks Applying various mechanical or chemical treatments to customize the products according to specific requirements. For instance, they can provide water-repellent coatings for enhanced functionality. Farmer / Breeder Suppliers of raw materials typically source materials from animals and plants. Farmers: Play a vital role in providing natural fibers like: Cotton Wool Silk Linen Breeders: Supply animal-based materials, including: Leather Fur Feathers Garment Factory A Garment Factory employs specialized machinery and skilled labor to efficiently create garments on a large scale. The factory follows a structured process, from: Pattern Making Cutting Sewing Finishing Jewellery Maker The Jewelry Maker's role lies in jewelry making, they can contribute by designing and crafting unique embellishments for clothing for example: Brooches Buttons Decorative Elements Knitter Manufacturers typically supply a variety of knitted fabrics. These fabrics include options such as: Jersey Rib Cable Knit Examples of clothing items made with knitted fabrics include: Sweaters T-Shirts Socks, and more Labels & Packaging Manufacturer Labels and Packaging Manufacturer responsible for producing the following: Labels Tags Various Packaging Materials (Boxes & Plastic Bags) They play a vital role in providing essential information, branding, and protection for products across different industries. These materials help consumers identify products, comply with regulations, and contribute to effective marketing and branding strategies. Others Transport agencies: These are intermediary entities that handle the transportation of goods within the supply chain. Warehouses: These are facilities used for storing and managing inventory during different stages of the supply chain. Hubs: These are centralized locations or distribution centers that act as intermediaries within the supply chain. Shoe Maker (Shoe Factory) Factories that are responsible for assembling various raw materials into finished products. They typically initiate orders for raw materials such as: Fabrics Sewing Thread Trims Accessories Some Factories also proceed to: Cut Sew Iron Pack the Materials Slaughter / Collector- Trader / Tanner Related to the production of leather, but their significance is mainly focused on the sourcing and supply of leather materials used in fashion products. Slaughter: The slaughter process is the initial step of obtaining animal hides or skins. These hides and skins are crucial raw materials for the production of leather-based fashion items like: Shoes Handbags Belts Jackets Collector-Traders: Are the initial step of obtaining sourcing and procuring animal hides or skins from various locations, including: Farms, Auctions Other sources They act as intermediaries between the slaughterhouses and tanneries, ensuring a steady supply of raw materials for leather production. Tanner: The tanning process is the leather production of the animal hides or skins received from slaughterhouses and collectors to convert them into durable and high-quality leather that can be used by fashion designers and manufacturers to create stylish and desirable products. Spinner Spinners are manufacturers specialized in the production of threads. They utilize various spinning techniques to transform fibers into threads, such as: Cotton Wool Silk Synthetic Materials Spinners have expertise in spinning processes like ring spinning, open-end spinning, air-jet spinning, and more. The threads produced by spinners are essential components in sewing, embroidery, weaving, knitting, and other textile applications. Trims Manufacturer Trim Manufacturers specialize in the production of various trims and small accessories used in the garment industry. They manufacture items such as: Labels & Tags Zippers Buttons Ribbons & Trims Eyelets / Buckles / Fastners Elastics Lace Rivets & Studs Weaver Manufacturers typically supply a diverse range of woven fabrics. These fabrics include options such as: Cotton Silk Linen Wool Synthetic blends",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2023-06-07T12:50:08+01:00",
    "updated_at": "2023-10-11T14:57:00+01:00",
    "id": 103000127969,
    "tags": []
  },
  {
    "title": "Managing Users on Your ViJi Track",
    "text": "To begin click the \"Cog Icon\" from the home page and select \"Team\" Click \"Invite User\" to bring up a from. Please complete the user's credentials, and be sure to select the appropriate user type. The selected user type will define their access level within ViJi Track. Click \"Save\" to finish the process. You will be returned to the Team page with an approval notification. NOTE: The invited user will receive an email asking them to create a password. Once the user has signed up you will now see them within your teams list. NOTE: If you don't yet see the user and are aware they have signed up press F5 to refresh the page. Deleting a User Locate the 3 dotted icon next to the user and select Delete. Click \"Delete\" to remove or \"Cancel\" to stop the deletion.",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055939247/original/Z8OSAs8Hg3xNETK9s2uA2LXawhQoD1c6iA.png?1697031842",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040439824/original/UgkH4MBqPe_SQK96tS1S5mHzL-PqHqrk1Q.png?1690992025",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040440429/original/v3PYE4Wki0nNta_HsiWaCErgP-GQJTIPkw.png?1690992168",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040441044/original/6v1zhsIJmG_sJOOqN7Hznqv3VkcVh0YkgQ.png?1690992345",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040440265/original/wvg2U86n5nTDzwpxZMvoYgAhdZYGowZFDQ.png?1690992121",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040441596/original/-e8LZ3UkR5u9QRfSZ9r7X_3yPBtz2PPLaQ.png?1690992539",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103040443012/original/qKNKe-jAGC8WPhvSx6JG7zVxkUeaSmzl0Q.png?1690992983"
    ],
    "has_images": true,
    "image_count": 7,
    "created_at": "2023-07-10T16:14:40+01:00",
    "updated_at": "2024-07-19T17:56:11+01:00",
    "id": 103000157000,
    "tags": []
  },
  {
    "title": "Switching Company",
    "text": "The ability to switch companies/entities is a feature that allows users to quickly and easily switch between the different brands or suppliers that they manage. This can save time and improve efficiency, as users no longer need to log out and log back in each time they want to access a different brand. Click on the cog icon located next to the user icon. Select \"Switch Company\" from the menu that appears. You will be returned to the \"Entities\" page. From the \"Entities\" page, click on the actions button for the brand/supplier account that you wish to use. Select \"Access Entity\" from the menu that appears. You will then be taken to the main entity page for the selected brand/supplier account.",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055941535/original/2n5VoJglULpsZm_7Nu1XvdAKKvaeIZ6Uhw.png?1697032121",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103036448138/original/cn3jIr0DVZ9awU0Cn5y9CBfumM0eoTW-ZQ.png?1689342676"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-07-14T11:34:54+01:00",
    "updated_at": "2023-10-11T14:50:42+01:00",
    "id": 103000160575,
    "tags": []
  },
  {
    "title": "Company Info",
    "text": "The Company Information page helps you manage Company Information locate the \"Cog\" icon next to your user name, select the option from the drop down. On the Company Page, fill out the requested information. Once you have finished, you can upload your company logo. When you are finished, click Save.",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055942984/original/HZuw6Z-IIh2ov26ulkA7NtlcItnFSo-0fQ.png?1697032316",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055943304/original/fnmMhAlxcH8AKenzNheygZSmr6jKWTngBg.png?1697032350"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-07-14T11:35:13+01:00",
    "updated_at": "2023-10-11T14:52:42+01:00",
    "id": 103000160576,
    "tags": []
  },
  {
    "title": "PEF Matching",
    "text": "TABLE OF CONTENTS Adding a New Category Match Items to PEF Standard Deleting a PEF Matching PEF Matching allows your entity to proactively meet and comply with future legislations, particularly those related to calculation and environmental labeling requirements, specifically in the European context. The PEF Matching can be only accessed by Super Admin roles it can be located in the left hand menu. Entity Classification This refers to the Brand/Supplier item classification entered into ViJi Track using the import Purchase Order process. IMPORTANT: Ensure that the classification name used in this process aligns with the terminology employed in the user's Enterprise Resource Planning (ERP) systems. PEF Family This is the name given by the European PEF standard for the classification of Finished products. PEF Subfamily This is the name given by the Ademe* standard for the classification of Finished products. *ADEME methodologies are employed for the calculation of the greenhouse gas emission Adding a New Category 1. To begin adding an Entity classification click \"ADD NEW CATEGORY\" 2. Provide a suitable classification name (this should be a name your entity uses) and using the PEF Classification List select the type of Item associated from the drop down. NOTE: The \"Family\" will be automatically assigned. 3. Your PEF Match will now be visible in the list. Match Items to PEF Standard If your Item Classifications are not aligned with a PEF Standard, you have the flexibility to match them at your convenience. 1. Simply select the Entity Classification by highlighting the box next to its name.\" 2. Using the \"Actions\" button select \"Match Items to PEF Standard\". 3. Then using PEF Classification List select the type of Item associated from the drop down and click \"Confirm\". NOTE: The \"Family\" will be automatically assigned. 4. Your Entity Classification will now be matched and displayed in the list. Deleting a PEF Matching 1. To remove a PEF Matching, access the \"Actions\" menu corresponding to the desired line, and then click on \"Delete.\" A pop-up will appear, prompting you to confirm the deletion. Keep in mind that this action is irreversible, and you will need to re-add your classification if needed. 2. Select \"YES\" to permanently delete the matching, or choose \"NO\" to cancel the deletion.",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071393063/original/Q-IvEhfqJw_mX6NK6sLy8vwnviEe9-CjTA.png?1701956680",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103067362738/original/0RlgOfPZF7Dmm49079lK0DLdYGnyHJMRBw.png?1700841494",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071484918/original/_U-NBp0EAMdxRg9rI3rdRhq23RCdsULK-Q.png?1701969353",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071484397/original/v8sLPWiI7nCkEdMj8vZ48XLeeVMAOCFHuw.jpeg?1701969200",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071432031/original/WXag945UdXV2KZODn-W0dd7dGSlle9FUJA.png?1701961519",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071432142/original/4_NFGHxusLQvQrF64lJXG2k3WXkSwMsCYQ.png?1701961540",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071436910/original/uqFm-JGTBaUVOWP3r_A5BV-4jPQceuO66g.png?1701962164",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071442217/original/qU5m77jIPslxEJS_EhZdbZ3QHExFi6eS9A.png?1701962837",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071446167/original/YfSKWB_70pp6bW_fqeuFYQkScanp9rSvIg.png?1701963360",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071470721/original/Te7qSqerB8Gtjtzlr3_B1A5fGjOU9AtYwg.jpeg?1701966323"
    ],
    "has_images": true,
    "image_count": 10,
    "created_at": "2023-11-21T16:31:55+00:00",
    "updated_at": "2024-07-19T17:56:11+01:00",
    "id": 103000257434,
    "tags": []
  },
  {
    "title": "Manage ViJiClic Document Visibility",
    "text": "TABLE OF CONTENTS Accessing VijiClic Options Entity Visibility Supplier Visibility ViJiClic View The ViJiClic settings page empowers you with enhanced control over CSR Data, enabling you to dictate what information is presented when customers explore the traceability chain through ViJiClic. Accessing VijiClic Options To begin locate the ViJiClic settings by clicking on the cog icon adjacent to your name from your entity page. Choose this option to proceed to the next page. Upon entering the ViJiClic settings page, you'll encounter toggles designed to control visibility within ViJiClic. To activate a toggle, simply click on it; a green toggle indicates activation. Click it again to deactivate. The toggles are divided into two sections: one dedicated to your entity's CSR documents and another determining how customers perceive your supplier chain. Entity Visibility These are the toggles that affect what the customer will see about your entity. Show CSR Documents: This toggle option will grant users the ability to view CSR Documents associated with your entity. Show CSR Commitments: This toggle option will allow users to view the CSR Commitments you have responded to and the corresponding responses. Show Entity as First Node: option to ensure that your entity consistently occupies the first position in the traceability chain. Supplier Visibility These are the toggles that affect what the customer sees about your suppliers. Show CSR Documents: This if active will display the CSR Documents your suppliers have uploaded. Show CSR Commitments: This if active will show which CSR Commitments your suppliers have answered along Suppliers anonymous in BtoC Solutions: This controls the visibility of the suppliers name and address. If active only the country will be shown. NOTE: In case any of your suppliers using ViJiClic have disabled their entity visibility toggles, their preferences will take precedence over the options set within your entity. ViJiClic View Here's an example of ViJiClic in action, where both an entity and its supplier have chosen to collaborate and share their information. As a result, customers gain comprehensive visibility into the supplier/entity details, CSR documents, and CSR commitments.",
    "category": "ViJi Track Documentation",
    "subcategory": "Admin Info",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103071650445/original/Wk003qA-OYo82nMYIZEp-SL94ZfHsZP-Cw.png?1702036782",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072575739/original/oHHr9jyYNnXjbyhNdDcy2KIHcogKVwUsFQ.gif?1702399417",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072578539/original/qK2J66hBb4SStrjcsUjgHkUXGSkDSVRDmQ.gif?1702399958",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072582803/original/YciBEQhEpuW_U6vQAf_HQDTqEIDxMq1S6A.png?1702400853"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2023-12-08T17:02:10+00:00",
    "updated_at": "2023-12-14T16:24:43+00:00",
    "id": 103000261241,
    "tags": []
  },
  {
    "title": "Welcome Page",
    "text": "On your Entity homepage, you will see \"Quick Actions to Conduct\" these are to notify you of any incomplete Entity information. Click the \"Action Button\" to navigate to the relevant page. Additionally, the left-hand menu serves as a helpful tool to navigate through the various ViJi Track sections with ease. You can access your Profile and user settings at anytime by clicking the icon located in the top right of the page. My Entity CSR Profile These are the details about the Entity, including its address and company information. CSR Documents Here you will upload CSR Documents related to the Entity and Products. CSR Commitments This is where all CSR Commitments are triggered by either downloading CSR documents or declarations in your CSR profile. My Suppliers Suppliers List These are your suppliers linked to your Entity. Questionnaires Here you will build your questionnaires for your supplier to be able to gain as much knowledge as possible. My Items/Orders Items These are the items generated when you import your Purchase Orders. Purchase Orders Here you can track and manage your imported Purchase Orders. Sales Orders These are sold orders which you can link to your Purchase Orders.",
    "category": "ViJi Track Documentation",
    "subcategory": "Welcome Page & Settings",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061293803/original/79WIcOiZnfcg4CAxR2Zx_48KIFBZLfKeHg.png?1698836582"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-02-01T14:57:06+00:00",
    "updated_at": "2024-07-19T17:56:07+01:00",
    "id": 103000051996,
    "tags": []
  },
  {
    "title": "User Profile/Settings",
    "text": "TABLE OF CONTENTS User Profile User Settings Log out Personalize your ViJi Track: You can change User Profile and User Settings easily. Click the user icon in the top right corner for access. User Profile First Name / Last Name: This should be the names of the user. Job Title: The role of the user. Email / Phone: This should be the contact details of the user. Click 'Save' to keep any changes made. User Settings Language: Choose your preferred language. Email Notifications: Control the types of notifications you receive from the ViJi Track system via email. Newsletter subscription: Opt in or out of the ViJi Track newsletter. Click 'Save' to keep any changes made. NOTE: You can also change your Password from this page. Log out To log out, simply click on the profile icon and then click on 'Log out', click Yes to confirm.",
    "category": "ViJi Track Documentation",
    "subcategory": "Welcome Page & Settings",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103041989792/original/1-uE0QBeUyoKMeUgjc9JOSIW00gl0cATbA.png?1691680697",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103041990239/original/TY95386nwn8WceUS4oVOnx8O8YQBrPTGZQ.png?1691680789",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103041995431/original/vJuZOcap4UDuVZivN5vfftGrtcKyzbx5vg.png?1691681974",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103041997801/original/0yCsseMMuyPNZfkKtHj-ZyAay738CdVENw.png?1691682414"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2023-04-13T13:46:52+01:00",
    "updated_at": "2024-07-19T17:56:09+01:00",
    "id": 103000098219,
    "tags": []
  },
  {
    "title": "Item Page Explained",
    "text": "TABLE OF CONTENTS Item List Item Information Page A Item List is a collection of items a business sells or keeps in inventory. It includes important information such as item name, description, SKU, price, and quantity. An Item List allows businesses to efficiently manage inventory levels, create purchase orders, and generate reports. Item List NOTE: If you are importing item(s) from K3 Fashion and K3 Pebblestone, note that we will import both the item information and the Purchase Order List. Click the Item ID to see the Item Information. Item Information Page Here, you'll find all the details about the Item Line. This information is generated automatically when you import your Purchase Orders. You can click the Order Line and this will take you to your Purchase Order page for this Item.",
    "category": "ViJi Track Documentation",
    "subcategory": "Items",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055935605/original/Sd_9nCbJpQjgDsCye56zPtPYXeeJhVSJOA.png?1697031348",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055937613/original/TEj93l5L2u8AKLxMofa41lNV9cZJ7WEkUg.png?1697031596"
    ],
    "has_images": true,
    "image_count": 2,
    "created_at": "2023-04-13T13:37:13+01:00",
    "updated_at": "2023-10-11T14:40:04+01:00",
    "id": 103000098193,
    "tags": []
  },
  {
    "title": "Managing Your CSR Commitments",
    "text": "TABLE OF CONTENTS Questionnaires CSR Commitment Tab Questionnaires NOTE: You have the option to utilize filters to arrange your view based on either the questionnaire or the assigner. To initiate the process of completing a questionnaire, simply click on the blue-highlighted Questionnaire Name. 1. To initiate the process of completing a questionnaire, simply click on the blue-highlighted Questionnaire Name. 2. Once you've arrived on the page for your selected form, you will be able to access the CSR Commitments that necessitate your responses. These responses will display the percentage scores for the Declared, Verified and Authenticated statuses. Declared: You've supplied a response that could be either a yes or a no. Verified: You've provided a yes response and submitted a CSR Document. Authenticated: Our system has verified the attached document's authenticity, confirming its accuracy. NOTE: If uploading CSR Documents you will be taken to the CSR Documents page NOTE: If you don't see a list of CSR Commitments, they might be cascaded. Click the V icon next to the CSR Commitment to expand and view the details. CSR Commitment Tab Here you can view the commitments you have answered along with the CSR Documents uploaded and their status. Each commitment has a reliability level that indicates its status shown in the \"Status\" column. Declared You've supplied a response that could be either a yes or a no. Verified You've provided a yes response and submitted a CSR Document. Authenticated Our system has verified the attached document's authenticity, confirming its accuracy. Please be aware that other entities you interact with may have questions for you, so please check this page frequently to ensure that your answers are accurate and complete. 1. To view the CSR Documents associated with the CSR Commitment click the \"View\" within the CSR Document column. NOTE: The number indicates the amount of documents that have been uploaded. 2. You will see all the CSR Documents linked to this Commitment listed. You can click the highlighted blue document name to view the the uploaded document.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Commitments",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103065274294/original/l_yUopZ-46CWtlyOYBmUeHYyDtAc_p9byA.png?1700150906",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103065278985/original/ptQMvUtB6DVi3rT8McAztyN0TeFI-1zk9A.png?1700151462",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103051112929/original/-9dp0tnLoD-XwamfSprCklRUsK-TZn7VrA.png?1695369741",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103051112841/original/IvZeQEt7-UgjmOW54vNLuuJ3kMCJG6gZig.png?1695369734",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103051112815/original/1BEHDKG0VAySnXmCt7i_r0EMOgXPYF9_LQ.png?1695369729",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103065272163/original/ZoobHlbCbsH4lKMAqR-k6zVL2KBD7oUTMQ.png?1700150643",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103065271813/original/fkNATdZCB505__e1-MiaYYVNhtf82fGmhg.png?1700150604"
    ],
    "has_images": true,
    "image_count": 7,
    "created_at": "2023-04-13T13:34:59+01:00",
    "updated_at": "2023-11-16T16:31:58+00:00",
    "id": 103000098187,
    "tags": []
  },
  {
    "title": "How to Create and Assign Questionnaires",
    "text": "TABLE OF CONTENTS Create a New Questionnaire Deleting a Questionnaire Duplicating a Supplier Questionnaire ViJi uses Corporate Social Responsibility (CSR) questionnaires to evaluate suppliers' commitment to sustainable and ethical business practices. These CSR questionnaires can be used for several reasons, such as complying with legal or regulatory requirements, identifying potential risks related to suppliers' business practices, improving reputation, or gaining greater visibility into its supply chain. By completing a CSR questionnaire, suppliers can demonstrate their commitment to sustainability and ethical business practices, which can help them maintain their relationship with ViJi and improve their business practices. Create a New Questionnaire 1. To begin creating a new Questionnaire click the \"Create New Questionnaire\". 2. Give the Questionnaire a suitable name and click \"Create\" to move on. 3. Once you've created the Questionnaire,' it will appear on the main page at the top of the list. To begin assigning it to Suppliers, click on the \"Questionnaire Name\" on the main page. 4. Here, you can construct your \"Questionnaires\". Simply drag the desired questions from the right-hand section and drop them into the left-hand section to add them to the Questionnaire. 5. After creating the Questionnaire, you now have multiple options of where to assign it. None: This option can be used to un-assign a Questionnaire if required or it is not yet ready to be assigned. All: This option will assign the Questionnaire to all suppliers and types of entity. Entity Type: This option lets you select what type of entity you specifically want this Questionnaire assigned to. Suppliers: This option lets you select from your list of suppliers you would like to assign this Questionnaire to. 6. After choosing who will receive the Questionnaire from the available options, another field will become accessible for selection. In the example below, the initial option is \"Type of Entity,\" and the selection is \"Weavers.\" Upon making your selection, you will notice the corresponding option appearing to the right, along with a confirmation notification. To remove the assignment, simply click the red bin icon. Deleting a Questionnaire You have the option to delete a Questionnaire by selecting the 3 dots and selecting \"Delete\". An option will appear asking to confirm the deletion. Yes will remove the Questionnaire Cancel will stop the deletion action. Duplicating a Questionnaire To duplicate an existing Questionnaire, select the three dots and choose \"Duplicate\". Please note that the duplicated Questionnaire will have \"(copy)\" next to it.",
    "category": "ViJi Track Documentation",
    "subcategory": "Questionnaires",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054735968/original/QQf74gS1CLrv78YWtPGK7EjZ0QxLbDVn7g.png?1696604932",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054736043/original/wwP5RI5LRu4i5n7mfAfuCcfqhoZh6cGlkw.png?1696604944",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054736147/original/nzr09JEuGyCqmBuUDTAQDwkQ08wNWVGuLw.png?1696604959",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054736267/original/vmz3mpYl_hncK2tQ8CzluNPWIR-tPAsNlQ.png?1696604977",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054730282/original/cqzHOUQVg4EYuwtT5wsgUZ2-OMtG69Hvag.png?1696603989",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054733686/original/RHGcGQLx_bvAmpsqX6rrWFPNIzYmEreJgA.png?1696604506",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054736370/original/yaHCb7padZDi0Gj86mcYviSV5FpUFko_2Q.png?1696604996",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054735515/original/Nb5nMCnBuLgFmeVVF84XXVWdFh6J_W-A7g.png?1696604842",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054736547/original/2p7gb_dkOvtuaPdK501nuvNARUe42-nLog.png?1696605012"
    ],
    "has_images": true,
    "image_count": 9,
    "created_at": "2023-04-13T13:30:31+01:00",
    "updated_at": "2024-02-15T09:14:57+00:00",
    "id": 103000098181,
    "tags": []
  },
  {
    "title": "Questionnaire (Items)",
    "text": "TABLE OF CONTENTS Create a New Questionnaire Deleting a Questionnaire Duplicating a Supplier Questionnaire ViJi Track utilizes Corporate Social Responsibility (CSR) questionnaires to assess suppliers' dedication to sustainable and ethical business practices. These questionnaire forms are designed for items that assist entities in obtaining more information by allowing them to assign specific questionnaires directly at the Purchase Order Line level. There are various reasons to employ these questionnaires, including ensuring compliance with legal or regulatory requirements, identifying potential risks associated with suppliers' business practices, enhancing reputation, and gaining increased visibility into the supply chain. By completing the questionnaire, suppliers can demonstrate their commitment to sustainability and ethical business practices, which, in turn, helps them maintain their relationship with ViJi Track and improve their business practices. Create a New Questionnaire 1. To begin creating a new Questionnaire click the \"Create Questionnaire (Items)\". 2. Give the Questionnaire a suitable name and click \"Select Commitments\" to move on. 4. Here, you can construct your \"Questionnaires\". Simply drag the desired questions from the right-hand section and drop them into the left-hand section to add them to the Questionnaire. 5. After creating the Questionnaire, you now have multiple options of where to assign it. All Purchase Order Lines: Q: Which status PO> Custom Selection: All Purchase Order Lines This action will link your questionnaire to all your \"New\" or \"In Progress\" purchase orders, excluding those that have been archived. Custom Selection TBD Deleting a Questionnaire You have the option to delete a Questionnaire by selecting the 3 dots and selecting \"Delete\". An option will appear asking to confirm the deletion. Yes will remove the Questionnaire Cancel will stop the deletion action.",
    "category": "ViJi Track Documentation",
    "subcategory": "My Items/Orders",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075647006/original/9tR2PWdYaN3upfQUBtzf3ASh-fvUd8ILjQ.png?1703677027",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075647306/original/Q4he8Bv0eE2o-SyEYoAeatVrrKtG5e0UAg.png?1703677097",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075647248/original/A6g7ONdPeO829WpPGQX-d7O4kVKdBtqZDA.png?1703677084",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075647586/original/vTfge-n9j7BjJhEXv-3NlvKQRXl2f53y_g.png?1703677164",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075648723/original/PrjVqyWTL4TSmEfL80RpniPjRqjfQxXx9Q.png?1703677441",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103075653162/original/nMQ5FQ88uCAoZtYpMjc9lA8BxgbKkt70hg.png?1703678512"
    ],
    "has_images": true,
    "image_count": 6,
    "created_at": "2023-12-21T17:24:21+00:00",
    "updated_at": "2024-07-19T17:56:12+01:00",
    "id": 103000263798,
    "tags": []
  },
  {
    "title": "Suppliers List Page",
    "text": "TABLE OF CONTENTS Suppliers Page Dashboard Header Tabs Columns Dashboard Tab Viewing Supplier Information Questionnaires Tab Entity CSR Documents Tab CSR Commitments Tab General Information Tab Suppliers Page The Suppliers List page shows all the suppliers you are in contact with along with various levels of supplier information below will outline the information displayed. Dashboard Header The dashboard offers a visual means to track and assess your suppliers along with their varying degrees of commitment. Every segment within the dashboard provides distinct sets of information. Questionnaires % This graph is a calculation of the overall percentage of answered questionnaires. Month and the number of Suppliers Invited: This graph gives you an overview of when and how many of your suppliers were invited. You can hover over the graph for more detailed info. Top 3 Documents: This section shows the three primary documents that your suppliers upload, which can be either their CSR documents or responses to questionnaires. Tabs Here you have an \"overall\" view of the suppliers your entity deals with along with their Commitment Scores, rank and activity. Active: One active user. Pending: The invitation has not received a response from the user. If there is no response, it will be automatically resent. However, if the user still does not respond, it will eventually be classified as inactive. Inactive: An invitation to a new user can be sent when the supplier is inactive, either because the recipient has not received an invitation yet or because the supplier has not established a link with a user. Columns Supplier List of your suppliers. Country The county provided when the supplier filled in their CSR Profile. Entity Type The type of production the supplier has selected when onboarding or within their CSR Profile. CSR Documents This shows how many CSR Documents have been uploaded by the supplier. % Declared Indicates that an entity has simply announced a CSR Commitment without presenting any substantiating evidence. % Verified The CSR Commitment has been proven with a certification document. % Authenticated The CSR Commitment and certification document has undergone verification by ViJi Track in collaboration with the certifying agency. Rank Rank 1 represents the entity that is directly associated with the present entity. Last Activity This shows the date this suppliers account was accessed. Dashboard Tab CSR Docs: Shows the number of suppliers who have uploaded at least one Entity CSR document. Ethical Policy: Indicates the count of suppliers who have uploaded a CSR document categorized as \"Ethical policy. Social Audits: Reflects the count of suppliers who have uploaded a CSR document categorized as \"Social audit.\" As per Country: Displays the percentage of countries from which your suppliers originate. As per Entity Type: This graph shows the various types of entities your suppliers represent. Top Entity CSR Commitments: This shows the the top 5 entity CSR commitments, along with the number of all active suppliers across all ranks who have these commitments. Top Entity Documents: This displays the top 5 entity CSR documents, along with the number of all active suppliers across all ranks who have these entity CSR documents. Top Item CSR Commitment: This displays the top 5 product CSR commitments, along with the number of all active suppliers across all ranks who have these Item CSR commitments. Top Item Documents: This shows the top 5 product CSR documents, along with the number of all active suppliers across all ranks who have these Product CSR documents. Viewing Supplier Information To view a supplier's CSR information, simply click on their name from the list provided. Only the information that the supplier has included in their CSR profile will be shown, which can help entities compare different suppliers. Questionnaires Tab This section shows your suppliers and at what stage they are at with their questionnaires this can help you to prompt your suppliers to supply more information. Entity CSR Documents Tab This tab showcases the CSR Documents uploaded by the supplier, along with their respective status. To view a document, simply click on the highlighted document name to open the accompanying PDF. Item CSR Documents Tab This tab showcases the CSR Documents related to the suppliers items, along with their respective status. To view a document, simply click on the highlighted document name to open the accompanying PDF. CSR Commitments Tab Similar to the CSR Commitment section, this tab presents the CSR Documentation related to this supplier. Here, you have the ability to review CSR Documents that the supplier has uploaded, along with their respective statuses. General Information Tab Within this tab, you'll find the CSR information specific to the supplier. The displayed information is exclusively sourced from the supplier's CSR profile, facilitating comparisons between various suppliers for entities seeking such insights.",
    "category": "ViJi Track Documentation",
    "subcategory": "Suppliers List",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063040782/original/ZdgvdBTcAtg75mqqtzId1WS-0_UTQIrQvA.png?1699453386",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063040970/original/SdrlcJUmuwVKkpiHDX6O0I6PLLNNIHmOzQ.png?1699453416",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063041237/original/OQOqfZwB14z61xVXSpErlRwlUUqDM6dkiQ.png?1699453453",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049667846/original/IkNSXdMOZiOfHReNK_ow_cRUJ0mzjcDuRA.png?1695024672",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061946304/original/0ke9vFR7QmixHWdJVTD3eXQrKCpqjWPqNQ.png?1699020891",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054691942/original/81i6utUdfieLi3zvb3Nfex8LzXjhvDMSWQ.png?1696598542",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054692472/original/WR79GdlEJTpk73I9c-f4vMlnDyC-klDXrw.png?1696598618",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054692801/original/gyZkJbiDZSbgDljVkdC7QtSSy_n9qppQ0Q.png?1696598660",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054694349/original/JkFGDiN8Cl9D8SuXEyMgCC64izd4at_eUA.png?1696598866",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054694528/original/qJ1uOqJvyH7GbQ1HoY3SpMHj6mQldUwZpg.png?1696598886",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063041585/original/NmvBXgF1N4hAuVsp0DSa1JKnsYHZvQO5OQ.png?1699453498",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063041846/original/ssHffnet0c9kZSspzUOrvBQUJJTF9xD4yA.png?1699453528",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063042060/original/a1rpJ70TCMxIvYBaEpt36C2OLI7wAovIRQ.png?1699453552",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103063042211/original/LNUvp2QDziSFOWf0uaR6LbDM4Wktjar5fg.png?1699453578",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072781452/original/JFQxHL7R3mx-F6teRJpM0AdEzqjWFeC4pg.png?1702467810",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072782685/original/nwUBWkFXiImbnMpN9ACulWQl3OcWVsOpJA.png?1702467926",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072783364/original/6UGS49HUyba662756EL6RPQEMZnvm1nVyQ.png?1702468014",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072783927/original/kKGWDRMPwr1eX-29mIVHvVCRLA-SmxQ-kw.png?1702468091",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103072786814/original/qm6Zn_Te3ef7lPLcVim5eTeKM9kOq0uMeQ.png?1702468440"
    ],
    "has_images": true,
    "image_count": 19,
    "created_at": "2023-04-13T13:40:20+01:00",
    "updated_at": "2024-07-19T17:56:09+01:00",
    "id": 103000098201,
    "tags": []
  },
  {
    "title": "How to Add a New Supplier",
    "text": "At ViJi, we believe that sustainable practices start with strong partnerships. That's why we've made it easy for our users to add suppliers to their accounts and build lasting relationships based on transparency and accountability. With our intuitive supplier management process, you can quickly and easily add new suppliers to your account and access all of the relevant information in one centralized location. From tracking supplier performance to managing compliance and risk, our product has been designed to simplify the entire process and save you valuable time and resources. 1. From the Suppliers page click the \"Add Supplier\" button. 2. Input the Suppliers name and click \"Save\". Pressing cancel will return you to the Suppliers main page. 3. In the ViJi Track, you will be presented with a list of matches to the supplier you are trying to add, which may have similar names. You can either highlight the matching name and click \"Create Alias\" or the Current Supplier name and click on the \"Create New Supplier\" button to proceed. 4. Fill in the Supplier contact details and click \"Add Contact\". 5. After adding the Supplier, you will be redirected back to the Supplier page, where you will see that they have been put into the Pending Tab. NOTE: An automatic email will be sent to the Supplier, informing them that they have been identified as one of your suppliers. The email will also include an invitation for them to join your space using ViJi Track. Once they respond to the email, they will be visible in your Active Tab.",
    "category": "ViJi Track Documentation",
    "subcategory": "Suppliers List",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054717230/original/AU0P2PRNoFmpkGQJtiwQ6RPPQKoT6-gz8A.png?1696602015",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054717321/original/k9Dbj4lPkbg4nTZPkVpJnXMMhyFGMZVyXw.png?1696602028",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054713566/original/U6sOGbweC1I8Wh-yWmWEVPMRDLb2PvxngA.png?1696601468",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054715653/original/-raZ2JwByregaNB8c46q2cV8C2t-J9ZxZw.png?1696601779",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103054717575/original/qegsSCLB1-oQ36iBw_zL5FVjQBaxfjJEaA.png?1696602085"
    ],
    "has_images": true,
    "image_count": 5,
    "created_at": "2023-07-27T11:47:17+01:00",
    "updated_at": "2024-07-19T17:56:11+01:00",
    "id": 103000172678,
    "tags": []
  },
  {
    "title": "Pending & Inactive Suppliers",
    "text": "TABLE OF CONTENTS Supplier Invitation and Status Rules Pending Tab Inactive Tab Re-Inviting a Supplier Removing a Supplier Supplier Invitation and Status Rules When a user is invited to the ViJi Track platform, they receive an email with a link to activate their account. However If they do not activate their account within 30 days from the invite date they will then be moved to \"Inactive\" status. NOTE: If, after 15 days from the invite , there is still no response, an automated email will be sent to both you and the supplier as a reminder that the invitation has not received a response. After a further 15 days the activation link will become deactivated and you will receive an email reminding you to replace the contact. Inactive Supplier Status: Their account will be categorized as an \"Inactive Supplier\" and will be moved to the respective tab. This means they will not have access ViJi Tracks features until their account is activated. Deletion from Database: If the account is not linked to any other entity or user within ViJi Track, it will be deleted from our database. Assignment of a New User: If they were invited to ViJi Track by an existing user, they will be prompted to link a new user to the inactive supplier entity. Pending Tab This tab displays your suppliers who have not responded, and it also provides information about when their invitation will expire this will not exceed 30 days. Additionally, the \"Last Activity\" column shows when the supplier was last involved in at least one Purchase Order that was uploaded to ViJi Track. Within the \"Actions\" menu, you have the following options: 1. Re-send the invitation. 2. Cancel the invitation. 3. Remove the supplier. Inactive Tab Here you can see the suppliers who did not respond to the invitation within 30 days. Within the \"Actions\" menu, you have the following options: 1. Invite the Supplier. 2. Remove the Supplier. Re-Inviting a Supplier To re-invite a contact from the \"Inactive\" tab, you can use the \"Actions\" menu and select \"Invite Contact.\" This process is identical to adding a new supplier, and if you are unfamiliar with it, you can find more information here > [Adding a New Supplier.]. Removing a Supplier To remove any inactive suppliers, you can utilize the \"Remove Supplier\" option available in the actions menu. Access the supplier page, go to the \"Inactive\" tab, click on \"Actions,\" and choose the \"Remove Supplier\" option. When prompted, you will be asked to confirm the deletion of the supplier. Selecting \"Confirm\" will proceed with the deletion, removing the supplier. NOTE: Please be cautious when deleting a supplier, as once deleted, you will need to add them again using the \"Add Supplier\" function. Deleting a supplier removes their information from the system. If you wish to cancel the deletion process and retain the supplier, choose \"Cancel,\" and you will be redirected back to your supplier page.",
    "category": "ViJi Track Documentation",
    "subcategory": "Suppliers List",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103056139747/original/hC7qEB21Su7VsmLyJrF63LHGXq9GPC9CoA.png?1697104171",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103056144207/original/FcIHjc5OHcrT-W-QWWnuZ0WFarA6X3wKBg.png?1697104709",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055921088/original/XhdJDfGzmU8oj33FVJjgr5SxY49sP_4spA.png?1697029440",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055929078/original/LJZn6jkjlHLjbJpLV3sr2wKvQrPRbFnWXA.png?1697030494",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103055928865/original/bZrUtcq-hFLA8tmvrLIjKYc75-j3Gm8DfA.png?1697030471"
    ],
    "has_images": true,
    "image_count": 5,
    "created_at": "2023-04-13T13:40:54+01:00",
    "updated_at": "2023-10-13T14:52:04+01:00",
    "id": 103000098204,
    "tags": []
  },
  {
    "title": "Glossary",
    "text": "TABLE OF CONTENTS AGEC Law (Anti-Gaspillage pour une conomie Circulaire) CSR (Corporate Social Responsibility) CSR Commitments CSR Document Entity ESG (Environmental, Social and Governance) PO (Purchase Order) Item CSR Documents Questionnaire Sales Orders Supplier Here is a non-exhaustive list of acronyms and terms frequently used in the solution and documentation, along with their meanings: AGEC Law (Anti-Gaspillage pour une conomie Circulaire) The AGEC Law, implemented in France in February 2020, aims to promote a circular economy and reduce waste. It introduces measures like extended producer responsibility (EPR), where producers are accountable for their items throughout their lifecycle, including recycling and disposal. The law also establishes a deposit and return system for plastic bottles, improves item labelling on environmental impact, sets waste reduction targets, promotes circular economy contracts, and addresses plastic waste through bans and recycling initiatives. The AGEC Law signifies the French government's comprehensive efforts to transition towards a more sustainable and circular economy by addressing waste and promoting recycling practices. CSR (Corporate Social Responsibility) This term refers to the actions and initiatives that businesses take to positively impact society and address important issues. It goes beyond just making profits and involves considering the well-being of employees, customers, communities, and the environment. CSR can include things like supporting charities, taking care of the environment, treating employees fairly, and contributing to local communities. It's about businesses taking responsibility for their actions and doing good for the world around them. CSR Commitments Referring to promises made by fashion brands and companies to operate in a socially responsible and ethical manner, CSR commitments in the fashion industry encompass various aspects. These include fair labor practices, transparent supply chains, and respect for human rights. Additionally, environmental stewardship is emphasized through actions like reducing carbon emissions, conserving resources, and adopting sustainable practices. Fashion brands also prioritize engaging stakeholders, promoting diversity and employee well-being, and continuously improving their CSR practices. Responsible supply chain management, philanthropy, and community involvement are also part of these commitments. Through these CSR commitments, fashion companies demonstrate their dedication to sustainable and responsible business practices, positively impacting the industry and the world. CSR Document A CSR document serves as a comprehensive declaration of a brand's dedication to social and environmental responsibility in the fashion industry. It covers various aspects such as sustainable materials and production, fair labor policies, transparent supply chains, animal welfare, recycling, circular economy initiatives, and responsible marketing. The document also highlights the brand's specific goals, targets, and performance metrics, showcasing its advancements in areas like carbon emissions reduction, ethical sourcing, community engagement, and diversity and inclusion. By sharing this information, the CSR document enables fashion companies to effectively communicate their responsible practices, engage stakeholders, and promote transparency and accountability throughout the industry. Entity An entity typically refers to a distinct and identifiable object, organization, or being that exists separately from others. In business and legal contexts, an entity commonly denotes a legally recognized and independent organization, such as a company, corporation, partnership, or nonprofit organization. These entities have their legal existence and are separate from their owners, carrying rights, obligations, and responsibilities. They can engage in contracts, conduct business operations, own assets, and be held accountable for their actions. Entities are often established to pursue specific goals, whether for-profit or non-profit, and they play a vital role in shaping the structure and operations of the business and legal realms. ESG (Environmental, Social and Governance) This is a framework used to assess how well a company performs in three important areas. Environmental: This refers to a company's impact on the environment and how it manages environmental risks. It includes factors such as resource usage, waste management, pollution control, and efforts to combat climate change. Social: This focuses on a company's relationships with people and society. It involves evaluating how a company treats its employees, engages with communities, promotes diversity and inclusion, ensures human rights, and supports social causes. Governance: This relates to a company's internal systems and processes that guide its operations. It encompasses things like the composition of the board of directors, executive compensation, transparency in financial reporting, and ethical decision-making. PO (Purchase Order) A purchase order (PO) is a commercial document that a buyer issues to a seller to express their intention to purchase goods or services. It acts as a formal contract between the two parties, specifying important transaction details like quantity, description, price, delivery terms, and other relevant conditions. The purpose of a PO is to establish clarity and agreement between the buyer and seller, enabling smooth order processing, inventory management, and payment reconciliation. It serves as a reference document for both parties during the procurement process. Item CSR Documents In the fashion industry, a Item CSR (Corporate Social Responsibility) document focuses on the social and environmental impact of a specific fashion item or line. It provides comprehensive information about the item's lifecycle, covering material sourcing, manufacturing, distribution, use, and end-of-life considerations. The document emphasizes sustainable material choices, ethical manufacturing processes, transparent supply chain practices, and environmental impacts like carbon footprint and waste generation. It also highlights any certifications, eco-labels, or industry standards the item meets, demonstrating its compliance with recognized sustainability benchmarks. By presenting this information, the Item CSR document allows fashion brands to effectively communicate the sustainable features and benefits of their items, empowering consumers to make informed choices based on social and environmental considerations. Questionnaire These are forms that you or a supplier can create and allocate within the solution to collect pertinent CSR (Corporate Social Responsibility) information. Sales Orders A sales order is a document a seller creates in response to a customer's request to purchase goods or services. It serves as an official record of the transaction and provides details such as requested items or services, quantities, prices, payment terms, delivery information, and other relevant conditions. The sales order is used by the seller to process the order, fulfil customer requirements, allocate inventory, generate an invoice, and initiate item or service delivery. It ensures a smooth sales process, and accurate order fulfillment, and serves as a reference for both the seller and the customer throughout the transaction. Supplier A supplier is an entity or individual that provides goods, materials, or services to another organization or individual. In the business context, suppliers, typically companies or vendors, play a crucial role in the supply chain. They offer raw materials, components, equipment, or finished goods to manufacturers, retailers, or service providers. Additionally, they may provide specialized services like logistics, distribution, or technical support. Suppliers are essential in the procurement process as they ensure the availability and quality of inputs required for smooth business operations. Building strong relationships with reliable suppliers is vital for maintaining a consistent supply, meeting customer demands, and achieving overall business success.",
    "category": "ViJi Track Documentation",
    "subcategory": "Glossary / Support / API",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2023-06-08T17:11:32+01:00",
    "updated_at": "2023-10-11T15:14:54+01:00",
    "id": 103000128416,
    "tags": []
  },
  {
    "title": "Help & Support",
    "text": "New Support Request If you require help or support you can contact us using the Viji Support Request located on the home page simply click the ?Help and click \"New Support Request\". Fill in the Support Form with as much detail as possible and click \"Send\". We aim to reply within 24 hours of your query. Documentation This will direct you to these help guides.",
    "category": "ViJi Track Documentation",
    "subcategory": "Glossary / Support / API",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031153387/original/RnbGgMw0xJksDxIWSyNbetG06vLLXcZdDA.png?1687260915",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031153895/original/yosZ3pBvoRynjseEpk7XcfmCfWQKtipgZQ.png?1687261003",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031152660/original/_jv1A3KrK4kCUIAqfmGIU3Z9bp4fTc-GAw.png?1687260786",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103031156288/original/AwQDPJayzoLf-YDgtIz_5YwqXcX-Aw5hYQ.png?1687261376"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2023-02-06T17:50:58+00:00",
    "updated_at": "2023-08-02T15:38:11+01:00",
    "id": 103000053499,
    "tags": []
  },
  {
    "title": "API Access",
    "text": "NOTE: To access and utilize the ViJi API, you need to be a registered user with the necessary permissions. If you meet these criteria, you will find an \"API Token\" under the cog icon in the top right. Now click the \"Copy\" icon and use the link to Swagger. NOTE: You can also Reset or Delete the token, however, if this occurs you will need to regenerate and authorize a new one. Once within the Swagger page click the \"Authorize\" button and paste the previously copied token and click \"Authorize\". NOTE: A token will only need to be replaced if it is deleted or Reset via the ViJi API Token page.",
    "category": "ViJi Track Documentation",
    "subcategory": "Glossary / Support / API",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061121816/original/kjbyaKC4uSkPZ7rRnVhDZSZ_dg3_0785gQ.png?1698764206",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061117049/original/SamfDA_84fuG_BW5aXX99vLAjva8ZdygGg.png?1698763568",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061117906/original/Lr2hFldlMz56A84QpWojz7PgkQTfywUVLA.png?1698763687"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2023-07-04T12:39:45+01:00",
    "updated_at": "2023-10-31T14:58:55+00:00",
    "id": 103000153822,
    "tags": []
  },
  {
    "title": "FAQ",
    "text": "Writing your first FAQ (Frequently Asked Questions) can be a great way to provide valuable information to your audience and address common queries they may have. Here's a step-by-step guide to help you get started: 1. Identify your target audience: Determine who your audience is and what questions they are likely to have. Understand their needs, concerns, and the information they may be seeking. 2. Brainstorm common questions: Start by brainstorming a list of questions that are frequently asked or anticipated by your audience. These questions should cover a broad range of topics related to your product, service, or organization. 3. Categorize questions: Once you have a list of questions, group them into categories or sections. This will help your readers navigate through the FAQ more easily and find the information they are looking for quickly. 4. Craft clear and concise answers: Write clear, straightforward answers to each question. Keep your responses concise and to the point, but make sure they provide enough information to address the query effectively. Use simple language and avoid jargon or technical terms that may confuse your readers. 5. Use a consistent format: Maintain a consistent format throughout your FAQ document. You can use a question-and-answer format, with the questions in bold or as headers followed by their respective answers. This helps readers quickly locate the information they need. 6. Anticipate additional questions: While drafting your answers, consider if there are any follow-up questions that may arise based on your responses. Include those anticipated follow-up questions and provide comprehensive answers to them as well. 7. Keep it updated: FAQs should be dynamic and reflect the evolving needs of your audience. Regularly review and update your FAQ to include new questions or address any changes in your product or service. 8. Add supplementary information: In addition to answering common questions, consider including supplementary information that may be helpful to your readers. This could include links to relevant resources, troubleshooting guides, or additional tips and recommendations. 9. Test and gather feedback: Share your FAQ with a small group of individuals or customers to gather feedback. Ask for their input on the clarity and usefulness of the content. Use this feedback to make improvements and refine your FAQ. 10. Make it easily accessible: Publish your FAQ on your website or platform where your audience can easily access it. Consider adding a search bar or an index to allow users to find specific questions quickly. Remember, an effective FAQ should provide value to your audience by addressing their concerns and helping them find the information they need. Continuously monitor and update your FAQ based on the feedback and evolving needs of your audience to ensure it remains a helpful resource.",
    "category": "ViJi Track Documentation",
    "subcategory": "Glossary / Support / API",
    "source": "Cowis Help Database",
    "url": null,
    "images": [],
    "has_images": false,
    "image_count": 0,
    "created_at": "2023-02-08T13:58:13+00:00",
    "updated_at": "2024-07-19T17:56:08+01:00",
    "id": 103000053901,
    "tags": []
  },
  {
    "title": "How to Upload a CSR Document",
    "text": "Here, you can upload the certificates, labels, and audits associated with your Entity and Items. Upon successful upload, ViJi Track will automatically categorize these documents as either Entity CSR Documents or Item CSR Documents. To begin, click 'Upload Document'. Step 1. Click the \"Upload Document\" button. Step 2. Select the document type using the dropdown and complete the form, attach any necessary CSR Documents. NOTE: If uploading an Entity document, you have the option to select \"no expiry date.\" Step 3. Click \"Save\" to complete the process. The uploaded document will be automatically categorized under either the Entity or Item CSR Document tabs. NOTE: It is important to select the correct document type to ensure that the CSR document is associated with the appropriate entity or product. This will allow the document to be accurately tracked and managed within ViJi Track. 4. When you upload a CSR Document to Viji Track, it will automatically initiate new CSR Commitments for your Entity. To authenticate and upload CSR Documents, you can conveniently access the \"CSR Documents\" tab. Furthermore, you have the option to use the \"Attach Product Order Lines\" button to continue building your supply chain. For more detailed information on how to attach your CSR Documents to your Product Order lines, please navigate to (How to Link your CSR Documents to Product Order Lines) CSR Document Upload Item CSR Document Upload",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Documents",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061302378/original/1HAi7JbxhzSEFenWLwXdF4dlhYYwWJU2Lw.png?1698838017",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061302673/original/Z7IcI7Fs3LXWX5edo9iD8hOQo1Sv6hOpKw.png?1698838076",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103060813560/original/GvoFYgJRhmMgwZ2sxqm7JtkgOJz6o50o6w.png?1698678574",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103060813940/original/33b7wept7HnH0AaFxZnt7spWqoe4FUYCgw.png?1698678620",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103060819143/original/AJrxIalsbrLo6FQIOzZry4fT9d_vJiPuEA.png?1698679366"
    ],
    "has_images": true,
    "image_count": 5,
    "created_at": "2023-04-13T13:34:46+01:00",
    "updated_at": "2023-11-01T11:32:45+00:00",
    "id": 103000098186,
    "tags": []
  },
  {
    "title": "Authentication of CSR Documents",
    "text": "TABLE OF CONTENTS Authenticate Remove Authentication Authenticating a CSR document helps to ensure that the information it contains is accurate and trustworthy. This is important for demonstrating transparency, building trust, and complying with regulations and standards. Authenticate After an Entity or Supplier uploads their CSR Documents, this action will trigger CSR Commitments that they must respond to. When they provide their answers and upload the requested documents, you will then have the option to review and verify their Commitments. Once an Entity or Item CSR Document has been uploaded, you can assess the legitimacy of the documents. CSR Documents have three different statuses: Authenticated: The CSR Document has been successfully uploaded. Verified: No CSR Document has been submitted, but a 'Yes' answer has been provided. Declared: Neither a CSR Document nor an answer has been provided. Step 1: To authenticate a CSR Document, click on the \"Actions\" icon and choose the \"Authenticate\" option. Step 2: Once completed the Authenticated icon will show next to the CSR Document. An notification email will also be sent to inform of authentication. Remove Authentication You can remove an authentication from a CSR Document at any point. To remove the authentication, click on the Actions menu located next to the Document, and then choose the option \"Remove Authentication.\" The status of the CSR Document will show blank until its once again Authenticated.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Documents",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049182620/original/IdoWYA6BueEK54kkHjKIOPaXjTz5wbMU7g.png?1694704436",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049183273/original/WX0x1yIbPXtzhAwt2xsQ8pR7mWT5tYjBkg.png?1694704561",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049189172/original/ZfsCHdnD_hIAH7jf4sjTcxoIlO5wneYBQQ.png?1694705591",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061315278/original/iaGhyGzDeW7gbIoZDJ03U6R4usta19OR1w.png?1698840183"
    ],
    "has_images": true,
    "image_count": 4,
    "created_at": "2023-05-09T12:23:21+01:00",
    "updated_at": "2023-11-01T12:08:54+00:00",
    "id": 103000110981,
    "tags": []
  },
  {
    "title": "How to Delete a CSR Document",
    "text": "To delete the CSR Document, click the three dots in the actions column and choose \"Delete.\" NOTE: Deleting the document will also remove any links between Purchase Order Lines, CSR Commitments, and the document. Consider this before deciding to delete the CSR Document. Please note that in order to delete a CSR Document, you must first confirm that it has not been authenticated. If it has been authenticated, you will need to remove the authentication before the delete option becomes available. If unsure please see @Authentication of CSR Documents When attempting to delete the CSR document, a warning message will appear indicating that all associated links, commitments, and purchase orders will also be removed. The items that will be deleted depend on whether it is an Entity or Product document. Delete: This action will permanently remove the document. Cancel: Selecting this option will take you back to the CSR Document list without deleting the document. Once deleted the CSR Document will be removed and a notification will appear to confirm the deletion.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Documents",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049193570/original/Svh5p36TwbkZDnchg7Z-eX5R9_2r9aCVsQ.png?1694706443",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049194113/original/Kn0_ggikLCsirRUBpoQQF3KfTaZY_DfU-Q.png?1694706552",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049194260/original/-EajOf8Uzmc-tHc3be7hnPGPzI6OAPwWpw.png?1694706582"
    ],
    "has_images": true,
    "image_count": 3,
    "created_at": "2023-05-09T14:58:26+01:00",
    "updated_at": "2023-09-14T16:49:53+01:00",
    "id": 103000111131,
    "tags": []
  },
  {
    "title": "Attaching An Item CSR Document",
    "text": "Attaching an Item CSR Document Tutorial V1 29/09 TABLE OF CONTENTS Attaching a CSR Document to a Item Order Line Removing an Attached Purchase Order Line from an Item CSR Document Attaching a CSR Document to a Item Order Line NOTE: This functionality is only available for Item CSR Documents. 1. Select the Item CSR Documents tab and choose \"Attach\" under Actions. 2. Select which Purchase Order Lines to attach by clicking the checkboxes then click 'Attach'. You can use the 'Add Filter' to narrow your list: Select a heading from the dropdown. Specify product, color, or order ID in the corresponding value field. Add multiple filters using '+Add Condition' button. 3. Once attached you will see the number of \"Attached\" lines within the CSR Documents Page. Removing an Attached Purchase Order Line from an Item CSR Document 1. To detach, using the same process as you would when attaching select the three dots and select \"Attach\". 2. Use the Actions button next to the Product Order Lines required and select \"Detach\". NOTE: In case you're uncertain about which lines are connected, you can refer to the \"Attached\" column, where a green check mark signifies that the corresponding line is attached. Please note that you cannot select multiple lines; they must be detached individually. \"Detach\": If you select this option, the detachment process will proceed. The CSR Document will be detached from the Purchase Order Line, and you will receive a notification confirming the successful detachment. \"Cancel\": Choosing this option will close the pop-up window, and the line will remain attached. NOTE: Detaching a line will result in the removal of any CSR Commitments that were triggered by that particular line. Ensure you consider this before detaching the CSR Document from the Product Order Line.",
    "category": "ViJi Track Documentation",
    "subcategory": "CSR Documents",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061369125/original/pQLiok2_OELGRe7qmPyFMUvYueSO57Avng.png?1698849322",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061369422/original/XHSuGtumaobQaxsQ-GfzzLwXMgUeKCHfxg.png?1698849391",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061369020/original/KzPi_Jj5iBEatADBU97wDSsQFNWF8-zd5w.png?1698849310",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049307960/original/gHfyOGh-d3LAF2GHAEv6k12Sl3toXrJiJg.png?1694768947",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049309224/original/6Lkxj7hiaRyLf4OUXxLMRZ5tOLlec5tkKA.png?1694769108",
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103049311078/original/IM_I6N1L9jy6axE_0NwG1P9MmizuPuM69Q.png?1694769374"
    ],
    "has_images": true,
    "image_count": 6,
    "created_at": "2023-04-13T13:36:04+01:00",
    "updated_at": "2023-11-01T14:42:13+00:00",
    "id": 103000098190,
    "tags": []
  },
  {
    "title": "Installation Guide",
    "text": "The integration of the plugin is simple and is broken down into steps below. Integration Step 1: Provide information on how to use the script in the project's index.html file. Step 2: Add the tag that will display the link to open the popup. Example with a very basic HTML page. Click here for VijiClic! Data Attributes To access the data, the plugin requires the data-brand attribute. data-brand allows for retrieving a brand's commitments. Value Brand Identifier Type string Mandatory yes Example data-brand=5d81429a-e014-4765-8a7c-d2716e55f72c You will find the data-brand attribute corresponding to your brand via the settings. 1: Click the cog icon. 2: Select ViJi Click. 3: Copy. Personalization The plugin has the following customization attributes: data-locale Allows you to manually change the language of the plugin. Supported languages are French and English. Value \"en\" or \"fr\" Type string Mandatory no (automatic detection) Example data-locale=\"en\"",
    "category": "ViJi Track Documentation",
    "subcategory": "ViJiClick Installation Guide",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061532977/original/EHOrN-6dSD2Wm3w0Ntv2zFb66GRwKl3pwQ.png?1698919566"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-11-02T10:12:33+00:00",
    "updated_at": "2023-11-02T11:10:13+00:00",
    "id": 103000251381,
    "tags": []
  },
  {
    "title": "Guide dinstallation VijiClic",
    "text": "L'intgration du plugin est simple et se dcompose en tapes ci-dessous. Intgration tape 1: Fournissez des informations sur l'utilisation du script dans le fichier index.html du projet. \" async> tape 2: Ajoutez la balise qui affichera le lien pour ouvrir la fentre contextuelle. Exemple avec une page HTML trs basique. Click here for VijiClic! Attributs de donnes Data-brand Pour accder aux donnes, le plugin ncessite l'attribut data-brand data-brand permet de rcuprer les engagements d'une marque. Valeur Identifiant de la marque Type string Obligatoire oui Exemple data-brand=5d81429a-e014-4765-8a7c-d2716e55f72c Vous trouverez l'attribut 'data-brand' correspondant  votre marque via les paramtres. 1: Cliquez sur l'icne de la roue dente 2: Cliquez sur ViJi Click 3: Copiez Personnalisation Le plugin dispose des attributs de personnalisation suivants : data-locale Cet attribut permet de changer manuellement la langue du plugin. Les langues prises en charge sont Franais et Anglais. Valeur en ou fr Type string Obligatoire non (dtection automatique) Exemple data-locale=fr",
    "category": "ViJi Track Documentation",
    "subcategory": "ViJiClick Installation Guide",
    "source": "Cowis Help Database",
    "url": null,
    "images": [
      "https://s3-eu-central-1.amazonaws.com/euc-cdn.freshdesk.com/data/helpdesk/attachments/production/103061548369/original/M1LeP3pVwTVwSJSJSU4GYOLwADn9GQ4HvQ.png?1698921253"
    ],
    "has_images": true,
    "image_count": 1,
    "created_at": "2023-11-02T10:52:11+00:00",
    "updated_at": "2023-11-02T11:09:43+00:00",
    "id": 103000251402,
    "tags": []
  }
]